Repository: pisilinux/main
Catalog: multimedia/misc/klavaro/files/*.po
Languages: tr

source: Yet another touch typing tutor
tr: Henüz başka bir yazma dersine başlamadınız

source: About 'Klavaro'
tr: 'Klavaro' Hakkında

source: Accelerating the touches practicing random words exercises.
tr: Hızlandırıcı rastgele kelime alıştırmaları.

source: Also the controls have tips which will appear if you hover over them with your mouse. These tips can come in very handy. To see how these tips work, position your mouse over the button below, and without clicking, wait for the tip to appear...
tr: Fare ile üzerinde durduğunuzda kontrollerin önerileri görüntülenecek. Bu öneriler çok kullanışlı olacak. Bu önerilerin nasıl çalıştığını görmek için farenizin konumunu tıklamadan düğmenin üzerinde tutun, önerinin görüntülenmesi için bekleyin...

source: Apply the selected item to create an exercise.
tr: Bir alıştırma oluşturmak için seçilmiş maddeye uygula.

source: Attention!
tr: Dikkat!

source: B_ack to menu
tr: Menüye Dön

source: Becoming proficient practicing complete paragraphs exercises.
tr: Paragraf alıştırmalarını tamamladıkça profesyonel oluyorsunuz.

source: Change language
tr: Dili değiştir

source: Charts showing the learning progress along the exercises.
tr: Karakterler alıştırmalar boyunca öğreneceğiniz süreçleri gösterir.

source: Clear all the progress data, for every module.
tr: Tüm modüller için tüm veri süreçlerini temizleyin.

source: Close this window, returning to the exercise.
tr: Bu pencereyi kapat, alıştırmalara dönüyoruz.

source: Close this window.
tr: Bu pencereyi kapat.

source: Co_urse information
tr: K_ur bilgisi

source: Country / Custom
tr: Ülke / Özel

source: Do you confirm?
tr: Onaylıyor musunuz?

source: Don't be shy about learning the basics!
tr: Temeli öğrenmede sıkılmayın!

source: Download from the web the most up to date ranking.
tr: Web'ten en güncel veri sıralamasını indirin.

source: Drag and drop text here to practice with it.
tr: İdman yapmak için metni buraya sürükle ve bırak.

source: Edit the character set to be used in lessons 44 through 50.
tr: 44 ile 50'nci dersler arasında kullanılacak karakter kümesini düzenle.

source: Edit the character set to be used in this lesson.
tr: Bu derste kullanılacak karakter kümesini düzenle.

source: Exit the application immediately.
tr: Uygulamadan acilen çık.

source: First steps with initial training
tr: Başlangıç eğitimiyle ilk adım

source: Font definition
tr: Yazı tipi tanımlama

source: General information about the program.
tr: Program hakkında genel bilgi.

source: Help?
tr: Yardım?

source: Hide extra information
tr: Ek bilgileri gizle

source: If you like those beautiful hands, click here to close this window keeping them.
tr: Bu güzel ellerden hoşlandıysanız, elleri açık bırakarak bu pencereyi kapatmak için buraya tıklayın.

source: Initial training for your fingers.
tr: Parmaklarınız için başlangıç eğitimi.

source: Keep this checked if you want to get those nice beeps.
tr: Bu hoş bip seslerini duymak istiyorsanız, seçimi koruyun.

source: Keyboard layout for modules 1 and 2. Also used informatively in the fluidness contest.
tr: Modül 1 ve 2 için klavye düzeni. Akıcılık içeriğinde bilgi verici olarak da kullanılır.

source: Klavaro - Main menu
tr: Klavaro - Ana menü

source: Klavaro - Progress
tr: Klavaro - İlerleme

source: Klavaro - Select file
tr: Klavaro - Dosya seç

source: Language for modules 3 and 4.
tr: 3 ve 4 modülleri için dil.

source: Learn how to type correctly
tr: Nasıl doğru yazacağınızı öğrenin

source: Little tip about this program.
tr: Bu program hakkında küçük ip ucu.

source: Load other exercises/lessons
tr: Başka alıştırmalar/dersler yükle

source: Memorizing the keyboard practicing random keys exercises.
tr: Rastgele tuş alıştırmaları klavye idmanını öğrenmek.

source: Paste text that was copied to the clipboard.
tr: Panoya kopyalanmış metni yapıştır.

source: Practice with complete texts
tr: Tam metinlerle idman yapın

source: Practice with random keys
tr: Rastgele tuşlarla idman yapın

source: Practice with random words
tr: Rastgele kelimelerle idman yapın

source: Press here to restart the exercise. Hotkey: [Ctrl R]
tr: Alıştırmayı yeniden başlatmak için buraya basın. Kısayol: [Ctrl R]

source: Publish to the web your local scores.
tr: Yerel puanlarınızı web'te yayınlayın.

source: Re_name:
tr: Yeniden adlandır:

source: Read a text file and add a copy of it here. The file must be encoded in UTF-8.
tr: Metin dosyasını olu ve buraya bir kopyasını ekle. Dosya UTF-8 biçiminde kodlanmalıdır.

source: Remember always: someone loves you!
tr: Daima hatırla: biri seni seviyor!

source: Remove the selected custom layout.
tr: Seçilen özel düzeni kaldır.

source: Remove the selected item.
tr: Seçilen ögeyi kaldır.

source: Rename the selected item.
tr: Seçilen ögeyi yeniden adlandır.

source: Return to the main menu.
tr: Ana menüye geri dön.

source: Return without any modification.
tr: Değişiklik yapmadan geri dön.

source: S_ave as:
tr: Farklı kaydet:

source: Save the current keyboard layout with the name specified above.
tr: Yukarıda isimlendirilmiş geçerli klavye düzenini kaydet.

source: Select the font to be used in the exercise window.
tr: Alıştırma penceresinde kullanılacak fontu seç.

source: Show extra information
tr: Ek bilgi göster

source: Show local and external scores from other users.
tr: Diğer kullanıcıların yerel ve harici puanlarını göster.

source: Show next screen.
tr: Sonraki ekranı göster.

source: Show previous screen.
tr: Önceki ekranı göster.

source: Show the virtual keyboard and the relation between fingers and keys.
tr: Parmaklar ile tuşlar arasındaki ilişkiyi ve sanal klavyeyi göster.

source: Speech
tr: Telaffuz et

source: The main menu of the application is very straightforward. Just select the type of exercise you wish to take. Do not worry about clicking any button on the screen. The buttons will never hurt you!
tr: Uygulamanın ana menüsü çok basittir. Almak istediğiniz alıştırma türünü seçiniz. Ekrandaki bir düğmeye basarken endişelenmeyin. Düğmeler sizi incitmeyecektir!

source: This is a specific exercise, adjusted to your error profile.
tr: Bu belirlenmiş bir alıştırmadır, hata profilinize göre ayarlanmıştır.

source: This is a tip. Now you press this button to return to the main menu.
tr: Bu bir öneridir. Şimdi ana menüye dönmek için bu tuşa basın.

source: Toggles the shift effect on the keys. Alternates between the upper and lower characters of the keys.
tr: Üst karakterler tuşlardaki değiştirme etkisidir. Tuşların alt ve üst karakterleri arasında değiştirir.

source: Top 10
tr: En Yüksek 10

source: Value
tr: Değer

source: Variant
tr: Değişken

source: Your language here.
tr: Diliniz burada.

source: _About...
tr: Hakkında...

source: _Apply
tr: Uygula

source: _Beep
tr: _Bip

source: _Cancel
tr: İptal

source: _Close
tr: Kapat

source: _Font
tr: Yazı tipi

source: _Help
tr: Yardım

source: _Keep hands
tr: _Ellerinizi tutunuz

source: _Keyboard
tr: Klavye

source: _Keyboard:
tr: Klavye:

source: _Language:
tr: Dil:

source: _Lesson:
tr: Ders:

source: _Next step
tr: Sonraki adım

source: _No
tr: Hayır

source: _Open
tr: Aç

source: _Open text file
tr: Metin dosyası aç

source: _Other texts
tr: Diğer metinler

source: _Participate
tr: _Katıl

source: _Paste from clipboard
tr: Panodan yapıştır

source: _Previous step
tr: Önceki adım

source: _Progress
tr: İlerleme

source: _Remove
tr: Kaldır

source: _Remove copied file
tr: Kopyalanan dosyayı kaldır

source: _Reset
tr: Sıfırla

source: _Save and use
tr: Kaydet ve kullan

source: _Top 10
tr: En Yüksek 10

source: _Update
tr: Güncelle

source: _Yes
tr: Evet

source: thumbs
tr: başparmak

source: (Custom)
tr: (Özel)

source: (Edit custom)
tr: (Özeli düzenle)

source: (Default)
tr: (Varsayılan)

source: Dictation mode (depends on this speech synthesizer: %s)
tr: Yazdırma kipi (bu konuşma sentezleyiciye bağlıdır: %s)

source: Introduction
tr: Giriş

source: Basic course
tr: Temel kur

source: Adaptability
tr: Uyumluluk

source: Speed
tr: Hız

source: Fluidity
tr: Akıcılık

source: Keys:
tr: Anahtarlar:

source: Connecting...
tr: Bağlanıyor...

source: Overwrite user layout
tr: Kullanıcı düzeni üzerine yaz

source: This will OVERWRITE an existent keyboard layout.
tr: Bu, var olan klavye düzeninin ÜZERİNE YAZAR.

source: Remove user layout
tr: Kullanıcı düzenini kaldır

source: This will REMOVE an existent keyboard layout.
tr: Bu, var olan klavye düzenini İPTAL EDER.

source: Reset progress data
tr: İlerleme verisini sıfırla

source: This will DELETE all the progress data shown in the charts.
tr: Bu, karakter kümesinde gösterilen tüm süreçleri SİLER.

source: Accuracy
tr: Doğruluk

source: (WPM)
tr: (K/Dk)

source: Errors
tr: Hatalar

source: Score
tr: Puan

source: en
tr: ing

source: The basic course focuses on having you read the characters presented to you on screen and typing the corresponding keys. Remember to keep your hands correctly oriented on the home row of the keyboard at all times (see introduction on main menu).
tr: Temel kurs ekranda görünen hazırlanmış karakterleri okumanıza ve uygun olanı yazmanıza odaklanır. Her zaman ellerinizi klavyedeki başlangıç satırındaki konumunda tutacağınızı hatırlayın (ana menüdeki girişe bakın).

source: The key set used in each series will be shown in the above message line. The [Space], [Shift] and [Enter] keys may not show up there but are used very often.
tr: Her seride kullanılacak tuş serisi yukarıdaki mesaj satırında gösterilecek. [Space], [Shift] ve [Enter] tuşları orada gösterilmeyecek ancak sık sık kullanılacaklar.

source: The message line below follows and echoes your key presses. If required, it changes and displays instructions for actions required from you.
tr: Mesaj satırı takip etmeye ve tuş basışlarınızın yansımasına müsaade eder. Gerekiyorsa, değişir ve istediğiniz hareketler için bilgi görüntüler.

source: Here you may practice and improve your memorization of all keys. There will be sentences presented with nonsense words which mix some numbers and symbols.
tr: Buyurun yapın ve tuş ezberinizi artırın. Sayılarla karıştırılmış anlamsız kelimeler ve sembollerle oluşturulmuş cümleler olacak.

source: In order to keep the lesson contents language and keyboard independent, accented letter combinations will probably not appear. For real word sentences, please use the fourth option of the main menu (about fluidness).
tr: Özgün klavye ve ders dil içeriğini muhafaza etmek için, muhtemelen şive harf birleşimleri görüntülenmeyecek. Gerçek kelime cümleleri için lütfen ana menünün (akıcılık hakkında) dördüncü seçeneğini kullanın.

source: After each exercise there will be a brief statistics panel reviewing your performance along with some relevant comments.
tr: Her alıştırmadan sonra konu ile ilgili bazı yorumlar ile size gösterilecek bazı istatistikler var.

source: This exercise is very similar to the second one, for adaptability. The difference is that here you'll type real words.
tr: Bu alıştırma uygunluk için ikincisi ile aynıdır. Fark, burada gerçek kelimeleri yazacağınızdır.

source: The default language is the actual one of the interface. But you may select any other texts with words you would like to use. Press the 'Other' option above and add files containing those texts.
tr: Geçerli dil arayüzün gerçek dillerinden biridir. Ancak kullanmaktan hoşlandığınız kelimeli diğer metinleri seçebilirsiniz. Yukarıdaki seçenek için 'Diğer''e basın ve bu metinleri içeren dosyaları ekleyiniz.

source: With this exercise the focus is on speed. So, you are supposed to type really fast and I will only flatter you when you deserve it!
tr: Bu alıştırmayla hıza odaklanacaksınız. Öyle ki, gerçekten hızlı yazdığınızı farz edin ve başardığınızda sizi öveceğim!

source: We will now use complete sentences and paragraphs which make logical sense. This may distract you while you type if you try to understand what you are entering. The previous exercises were aimed at getting you to type without interpreting and analyzing the content.
tr: Şimdi cümleleri ve paragrafları tamamlamayı kullanacağız. Ne yazdığınızı anlamaya çalışırsanız yazarken şaşırabilirsiniz. Önceki alıştırmalar sizin yorumlamadan ve içeriği analiz etmeden yazmanızı hedeflemekteydi.

source: We do not mean to imply that the typists must behave like a robot, without understanding what they type. We do aim to develop the skill of typing, making it an automatic reflex akin to the acts of walking, talking, etc. After reaching this goal, the act of typing will become automatic and require little concentration. Then you will be able to pay attention to the real meaning of the text.
tr: Daktilocular robot gibi davranır, anlamadan yazarlar demek istemiyoruz. Yazma becerisini geliştirmeyi, konuşma,yürüme vb. hareketlere yakın otomatik refleks haline getirmeyi hedefliyoruz. Bu hedeften sonra yazma hareketleri otomatikleşecek ve az bir yoğunlaşma gerekecektir. Sonra metinlerin gerçek anlamları için dikkat harcayabileceksiniz.

source: These exercises are longer. Each exercise consists of three paragraphs and the emphasis is placed on correctness and rhythm, with a minimum speed requirement. Here you will be required to use the backspace key to correct any mistakes. In other words, only input without error will be accepted.
tr: Bu alıştırmalar daha uzun. Her alıştırma üç paragraftan oluşur ve önemli olan gerekli minimum hızda doğruluk ve ahenktir. Hataları düzeltmek için backspace tuşunu kullanmak isteyeceksiniz. Diğer bir deyişle sadece hatasız giriş kabul edilecek.

source: Correct positioning of the hands and fingers is very important to efficient typing. You will learn faster and type better if you follow the next recommendations.
tr: Verimli yazma için ellerin ve parmakların doğru konumlandırılması çok önemlidir. Eğer sonraki tavsiyeleri takip ederseniz daha hızlı ve daha iyi yazacaksınız.

source: The index-finger tips rest over each of the two keys which have a small raised mark, in the center of the keyboard.
tr: İşaret parmağı önerileri, klavyenin merkezinde basmak için küçük kalkışlarla iki tuşun her biri üzerinde duracak.

source: These marks function as 'tactile hooks' for your fingers to remain at the correct position. This way, with a little experience, you will not need to look at the keyboard to see if your fingers are properly positioned.
tr: Bu işaretler parmaklarınız için 'dokunma çengeli' olarak doğru konumda kalmak için işlevini yerine getirir. Bu şekilde, küçük deneyimlerle, parmaklarınız uygun konumdaysa görmek için klavyeye bakmaya ihtiyacınız olmayacak.

source: The tips of the other fingers lie naturally beside the index ones, over the keys on the same row of the keyboard.
tr: Diğer parmaklar işaret parmağının yanında doğal haliyle klavyenin aynı satırındaki tuşlar üzerinde duracak.

source: The outside edges of your thumbs rest over the space bar.
tr: Başparmağınızın dış köşesi boşluk çubuğunun üzerinde bekleyecek.

source: The part of the hands closest to the wrist (the base) rest over the table, outside the keyboard. Without this kind of support the arms would quickly tire.
tr: Ellerinizin bileğe en yakın parçası (kökü) masada duracak, dış tarafı klavyede. Bunsuz kol desteği çeşitleri çabucak yoracaktır.

source: This is referred to as the home position for the hands. From it the fingers move all over the keyboard, reaching all the keys as naturally and quickly as possible. To reach this goal one uses a specific relation between each key and finger. This relation will be learned gradually as you complete the basic course.
tr: Bu, ellerinizin başlangıç konumuna gönderilir. Bulunduğu yerden parmaklarınız klavye üzerinde hareket eder, olabildiği kadar çabuk ve doğal olarak tüm tuşlara ulaşacak. Bu hedeflerden birine ulaşmak her parmak ve tuş arasında özel bir ilişki kullanır. Bu ilişki temel kursu tamamladığınızda yavaş yavaş öğrenilmiş olacak.

source: When learning the relation between fingers and keys, it is very important that you only move the finger which must press the key and allow all other fingers to remain in the home position.
tr: Tuşlar ile parmaklar arasındaki ilişkiyi öğrendiğinizde, tuşlara basarken yalnızca parmaklarınızı hareket ettirmeniz çok önemlidir ve bütün parmaklarınızın başlangıçtaki yerinde kalmasına müsaade edin.

source: After memorizing this relationship, you can relax the previous rule some, so that you can attain greater speed while typing.
tr: Bu ilişkileri öğrendikten sonra, önceki bazı kuralları gevşetebilirsiniz, öyle ki yazarken daha büyük bir hıza ulaşabilirsiniz.

source: You should be prepared to start training with the basic course. It will take effort and patience to be successful as a typist. We trust you have these and look forward to your success!
tr: Temel kurs ile eğitime başlamaya hazırlanmalısınız. Bir katip gibi başarılı olmak sabır ve çaba gerektirir. Size güveniyoruz ve başarılarınızı bekliyoruz!

source: Step %i
tr: Adım %1

source: To position the hands
tr: Elleri konumlandırmak

source: Go ahead!
tr: Devam et!

source: Relation between fingers and keys
tr: Tuşlar ve parmaklar arasındaki ilişki

source: Click on any key to see which finger you must use:
tr: Hangi parmağınızı kullanacağınızı görmek için bir tuşa basın:

source: Keyboard
tr: Klavye

source: Create or modify a custom keyboard layout
tr: Özel klavye düzeni oluştur veya düzenle

source: small finger
tr: küçük parmak

source: ring finger
tr: yüzük parmağı

source: middle finger
tr: orta parmak

source: index finger
tr: işaret parmağı

source: Press and edit me
tr: Bas ve beni düzenle

source: Lesson:
tr: Ders:

source: Paragraphs:
tr: Paragraflar:

source: Klavaro - Basic Course
tr: Klavaro - Temel Kur

source: Klavaro - Adaptability
tr: Klavaro - Uygunluk

source: Adaptability exercises: automating the fingers responses, typing over all the keyboard.
tr: Uyumluluk alıştırmaları: parmak tepkilerini otomatikleştirin, klavye üzerinde yazın.

source: Klavaro - Velocity
tr: Klavaro - Hız

source: Velocity exercises: accelerate typing real words.
tr: Hız alıştırmaları: gerçek kelimelerle yazmayı hızlandırır.

source: Klavaro - Fluidness
tr: Klavaro - Akıcılık

source: Fluidness exercises: accuracy typing good sense paragraphs.
tr: Akıcılık alıştırmaları: paragrafları doğru yazmak güzeldir.

source: End of exercise. Press [Enter] to start another.
tr: Alıştırmanın sonu. Diğerini açmak için [Enter]'a basın.

source: Learning the key positions.
tr: Tuş konumlarını öğrenin.

source: Press any key to start the exercise.
tr: Alıştırmayı başlatmak için bir tuşa basın.

source: Start typing when you are ready.
tr: Hazır olduğunda yazmaya başla.

source: Use backspace to correct errors.
tr: Hataları düzeltmek için backspace tuşunu kullanın.

source: ps.: logging not performed for this session: the number of typed characters (%i) must be greater than %i.
tr: not: bu bölüm için performansınızı kaydedin: Karakter yazma sayınız (%i) %i 'oranından yüksek olmalıdır.

source: Default
tr: Varsayılan

source: ps.: you have entered the Top 10 list, great!
tr: not: çok iyi! En yüksek 10 listesine girdiniz.

source: ps.: the text you just typed doesn't seem to be similar to ordinary texts in the language currently selected: we can't account for it in the 'Top 10' contest.
tr: not: yazdığınız metin seçilmiş geçerli dildeki sıradan metinlere benziyor gibi görünmüyor: 'En Yüksek 10' içeriğine yerleştiremeyiz.

source: STATISTICS
tr: İSTATİSTİKLER

source: Elapsed time:
tr: Geçen süre:

source: minute and
tr: dakika ve

source: second
tr: saniye

source: Error ratio:
tr: Hata oranı:

source: Accuracy:
tr: Doğruluk:

source: Goal:
tr: Hedef:

source: Characters per second:
tr: Saniyedeki karakter sayısı:

source: (CPS)
tr: (H/Sn)

source: Words per minute:
tr: Dakikada kelime:

source: Fluidness:
tr: Akıcılık:

source: Comments:
tr: Yorumlar:

source: space
tr: boşluk

source: enter
tr: giriş

source: apostrophe
tr: kesme işareti

source: quote
tr: tırnak işareti

source: ampersand
tr: & işareti

source: Character
tr: Karakter

source: Date & Time
tr: Tarih & Zaman

source: Positions of keys seems to be learned!
tr: Tuşların konumlarını öğrenmiş gibi görünüyorsunuz!

source: Congratulations! You have accomplished the entire basic course. Go to the next type of exercise: adaptability. There you will practice mainly the accuracy.
tr: Tebrikler! Giriş temel kursunu başardınız. Sonraki alıştırma türüne geçiniz: uygunluk. Başlıca doğruluk alıştırmasına buyurun.

source: All right, now you got it! Go to the next lesson.
tr: Tamam, şimdi anladınız! Sonraki derse geç.

source: Your accuracy rate is below 90%... Could you please try again to improve it?
tr: Doğruluk oranınız %90'nın altında... Artırmak için tekrar dener misiniz?

source: You are doing well. But... Could you make the accuracy reach 95%?
tr: İyisiniz. Ancak... % 95 doğruluk oranına ulaşabilir misiniz?

source: You are almost there, but your accuracy rate is still below %.0f%%. Try a few more times, or maybe you're getting upset, so go to other kind of exercise.
tr: Neredeyse başardınız ancak %.0f%% oranının altındasınız. Birkaç kez deneyiniz yoksa başarısız olabilirsiniz, böylece diğer alıştırma türüne geçebilirsiniz

source: Pasted_or_dropped
tr: Yapıştır_veya_bırak

source: You are just beginning. Be patient, try it again every day, rest and don't worry so much: persistence and practice will improve your velocity.
tr: Henüz başlangıçtasınız. Sabırlı olun, her gün tekrarlayın, dinlenin ve çok fazla endişelenmeyin: devamlılık ve alıştırmalar hızınızı artıracaktır.

source: Still away from the highway. You can make better... Try at least 20 WPM.
tr: Hala yüksek hızdan uzaksınız. Daha iyisini yapabilirsiniz... En az 20 K/Dk'ya ulaşmaya çalışınız.

source: You are doing well, but need to go faster. And don't forget the accuracy. Try to get 30 WPM.
tr: İyisiniz ancak daha hızlı olmalısınız. Ve doğruluğu unutmayın.30 K/Dk'ya ulaşmaya çalışın.

source: Fine. Now you need to start running. Can you reach 40 WPM?
tr: Güzel. Şimdi koşmaya başlamalısınız. 40 K/Dk'ya ulaşabilir misiniz?

source: Very good. You are almost there. Can you finally reach %.0f WPM?
tr: Çok iyi. Neredeyse başardınız. Son olarak %.0f K/Dk'ya ulaşabilir misiniz?

source: Excellent. For this course, that is enough. Try now the fluidness exercises, OK?
tr: Mükemmel. Bu kurs için bu yeterli. Şimdi akıcı alıştırmaları deneyin, tamam?

source: Fast! Are you training for a competition? So, try to get 70 WPM!
tr: HIzlı! Bir müsabakaya mı hazırlanıyorsunuz? Öyleyse, 70 K/Dk'ya çıkmaya çalışın!

source: Top of "qwerty". Now it's time to change to the Dvorak mode. Are you afraid of reaching 80 WPM?
tr: "qwerty"'nin sonu. Şimdi Drovak yöntemini değiştirme zamanı. 80 K/Dk'ya ulaşmaktan korkuyor musunuz?

source: Dvorak mode dominated! Can you fly at 90 WPM?
tr: Dvorak yöntemi açık! 90 K/Dk'da yazabilir misiniz?

source: Dvorak master! I have no words to express my admiration!
tr: Öğretmen Dvorak! Hayranlığımı ifade edecek kelime bulamıyorum!

source: You type accurately but not so fast. Can you reach %.0f WPM?
tr: Tam olarak yazdınız ancak yeterince hızlı değil. %.0f K/Dk'ya ulaşabilir misiniz?

source: How can you type so fast? You have exceeded all my expectations. Are you a machine? Could you teach me? I can not help you anymore. Go to an expert!
tr: Daha hızlı nasıl yazabilirsiniz? Tüm beklentilerime ulaştınız. Bir makine misiniz? Bana öğretebilir misiniz? Sana daha fazla yardımcı olamam. Bir uzmana gidiniz!

source: Name
tr: İsim

source: Chars
tr: Karakterler

source: When
tr: Ne zaman

source: Local scores
tr: Yerel puanlar

source: External scores
tr: Dış puanlar

source: Empty ranking. Please practice fluidness.
tr: Boş derece. Lütfen akıcılık idmanı yapın.

source: Not able to download files
tr: İndirilemeyen dosyalar

source: not found
tr: bulunamadı
