Repository: pisilinux/main
Catalog: multimedia/misc/klavaro/files/*.po
Languages: tr

source: Are you sure you have it installed in your system?
tr: Sisteminizde yüklenmiş olduğundan emin misiniz?

source: Could not download file from the host server.
tr: Sunucudan dosya indirilemez.

source: Not able to upload files
tr: Yüklenemeyen dosyalar

source: Could not upload/download scores.
tr: Puanlar yüklenip/indirilemez.
