From 59edfa8ba43a0ecac55003a6333f7fd07cfffb19 Mon Sep 17 00:00:00 2001
From: Peter Jones <pjones@redhat.com>
Date: Tue, 12 Nov 2019 13:22:13 -0500
Subject: [PATCH 10/10] Update generated ABI

Signed-off-by: Peter Jones <pjones@redhat.com>
---
 src/libefiboot.abixml | 2161 +++++++++++++++++++++-----------------
 src/libefivar.abixml  | 2287 +++++++++++++++++++++--------------------
 2 files changed, 2344 insertions(+), 2104 deletions(-)

diff --git a/src/libefiboot.abixml b/src/libefiboot.abixml
index 29a57c5a4c5..4cd3d5825d7 100644
--- a/src/libefiboot.abixml
+++ b/src/libefiboot.abixml
@@ -21,1583 +21,1806 @@
     <elf-symbol name='efi_loadopt_path' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='efi_loadopt_pathlen' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
   </elf-function-symbols>
-  <abi-instr version='1.0' address-size='64' path='linux-sas.c' comp-dir-path='src' language='LANG_C99'>
-    <class-decl name='dev_probe' size-in-bits='384' is-struct='yes' visibility='default' filepath='src/linux.h' line='238' column='1' id='type-id-1'>
-      <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='name' type-id='type-id-2' visibility='default' filepath='src/linux.h' line='239' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='iftypes' type-id='type-id-3' visibility='default' filepath='src/linux.h' line='240' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='flags' type-id='type-id-4' visibility='default' filepath='src/linux.h' line='241' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='parse' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='242' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='create' type-id='type-id-6' visibility='default' filepath='src/linux.h' line='243' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='make_part_name' type-id='type-id-7' visibility='default' filepath='src/linux.h' line='245' column='1'/>
-      </data-member>
-    </class-decl>
-    <type-decl name='char' size-in-bits='8' id='type-id-8'/>
-    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-2'/>
-    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-9'/>
-    <enum-decl name='interface_type' filepath='src/linux.h' line='90' column='1' id='type-id-10'>
-      <underlying-type type-id='type-id-9'/>
-      <enumerator name='unknown' value='0'/>
-      <enumerator name='isa' value='1'/>
-      <enumerator name='pci' value='2'/>
-      <enumerator name='network' value='3'/>
-      <enumerator name='ata' value='4'/>
-      <enumerator name='atapi' value='5'/>
-      <enumerator name='scsi' value='6'/>
-      <enumerator name='sata' value='7'/>
-      <enumerator name='sas' value='8'/>
-      <enumerator name='usb' value='9'/>
-      <enumerator name='i1394' value='10'/>
-      <enumerator name='fibre' value='11'/>
-      <enumerator name='i2o' value='12'/>
-      <enumerator name='md' value='13'/>
-      <enumerator name='virtblk' value='14'/>
-      <enumerator name='nvme' value='15'/>
-      <enumerator name='nd_pmem' value='16'/>
-    </enum-decl>
-    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-3'/>
-    <type-decl name='unsigned int' size-in-bits='32' id='type-id-11'/>
-    <typedef-decl name='__uint32_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-12'/>
-    <typedef-decl name='uint32_t' type-id='type-id-12' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-4'/>
-    <type-decl name='long int' size-in-bits='64' id='type-id-13'/>
-    <typedef-decl name='__ssize_t' type-id='type-id-13' filepath='/usr/include/bits/types.h' line='191' column='1' id='type-id-14'/>
-    <typedef-decl name='ssize_t' type-id='type-id-14' filepath='/usr/include/unistd.h' line='220' column='1' id='type-id-15'/>
-    <class-decl name='device' size-in-bits='2560' is-struct='yes' visibility='default' filepath='src/linux.h' line='101' column='1' id='type-id-16'>
-      <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='interface_type' type-id='type-id-10' visibility='default' filepath='src/linux.h' line='102' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='link' type-id='type-id-2' visibility='default' filepath='src/linux.h' line='103' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='device' type-id='type-id-2' visibility='default' filepath='src/linux.h' line='104' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='driver' type-id='type-id-2' visibility='default' filepath='src/linux.h' line='105' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='probes' type-id='type-id-17' visibility='default' filepath='src/linux.h' line='107' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='n_probes' type-id='type-id-11' visibility='default' filepath='src/linux.h' line='108' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='384'>
-        <var-decl name='' type-id='type-id-18' visibility='default'/>
-      </data-member>
-    </class-decl>
-    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-19'/>
-    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-17'/>
-    <union-decl name='__anonymous_union__' size-in-bits='2176' is-anonymous='yes' visibility='default' filepath='src/linux.h' line='110' column='1' id='type-id-18'>
-      <data-member access='private'>
-        <var-decl name='' type-id='type-id-20' visibility='default'/>
-      </data-member>
-      <data-member access='private'>
-        <var-decl name='ifname' type-id='type-id-2' visibility='default' filepath='src/linux.h' line='137' column='1'/>
-      </data-member>
-    </union-decl>
-    <class-decl name='__anonymous_struct__' size-in-bits='2176' is-struct='yes' is-anonymous='yes' visibility='default' filepath='src/linux.h' line='111' column='1' id='type-id-20'>
-      <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='stat' type-id='type-id-21' visibility='default' filepath='src/linux.h' line='112' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='1152'>
-        <var-decl name='controllernum' type-id='type-id-11' visibility='default' filepath='src/linux.h' line='114' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='1184'>
-        <var-decl name='disknum' type-id='type-id-11' visibility='default' filepath='src/linux.h' line='115' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='1216'>
-        <var-decl name='part' type-id='type-id-22' visibility='default' filepath='src/linux.h' line='116' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='1280'>
-        <var-decl name='major' type-id='type-id-23' visibility='default' filepath='src/linux.h' line='117' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='1344'>
-        <var-decl name='minor' type-id='type-id-4' visibility='default' filepath='src/linux.h' line='118' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='1376'>
-        <var-decl name='edd10_devicenum' type-id='type-id-4' visibility='default' filepath='src/linux.h' line='119' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='1408'>
-        <var-decl name='disk_name' type-id='type-id-2' visibility='default' filepath='src/linux.h' line='121' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='1472'>
-        <var-decl name='part_name' type-id='type-id-2' visibility='default' filepath='src/linux.h' line='122' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='1536'>
-        <var-decl name='pci_root' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='124' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='1728'>
-        <var-decl name='n_pci_devs' type-id='type-id-11' visibility='default' filepath='src/linux.h' line='125' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='1792'>
-        <var-decl name='pci_dev' type-id='type-id-25' visibility='default' filepath='src/linux.h' line='126' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='1856'>
-        <var-decl name='' type-id='type-id-26' visibility='default'/>
-      </data-member>
-    </class-decl>
-    <class-decl name='stat' size-in-bits='1152' is-struct='yes' visibility='default' filepath='/usr/include/bits/stat.h' line='46' column='1' id='type-id-21'>
-      <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='st_dev' type-id='type-id-27' visibility='default' filepath='/usr/include/bits/stat.h' line='48' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='st_ino' type-id='type-id-28' visibility='default' filepath='/usr/include/bits/stat.h' line='53' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='st_nlink' type-id='type-id-29' visibility='default' filepath='/usr/include/bits/stat.h' line='61' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='st_mode' type-id='type-id-30' visibility='default' filepath='/usr/include/bits/stat.h' line='62' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='224'>
-        <var-decl name='st_uid' type-id='type-id-31' visibility='default' filepath='/usr/include/bits/stat.h' line='64' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='st_gid' type-id='type-id-32' visibility='default' filepath='/usr/include/bits/stat.h' line='65' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='288'>
-        <var-decl name='__pad0' type-id='type-id-22' visibility='default' filepath='/usr/include/bits/stat.h' line='67' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='st_rdev' type-id='type-id-27' visibility='default' filepath='/usr/include/bits/stat.h' line='69' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='384'>
-        <var-decl name='st_size' type-id='type-id-33' visibility='default' filepath='/usr/include/bits/stat.h' line='74' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='448'>
-        <var-decl name='st_blksize' type-id='type-id-34' visibility='default' filepath='/usr/include/bits/stat.h' line='78' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='512'>
-        <var-decl name='st_blocks' type-id='type-id-35' visibility='default' filepath='/usr/include/bits/stat.h' line='80' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='576'>
-        <var-decl name='st_atim' type-id='type-id-36' visibility='default' filepath='/usr/include/bits/stat.h' line='91' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='704'>
-        <var-decl name='st_mtim' type-id='type-id-36' visibility='default' filepath='/usr/include/bits/stat.h' line='92' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='832'>
-        <var-decl name='st_ctim' type-id='type-id-36' visibility='default' filepath='/usr/include/bits/stat.h' line='93' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='960'>
-        <var-decl name='__glibc_reserved' type-id='type-id-37' visibility='default' filepath='/usr/include/bits/stat.h' line='106' column='1'/>
-      </data-member>
-    </class-decl>
-    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-38'/>
-    <typedef-decl name='__dev_t' type-id='type-id-38' filepath='/usr/include/bits/types.h' line='143' column='1' id='type-id-27'/>
-    <typedef-decl name='__ino_t' type-id='type-id-38' filepath='/usr/include/bits/types.h' line='146' column='1' id='type-id-28'/>
-    <typedef-decl name='__nlink_t' type-id='type-id-38' filepath='/usr/include/bits/types.h' line='149' column='1' id='type-id-29'/>
-    <typedef-decl name='__mode_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='148' column='1' id='type-id-30'/>
-    <typedef-decl name='__uid_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='144' column='1' id='type-id-31'/>
-    <typedef-decl name='__gid_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='145' column='1' id='type-id-32'/>
-    <type-decl name='int' size-in-bits='32' id='type-id-22'/>
-    <typedef-decl name='__off_t' type-id='type-id-13' filepath='/usr/include/bits/types.h' line='150' column='1' id='type-id-33'/>
-    <typedef-decl name='__blksize_t' type-id='type-id-13' filepath='/usr/include/bits/types.h' line='172' column='1' id='type-id-34'/>
-    <typedef-decl name='__blkcnt_t' type-id='type-id-13' filepath='/usr/include/bits/types.h' line='177' column='1' id='type-id-35'/>
-    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='9' column='1' id='type-id-36'>
-      <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='tv_sec' type-id='type-id-39' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='tv_nsec' type-id='type-id-40' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='12' column='1'/>
-      </data-member>
-    </class-decl>
-    <typedef-decl name='__time_t' type-id='type-id-13' filepath='/usr/include/bits/types.h' line='158' column='1' id='type-id-39'/>
-    <typedef-decl name='__syscall_slong_t' type-id='type-id-13' filepath='/usr/include/bits/types.h' line='194' column='1' id='type-id-40'/>
-
-    <array-type-def dimensions='1' type-id='type-id-40' size-in-bits='192' id='type-id-37'>
-      <subrange length='3' type-id='type-id-38' id='type-id-41'/>
-
-    </array-type-def>
-    <typedef-decl name='__uint64_t' type-id='type-id-38' filepath='/usr/include/bits/types.h' line='44' column='1' id='type-id-42'/>
-    <typedef-decl name='uint64_t' type-id='type-id-42' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-23'/>
-    <class-decl name='pci_root_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/linux.h' line='24' column='1' id='type-id-24'>
-      <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='pci_root_domain' type-id='type-id-43' visibility='default' filepath='src/linux.h' line='25' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='16'>
-        <var-decl name='pci_root_bus' type-id='type-id-44' visibility='default' filepath='src/linux.h' line='26' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='pci_root_acpi_hid' type-id='type-id-4' visibility='default' filepath='src/linux.h' line='27' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='pci_root_acpi_uid' type-id='type-id-23' visibility='default' filepath='src/linux.h' line='28' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='pci_root_acpi_uid_str' type-id='type-id-2' visibility='default' filepath='src/linux.h' line='29' column='1'/>
-      </data-member>
-    </class-decl>
-    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-45'/>
-    <typedef-decl name='__uint16_t' type-id='type-id-45' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-46'/>
-    <typedef-decl name='uint16_t' type-id='type-id-46' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-43'/>
-    <type-decl name='unsigned char' size-in-bits='8' id='type-id-47'/>
-    <typedef-decl name='__uint8_t' type-id='type-id-47' filepath='/usr/include/bits/types.h' line='37' column='1' id='type-id-48'/>
-    <typedef-decl name='uint8_t' type-id='type-id-48' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-44'/>
-    <class-decl name='pci_dev_info' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/linux.h' line='32' column='1' id='type-id-49'>
-      <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='pci_domain' type-id='type-id-43' visibility='default' filepath='src/linux.h' line='33' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='16'>
-        <var-decl name='pci_bus' type-id='type-id-44' visibility='default' filepath='src/linux.h' line='34' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='24'>
-        <var-decl name='pci_device' type-id='type-id-44' visibility='default' filepath='src/linux.h' line='35' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='pci_function' type-id='type-id-44' visibility='default' filepath='src/linux.h' line='36' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='driverlink' type-id='type-id-2' visibility='default' filepath='src/linux.h' line='37' column='1'/>
-      </data-member>
-    </class-decl>
-    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-25'/>
-    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='src/linux.h' line='128' column='1' id='type-id-26'>
-      <data-member access='private'>
-        <var-decl name='scsi_info' type-id='type-id-50' visibility='default' filepath='src/linux.h' line='129' column='1'/>
-      </data-member>
-      <data-member access='private'>
-        <var-decl name='sas_info' type-id='type-id-51' visibility='default' filepath='src/linux.h' line='130' column='1'/>
-      </data-member>
-      <data-member access='private'>
-        <var-decl name='sata_info' type-id='type-id-52' visibility='default' filepath='src/linux.h' line='131' column='1'/>
-      </data-member>
-      <data-member access='private'>
-        <var-decl name='ata_info' type-id='type-id-53' visibility='default' filepath='src/linux.h' line='132' column='1'/>
-      </data-member>
-      <data-member access='private'>
-        <var-decl name='nvme_info' type-id='type-id-54' visibility='default' filepath='src/linux.h' line='133' column='1'/>
-      </data-member>
-      <data-member access='private'>
-        <var-decl name='nvdimm_info' type-id='type-id-55' visibility='default' filepath='src/linux.h' line='134' column='1'/>
-      </data-member>
-    </union-decl>
-    <class-decl name='scsi_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/linux.h' line='40' column='1' id='type-id-50'>
-      <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='scsi_bus' type-id='type-id-4' visibility='default' filepath='src/linux.h' line='41' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='scsi_device' type-id='type-id-4' visibility='default' filepath='src/linux.h' line='42' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='scsi_target' type-id='type-id-4' visibility='default' filepath='src/linux.h' line='43' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='scsi_lun' type-id='type-id-23' visibility='default' filepath='src/linux.h' line='44' column='1'/>
-      </data-member>
-    </class-decl>
-    <class-decl name='sas_info' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/linux.h' line='47' column='1' id='type-id-51'>
-      <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='scsi_bus' type-id='type-id-4' visibility='default' filepath='src/linux.h' line='48' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='scsi_device' type-id='type-id-4' visibility='default' filepath='src/linux.h' line='49' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='scsi_target' type-id='type-id-4' visibility='default' filepath='src/linux.h' line='50' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='scsi_lun' type-id='type-id-23' visibility='default' filepath='src/linux.h' line='51' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='sas_address' type-id='type-id-23' visibility='default' filepath='src/linux.h' line='53' column='1'/>
-      </data-member>
-    </class-decl>
-    <class-decl name='sata_info' size-in-bits='320' is-struct='yes' visibility='default' filepath='src/linux.h' line='56' column='1' id='type-id-52'>
-      <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='scsi_bus' type-id='type-id-4' visibility='default' filepath='src/linux.h' line='57' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='scsi_device' type-id='type-id-4' visibility='default' filepath='src/linux.h' line='58' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='scsi_target' type-id='type-id-4' visibility='default' filepath='src/linux.h' line='59' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='scsi_lun' type-id='type-id-23' visibility='default' filepath='src/linux.h' line='60' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='ata_devno' type-id='type-id-4' visibility='default' filepath='src/linux.h' line='62' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='224'>
-        <var-decl name='ata_port' type-id='type-id-4' visibility='default' filepath='src/linux.h' line='63' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='ata_pmp' type-id='type-id-4' visibility='default' filepath='src/linux.h' line='64' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='288'>
-        <var-decl name='ata_print_id' type-id='type-id-4' visibility='default' filepath='src/linux.h' line='66' column='1'/>
-      </data-member>
-    </class-decl>
-    <class-decl name='ata_info' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/linux.h' line='69' column='1' id='type-id-53'>
-      <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='scsi_bus' type-id='type-id-4' visibility='default' filepath='src/linux.h' line='70' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='scsi_device' type-id='type-id-4' visibility='default' filepath='src/linux.h' line='71' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='scsi_target' type-id='type-id-4' visibility='default' filepath='src/linux.h' line='72' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='scsi_lun' type-id='type-id-23' visibility='default' filepath='src/linux.h' line='73' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='scsi_host' type-id='type-id-4' visibility='default' filepath='src/linux.h' line='75' column='1'/>
-      </data-member>
-    </class-decl>
-    <class-decl name='nvme_info' size-in-bits='160' is-struct='yes' visibility='default' filepath='src/linux.h' line='78' column='1' id='type-id-54'>
-      <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='ctrl_id' type-id='type-id-56' visibility='default' filepath='src/linux.h' line='79' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='ns_id' type-id='type-id-56' visibility='default' filepath='src/linux.h' line='80' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='has_eui' type-id='type-id-22' visibility='default' filepath='src/linux.h' line='81' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='eui' type-id='type-id-57' visibility='default' filepath='src/linux.h' line='82' column='1'/>
-      </data-member>
-    </class-decl>
-    <typedef-decl name='__int32_t' type-id='type-id-22' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-58'/>
-    <typedef-decl name='int32_t' type-id='type-id-58' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-56'/>
-
-    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='64' id='type-id-57'>
-      <subrange length='8' type-id='type-id-38' id='type-id-59'/>
-
-    </array-type-def>
-    <class-decl name='nvdimm_info' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/linux.h' line='85' column='1' id='type-id-55'>
-      <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='namespace_label' type-id='type-id-60' visibility='default' filepath='src/linux.h' line='86' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='nvdimm_label' type-id='type-id-60' visibility='default' filepath='src/linux.h' line='87' column='1'/>
-      </data-member>
-    </class-decl>
-    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-60' visibility='default' filepath='src/include/efivar/efivar.h' line='33' column='1' id='type-id-61'>
-      <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='a' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar.h' line='34' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='b' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar.h' line='35' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='c' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar.h' line='36' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='d' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar.h' line='37' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='80'>
-        <var-decl name='e' type-id='type-id-62' visibility='default' filepath='src/include/efivar/efivar.h' line='38' column='1'/>
-      </data-member>
-    </class-decl>
-
-    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='48' id='type-id-62'>
-      <subrange length='6' type-id='type-id-38' id='type-id-63'/>
-
-    </array-type-def>
-    <typedef-decl name='efi_guid_t' type-id='type-id-61' filepath='src/include/efivar/efivar.h' line='39' column='1' id='type-id-60'/>
-    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-64'/>
-    <qualified-type-def type-id='type-id-8' const='yes' id='type-id-65'/>
-    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-66'/>
-    <qualified-type-def type-id='type-id-66' const='yes' id='type-id-67'/>
-    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-5'/>
-    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-69'/>
-    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-6'/>
-    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-7'/>
-    <var-decl name='sas_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='255' column='1'/>
-    <function-type size-in-bits='64' id='type-id-71'>
-      <parameter type-id='type-id-64'/>
-      <return type-id='type-id-2'/>
-    </function-type>
-    <function-type size-in-bits='64' id='type-id-68'>
-      <parameter type-id='type-id-64'/>
-      <parameter type-id='type-id-67'/>
-      <return type-id='type-id-15'/>
-    </function-type>
-    <function-type size-in-bits='64' id='type-id-70'>
-      <parameter type-id='type-id-64'/>
-      <parameter type-id='type-id-69'/>
-      <parameter type-id='type-id-15'/>
-      <parameter type-id='type-id-15'/>
-      <return type-id='type-id-15'/>
-    </function-type>
-  </abi-instr>
-  <abi-instr version='1.0' address-size='64' path='linux-virtblk.c' comp-dir-path='src' language='LANG_C99'>
-    <var-decl name='virtblk_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='258' column='1'/>
-  </abi-instr>
-  <abi-instr version='1.0' address-size='64' path='linux-pmem.c' comp-dir-path='src' language='LANG_C99'>
-    <var-decl name='pmem_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='253' column='1'/>
-  </abi-instr>
-  <abi-instr version='1.0' address-size='64' path='linux-sata.c' comp-dir-path='src' language='LANG_C99'>
-    <var-decl name='sata_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='256' column='1'/>
-  </abi-instr>
-  <abi-instr version='1.0' address-size='64' path='linux-pci.c' comp-dir-path='src' language='LANG_C99'>
-    <var-decl name='pci_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='254' column='1'/>
-  </abi-instr>
-  <abi-instr version='1.0' address-size='64' path='linux-nvme.c' comp-dir-path='src' language='LANG_C99'>
-    <var-decl name='nvme_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='257' column='1'/>
-  </abi-instr>
-  <abi-instr version='1.0' address-size='64' path='linux-scsi.c' comp-dir-path='src' language='LANG_C99'>
-    <var-decl name='scsi_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='260' column='1'/>
-  </abi-instr>
-  <abi-instr version='1.0' address-size='64' path='linux-ata.c' comp-dir-path='src' language='LANG_C99'>
-    <var-decl name='ata_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='261' column='1'/>
-  </abi-instr>
-  <abi-instr version='1.0' address-size='64' path='linux-i2o.c' comp-dir-path='src' language='LANG_C99'>
-    <var-decl name='i2o_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='259' column='1'/>
-  </abi-instr>
   <abi-instr version='1.0' address-size='64' path='&lt;artificial&gt;' comp-dir-path='src' language='LANG_C99'>
-    <qualified-type-def type-id='type-id-47' const='yes' id='type-id-72'/>
-    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-73'/>
-    <class-decl name='efi_load_option_s' size-in-bits='48' is-struct='yes' visibility='default' filepath='src/loadopt.c' line='31' column='1' id='type-id-74'>
+    <type-decl name='unsigned char' size-in-bits='8' id='type-id-1'/>
+    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-2'/>
+    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-3'/>
+    <class-decl name='efi_load_option_s' size-in-bits='48' is-struct='yes' visibility='default' filepath='src/loadopt.c' line='31' column='1' id='type-id-4'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='attributes' type-id='type-id-4' visibility='default' filepath='src/loadopt.c' line='32' column='1'/>
+        <var-decl name='attributes' type-id='type-id-5' visibility='default' filepath='src/loadopt.c' line='32' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='file_path_list_length' type-id='type-id-43' visibility='default' filepath='src/loadopt.c' line='33' column='1'/>
+        <var-decl name='file_path_list_length' type-id='type-id-6' visibility='default' filepath='src/loadopt.c' line='33' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='description' type-id='type-id-75' visibility='default' filepath='src/loadopt.c' line='34' column='1'/>
+        <var-decl name='description' type-id='type-id-7' visibility='default' filepath='src/loadopt.c' line='34' column='1'/>
       </data-member>
     </class-decl>
+    <type-decl name='unsigned int' size-in-bits='32' id='type-id-8'/>
+    <typedef-decl name='__uint32_t' type-id='type-id-8' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-9'/>
+    <typedef-decl name='uint32_t' type-id='type-id-9' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-5'/>
+    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-10'/>
+    <typedef-decl name='__uint16_t' type-id='type-id-10' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-11'/>
+    <typedef-decl name='uint16_t' type-id='type-id-11' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-6'/>
+    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-12'/>
 
-    <array-type-def dimensions='1' type-id='type-id-43' size-in-bits='16' id='type-id-75'>
-      <subrange length='1' type-id='type-id-38' id='type-id-76'/>
+    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='infinite' id='type-id-7'>
+      <subrange length='infinite' type-id='type-id-12' id='type-id-13'/>
 
     </array-type-def>
-    <typedef-decl name='efi_load_option' type-id='type-id-74' filepath='src/include/efivar/efiboot-loadopt.h' line='24' column='1' id='type-id-77'/>
-    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-78'/>
-    <function-decl name='efi_loadopt_desc' mangled-name='efi_loadopt_desc' filepath='src/&lt;built-in&gt;' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_desc@@libefiboot.so.0'>
-      <parameter type-id='type-id-78' name='opt' filepath='src/&lt;built-in&gt;' line='368' column='1'/>
-      <parameter type-id='type-id-15' name='limit' filepath='src/&lt;built-in&gt;' line='368' column='1'/>
-      <return type-id='type-id-73'/>
+    <typedef-decl name='efi_load_option' type-id='type-id-4' filepath='src/include/efivar/efiboot-loadopt.h' line='24' column='1' id='type-id-14'/>
+    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-15'/>
+    <type-decl name='long int' size-in-bits='64' id='type-id-16'/>
+    <typedef-decl name='__ssize_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='193' column='1' id='type-id-17'/>
+    <typedef-decl name='ssize_t' type-id='type-id-17' filepath='/usr/include/stdio.h' line='77' column='1' id='type-id-18'/>
+    <function-decl name='efi_loadopt_desc' mangled-name='efi_loadopt_desc' filepath='src/hexdump.h' line='367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_desc@@libefiboot.so.0'>
+      <parameter type-id='type-id-15' name='opt' filepath='src/hexdump.h' line='367' column='1'/>
+      <parameter type-id='type-id-18' name='limit' filepath='src/hexdump.h' line='367' column='1'/>
+      <return type-id='type-id-3'/>
     </function-decl>
-    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-79'/>
-    <function-decl name='efi_loadopt_args_as_ucs2' mangled-name='efi_loadopt_args_as_ucs2' filepath='src/&lt;built-in&gt;' line='337' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_args_as_ucs2@@libefiboot.so.0'>
-      <parameter type-id='type-id-79' name='buf' filepath='src/&lt;built-in&gt;' line='337' column='1'/>
-      <parameter type-id='type-id-15' name='size' filepath='src/&lt;built-in&gt;' line='337' column='1'/>
-      <parameter type-id='type-id-69' name='utf8' filepath='src/&lt;built-in&gt;' line='337' column='1'/>
-      <return type-id='type-id-15'/>
+    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-19'/>
+    <typedef-decl name='__uint8_t' type-id='type-id-1' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-20'/>
+    <typedef-decl name='uint8_t' type-id='type-id-20' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-21'/>
+    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-22'/>
+    <function-decl name='efi_loadopt_args_as_ucs2' mangled-name='efi_loadopt_args_as_ucs2' filepath='src/hexdump.h' line='336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_args_as_ucs2@@libefiboot.so.0'>
+      <parameter type-id='type-id-19' name='buf' filepath='src/hexdump.h' line='336' column='1'/>
+      <parameter type-id='type-id-18' name='size' filepath='src/hexdump.h' line='336' column='1'/>
+      <parameter type-id='type-id-22' name='utf8' filepath='src/hexdump.h' line='336' column='1'/>
+      <return type-id='type-id-18'/>
     </function-decl>
-    <function-decl name='efi_loadopt_args_as_utf8' mangled-name='efi_loadopt_args_as_utf8' filepath='src/&lt;built-in&gt;' line='312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_args_as_utf8@@libefiboot.so.0'>
-      <parameter type-id='type-id-69' name='buf' filepath='src/&lt;built-in&gt;' line='312' column='1'/>
-      <parameter type-id='type-id-15' name='size' filepath='src/&lt;built-in&gt;' line='312' column='1'/>
-      <parameter type-id='type-id-69' name='utf8' filepath='src/&lt;built-in&gt;' line='312' column='1'/>
-      <parameter type-id='type-id-69' name='buf' filepath='src/&lt;built-in&gt;' line='312' column='1'/>
-      <parameter type-id='type-id-15' name='size' filepath='src/&lt;built-in&gt;' line='312' column='1'/>
-      <parameter type-id='type-id-69' name='utf8' filepath='src/&lt;built-in&gt;' line='312' column='1'/>
-      <return type-id='type-id-15'/>
+    <function-decl name='efi_loadopt_args_as_utf8' mangled-name='efi_loadopt_args_as_utf8' filepath='src/hexdump.h' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_args_as_utf8@@libefiboot.so.0'>
+      <parameter type-id='type-id-22' name='buf' filepath='src/hexdump.h' line='311' column='1'/>
+      <parameter type-id='type-id-18' name='size' filepath='src/hexdump.h' line='311' column='1'/>
+      <parameter type-id='type-id-22' name='utf8' filepath='src/hexdump.h' line='311' column='1'/>
+      <return type-id='type-id-18'/>
     </function-decl>
-    <function-decl name='efi_loadopt_args_from_file' mangled-name='efi_loadopt_args_from_file' filepath='src/&lt;built-in&gt;' line='269' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_args_from_file@@libefiboot.so.0'>
-      <parameter type-id='type-id-69' name='buf' filepath='src/&lt;built-in&gt;' line='269' column='1'/>
-      <parameter type-id='type-id-15' name='size' filepath='src/&lt;built-in&gt;' line='269' column='1'/>
-      <parameter type-id='type-id-2' name='filename' filepath='src/&lt;built-in&gt;' line='269' column='1'/>
-      <return type-id='type-id-15'/>
+    <type-decl name='char' size-in-bits='8' id='type-id-23'/>
+    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-24'/>
+    <function-decl name='efi_loadopt_args_from_file' mangled-name='efi_loadopt_args_from_file' filepath='src/hexdump.h' line='268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_args_from_file@@libefiboot.so.0'>
+      <parameter type-id='type-id-22' name='buf' filepath='src/hexdump.h' line='268' column='1'/>
+      <parameter type-id='type-id-18' name='size' filepath='src/hexdump.h' line='268' column='1'/>
+      <parameter type-id='type-id-24' name='filename' filepath='src/hexdump.h' line='268' column='1'/>
+      <return type-id='type-id-18'/>
     </function-decl>
-    <typedef-decl name='size_t' type-id='type-id-38' filepath='/usr/lib/gcc/x86_64-redhat-linux/8/include/stddef.h' line='216' column='1' id='type-id-80'/>
-    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-81'/>
-    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-82'/>
-    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-83'/>
-    <function-decl name='efi_loadopt_optional_data' mangled-name='efi_loadopt_optional_data' filepath='src/&lt;built-in&gt;' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_optional_data@@libefiboot.so.0'>
-      <parameter type-id='type-id-78' name='opt' filepath='src/&lt;built-in&gt;' line='236' column='1'/>
-      <parameter type-id='type-id-80' name='opt_size' filepath='src/&lt;built-in&gt;' line='236' column='1'/>
-      <parameter type-id='type-id-82' name='datap' filepath='src/&lt;built-in&gt;' line='237' column='1'/>
-      <parameter type-id='type-id-83' name='len' filepath='src/&lt;built-in&gt;' line='237' column='1'/>
-      <return type-id='type-id-22'/>
+    <type-decl name='int' size-in-bits='32' id='type-id-25'/>
+    <typedef-decl name='size_t' type-id='type-id-12' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-26'/>
+    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-27'/>
+    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-28'/>
+    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-29'/>
+    <function-decl name='efi_loadopt_optional_data' mangled-name='efi_loadopt_optional_data' filepath='src/hexdump.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_optional_data@@libefiboot.so.0'>
+      <parameter type-id='type-id-15' name='opt' filepath='src/hexdump.h' line='235' column='1'/>
+      <parameter type-id='type-id-26' name='opt_size' filepath='src/hexdump.h' line='235' column='1'/>
+      <parameter type-id='type-id-28' name='datap' filepath='src/hexdump.h' line='236' column='1'/>
+      <parameter type-id='type-id-29' name='len' filepath='src/hexdump.h' line='236' column='1'/>
+      <return type-id='type-id-25'/>
     </function-decl>
-    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='833' column='1' id='type-id-84'>
+    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='838' column='1' id='type-id-30'>
       <data-member access='private'>
-        <var-decl name='' type-id='type-id-85' visibility='default'/>
+        <var-decl name='' type-id='type-id-31' visibility='default'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='839' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='844' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='pci' type-id='type-id-87' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='840' column='1'/>
+        <var-decl name='pci' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='845' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='pccard' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='841' column='1'/>
+        <var-decl name='pccard' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='846' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='mmio' type-id='type-id-89' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='842' column='1'/>
+        <var-decl name='mmio' type-id='type-id-35' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='847' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='hw_vendor' type-id='type-id-90' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='843' column='1'/>
+        <var-decl name='hw_vendor' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='848' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='controller' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='844' column='1'/>
+        <var-decl name='controller' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='849' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='bmc' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='845' column='1'/>
+        <var-decl name='bmc' type-id='type-id-38' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='850' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='acpi_hid' type-id='type-id-93' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='846' column='1'/>
+        <var-decl name='acpi_hid' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='851' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='acpi_hid_ex' type-id='type-id-94' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='847' column='1'/>
+        <var-decl name='acpi_hid_ex' type-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='852' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='acpi_adr' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='848' column='1'/>
+        <var-decl name='acpi_adr' type-id='type-id-41' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='853' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='atapi' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='849' column='1'/>
+        <var-decl name='atapi' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='854' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='scsi' type-id='type-id-97' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='850' column='1'/>
+        <var-decl name='scsi' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='855' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='fc' type-id='type-id-98' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='851' column='1'/>
+        <var-decl name='fc' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='856' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='fcex' type-id='type-id-99' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='852' column='1'/>
+        <var-decl name='fcex' type-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='857' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='firewire' type-id='type-id-100' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='853' column='1'/>
+        <var-decl name='firewire' type-id='type-id-46' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='858' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='usb' type-id='type-id-101' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='854' column='1'/>
+        <var-decl name='usb' type-id='type-id-47' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='859' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='usb_class' type-id='type-id-102' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='855' column='1'/>
+        <var-decl name='usb_class' type-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='860' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='usb_wwid' type-id='type-id-103' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='856' column='1'/>
+        <var-decl name='usb_wwid' type-id='type-id-49' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='861' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='lun' type-id='type-id-104' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='857' column='1'/>
+        <var-decl name='lun' type-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='862' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='sata' type-id='type-id-105' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='858' column='1'/>
+        <var-decl name='sata' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='863' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='i2o' type-id='type-id-106' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='859' column='1'/>
+        <var-decl name='i2o' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='864' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='mac_addr' type-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='860' column='1'/>
+        <var-decl name='mac_addr' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='865' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='ipv4_addr' type-id='type-id-108' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='861' column='1'/>
+        <var-decl name='ipv4_addr' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='866' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='ipv6_addr' type-id='type-id-109' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='862' column='1'/>
+        <var-decl name='ipv6_addr' type-id='type-id-55' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='867' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='vlan' type-id='type-id-110' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='863' column='1'/>
+        <var-decl name='vlan' type-id='type-id-56' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='868' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='infiniband' type-id='type-id-111' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='864' column='1'/>
+        <var-decl name='infiniband' type-id='type-id-57' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='869' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='uart' type-id='type-id-112' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='865' column='1'/>
+        <var-decl name='uart' type-id='type-id-58' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='870' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='msg_vendor' type-id='type-id-113' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='866' column='1'/>
+        <var-decl name='msg_vendor' type-id='type-id-59' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='871' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='uart_flow_control' type-id='type-id-114' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='867' column='1'/>
+        <var-decl name='uart_flow_control' type-id='type-id-60' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='872' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='sas' type-id='type-id-115' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='868' column='1'/>
+        <var-decl name='sas' type-id='type-id-61' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='873' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='sas_ex' type-id='type-id-116' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='869' column='1'/>
+        <var-decl name='sas_ex' type-id='type-id-62' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='874' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='iscsi' type-id='type-id-117' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='870' column='1'/>
+        <var-decl name='iscsi' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='875' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='nvme' type-id='type-id-118' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='871' column='1'/>
+        <var-decl name='nvme' type-id='type-id-64' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='876' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='uri' type-id='type-id-119' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='872' column='1'/>
+        <var-decl name='uri' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='877' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='ufs' type-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='873' column='1'/>
+        <var-decl name='ufs' type-id='type-id-66' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='878' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='sd' type-id='type-id-121' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='874' column='1'/>
+        <var-decl name='sd' type-id='type-id-67' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='879' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='bt' type-id='type-id-122' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='875' column='1'/>
+        <var-decl name='bt' type-id='type-id-68' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='880' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='wifi' type-id='type-id-123' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='876' column='1'/>
+        <var-decl name='wifi' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='881' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='emmc' type-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='877' column='1'/>
+        <var-decl name='emmc' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='882' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='btle' type-id='type-id-125' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='878' column='1'/>
+        <var-decl name='btle' type-id='type-id-71' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='883' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='dns' type-id='type-id-126' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='879' column='1'/>
+        <var-decl name='dns' type-id='type-id-72' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='884' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='nvdimm' type-id='type-id-127' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='880' column='1'/>
+        <var-decl name='nvdimm' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='885' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='hd' type-id='type-id-128' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='881' column='1'/>
+        <var-decl name='hd' type-id='type-id-74' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='886' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='cdrom' type-id='type-id-129' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='882' column='1'/>
+        <var-decl name='cdrom' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='887' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='media_vendor' type-id='type-id-130' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='883' column='1'/>
+        <var-decl name='media_vendor' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='888' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='file' type-id='type-id-131' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='884' column='1'/>
+        <var-decl name='file' type-id='type-id-77' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='889' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='protocol' type-id='type-id-132' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='885' column='1'/>
+        <var-decl name='protocol' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='890' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='firmware_file' type-id='type-id-133' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='886' column='1'/>
+        <var-decl name='firmware_file' type-id='type-id-79' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='891' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='firmware_volume' type-id='type-id-134' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='887' column='1'/>
+        <var-decl name='firmware_volume' type-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='892' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='relative_offset' type-id='type-id-135' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='888' column='1'/>
+        <var-decl name='relative_offset' type-id='type-id-81' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='893' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='ramdisk' type-id='type-id-136' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='889' column='1'/>
+        <var-decl name='ramdisk' type-id='type-id-82' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='894' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='bios_boot' type-id='type-id-137' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='890' column='1'/>
+        <var-decl name='bios_boot' type-id='type-id-83' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='895' column='1'/>
       </data-member>
     </union-decl>
-    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='834' column='1' id='type-id-85'>
+    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='839' column='1' id='type-id-31'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='type' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='835' column='1'/>
+        <var-decl name='type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='840' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='8'>
-        <var-decl name='subtype' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='836' column='1'/>
+        <var-decl name='subtype' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='841' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='16'>
-        <var-decl name='length' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='837' column='1'/>
+        <var-decl name='length' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='842' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='36' column='1' id='type-id-138'>
+    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='36' column='1' id='type-id-84'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='type' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='37' column='1'/>
+        <var-decl name='type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='37' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='8'>
-        <var-decl name='subtype' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='38' column='1'/>
+        <var-decl name='subtype' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='38' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='16'>
-        <var-decl name='length' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='39' column='1'/>
+        <var-decl name='length' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='39' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_header' type-id='type-id-138' filepath='src/include/efivar/efivar-dp.h' line='40' column='1' id='type-id-86'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-87' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='55' column='1' id='type-id-139'>
+    <typedef-decl name='efidp_header' type-id='type-id-84' filepath='src/include/efivar/efivar-dp.h' line='40' column='1' id='type-id-32'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='55' column='1' id='type-id-85'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='56' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='56' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='function' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='57' column='1'/>
+        <var-decl name='function' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='57' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='device' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='58' column='1'/>
+        <var-decl name='device' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='58' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_pci' type-id='type-id-139' filepath='src/include/efivar/efivar-dp.h' line='59' column='1' id='type-id-87'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='64' column='1' id='type-id-140'>
+    <typedef-decl name='efidp_pci' type-id='type-id-85' filepath='src/include/efivar/efivar-dp.h' line='59' column='1' id='type-id-33'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='64' column='1' id='type-id-86'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='65' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='65' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='function' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='66' column='1'/>
+        <var-decl name='function' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='66' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_pccard' type-id='type-id-140' filepath='src/include/efivar/efivar-dp.h' line='67' column='1' id='type-id-88'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-89' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='70' column='1' id='type-id-141'>
+    <typedef-decl name='efidp_pccard' type-id='type-id-86' filepath='src/include/efivar/efivar-dp.h' line='67' column='1' id='type-id-34'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-35' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='70' column='1' id='type-id-87'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='71' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='71' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='memory_type' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='72' column='1'/>
+        <var-decl name='memory_type' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='72' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='starting_address' type-id='type-id-23' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='73' column='1'/>
+        <var-decl name='starting_address' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='73' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='ending_address' type-id='type-id-23' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='74' column='1'/>
+        <var-decl name='ending_address' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='74' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_mmio' type-id='type-id-141' filepath='src/include/efivar/efivar-dp.h' line='75' column='1' id='type-id-89'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-90' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='78' column='1' id='type-id-142'>
+    <typedef-decl name='__uint64_t' type-id='type-id-12' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-89'/>
+    <typedef-decl name='uint64_t' type-id='type-id-89' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-88'/>
+    <typedef-decl name='efidp_mmio' type-id='type-id-87' filepath='src/include/efivar/efivar-dp.h' line='75' column='1' id='type-id-35'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='78' column='1' id='type-id-90'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='79' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='79' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_guid' type-id='type-id-60' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='80' column='1'/>
+        <var-decl name='vendor_guid' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='80' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='vendor_data' type-id='type-id-143' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='81' column='1'/>
+        <var-decl name='vendor_data' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='81' column='1'/>
+      </data-member>
+    </class-decl>
+    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar.h' line='34' column='1' id='type-id-93'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <var-decl name='a' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar.h' line='35' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='32'>
+        <var-decl name='b' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar.h' line='36' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='48'>
+        <var-decl name='c' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar.h' line='37' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='64'>
+        <var-decl name='d' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar.h' line='38' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='80'>
+        <var-decl name='e' type-id='type-id-94' visibility='default' filepath='src/include/efivar/efivar.h' line='39' column='1'/>
       </data-member>
     </class-decl>
 
-    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='8' id='type-id-143'>
-      <subrange length='1' type-id='type-id-38' id='type-id-76'/>
+    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='48' id='type-id-94'>
+      <subrange length='6' type-id='type-id-12' id='type-id-95'/>
 
     </array-type-def>
-    <typedef-decl name='efidp_hw_vendor' type-id='type-id-142' filepath='src/include/efivar/efivar-dp.h' line='82' column='1' id='type-id-90'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='99' column='1' id='type-id-144'>
+    <typedef-decl name='efi_guid_t' type-id='type-id-93' filepath='src/include/efivar/efivar.h' line='40' column='1' id='type-id-91'/>
+
+    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='infinite' id='type-id-92'>
+      <subrange length='infinite' type-id='type-id-12' id='type-id-13'/>
+
+    </array-type-def>
+    <typedef-decl name='efidp_hw_vendor' type-id='type-id-90' filepath='src/include/efivar/efivar-dp.h' line='82' column='1' id='type-id-36'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='99' column='1' id='type-id-96'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='100' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='100' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='controller' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='101' column='1'/>
+        <var-decl name='controller' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='101' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_controller' type-id='type-id-144' filepath='src/include/efivar/efivar-dp.h' line='102' column='1' id='type-id-91'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='104' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='105' column='1' id='type-id-145'>
+    <typedef-decl name='efidp_controller' type-id='type-id-96' filepath='src/include/efivar/efivar-dp.h' line='102' column='1' id='type-id-37'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='104' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-38' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='105' column='1' id='type-id-97'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='106' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='106' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='interface_type' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='107' column='1'/>
+        <var-decl name='interface_type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='107' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='base_addr' type-id='type-id-23' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='108' column='1'/>
+        <var-decl name='base_addr' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='108' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_bmc' type-id='type-id-145' filepath='src/include/efivar/efivar-dp.h' line='109' column='1' id='type-id-92'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-93' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='119' column='1' id='type-id-146'>
+    <typedef-decl name='efidp_bmc' type-id='type-id-97' filepath='src/include/efivar/efivar-dp.h' line='109' column='1' id='type-id-38'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='119' column='1' id='type-id-98'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='120' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='120' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='hid' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='121' column='1'/>
+        <var-decl name='hid' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='121' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='uid' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='122' column='1'/>
+        <var-decl name='uid' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='122' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_acpi_hid' type-id='type-id-146' filepath='src/include/efivar/efivar-dp.h' line='123' column='1' id='type-id-93'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-94' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='128' column='1' id='type-id-147'>
+    <typedef-decl name='efidp_acpi_hid' type-id='type-id-98' filepath='src/include/efivar/efivar-dp.h' line='123' column='1' id='type-id-39'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-40' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='128' column='1' id='type-id-99'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='129' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='129' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='hid' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='130' column='1'/>
+        <var-decl name='hid' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='130' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='uid' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='131' column='1'/>
+        <var-decl name='uid' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='131' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='cid' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='132' column='1'/>
+        <var-decl name='cid' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='132' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='hidstr' type-id='type-id-148' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='134' column='1'/>
+        <var-decl name='hidstr' type-id='type-id-100' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='134' column='1'/>
       </data-member>
     </class-decl>
 
-    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='8' id='type-id-148'>
-      <subrange length='1' type-id='type-id-38' id='type-id-76'/>
+    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='infinite' id='type-id-100'>
+      <subrange length='infinite' type-id='type-id-12' id='type-id-13'/>
 
     </array-type-def>
-    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-147' filepath='src/include/efivar/efivar-dp.h' line='135' column='1' id='type-id-94'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='166' column='1' id='type-id-149'>
+    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-99' filepath='src/include/efivar/efivar-dp.h' line='135' column='1' id='type-id-40'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-41' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='169' column='1' id='type-id-101'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='167' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='170' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='adr' type-id='type-id-150' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='168' column='1'/>
+        <var-decl name='adr' type-id='type-id-102' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='171' column='1'/>
       </data-member>
     </class-decl>
 
-    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='32' id='type-id-150'>
-      <subrange length='1' type-id='type-id-38' id='type-id-76'/>
+    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='infinite' id='type-id-102'>
+      <subrange length='infinite' type-id='type-id-12' id='type-id-13'/>
 
     </array-type-def>
-    <typedef-decl name='efidp_acpi_adr' type-id='type-id-149' filepath='src/include/efivar/efivar-dp.h' line='169' column='1' id='type-id-95'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='327' column='1' id='type-id-151'>
+    <typedef-decl name='efidp_acpi_adr' type-id='type-id-101' filepath='src/include/efivar/efivar-dp.h' line='172' column='1' id='type-id-41'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='330' column='1' id='type-id-103'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='328' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='331' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='primary' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='329' column='1'/>
+        <var-decl name='primary' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='332' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='slave' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='330' column='1'/>
+        <var-decl name='slave' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='333' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='lun' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='331' column='1'/>
+        <var-decl name='lun' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='334' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_atapi' type-id='type-id-151' filepath='src/include/efivar/efivar-dp.h' line='332' column='1' id='type-id-96'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-97' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='337' column='1' id='type-id-152'>
+    <typedef-decl name='efidp_atapi' type-id='type-id-103' filepath='src/include/efivar/efivar-dp.h' line='335' column='1' id='type-id-42'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='340' column='1' id='type-id-104'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='338' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='341' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='target' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='339' column='1'/>
+        <var-decl name='target' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='342' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='lun' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='340' column='1'/>
+        <var-decl name='lun' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='343' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_scsi' type-id='type-id-152' filepath='src/include/efivar/efivar-dp.h' line='341' column='1' id='type-id-97'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-98' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='346' column='1' id='type-id-153'>
+    <typedef-decl name='efidp_scsi' type-id='type-id-104' filepath='src/include/efivar/efivar-dp.h' line='344' column='1' id='type-id-43'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='349' column='1' id='type-id-105'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='347' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='350' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='reserved' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='348' column='1'/>
+        <var-decl name='reserved' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='351' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='wwn' type-id='type-id-23' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='349' column='1'/>
+        <var-decl name='wwn' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='352' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='lun' type-id='type-id-23' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='350' column='1'/>
+        <var-decl name='lun' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='353' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_fc' type-id='type-id-153' filepath='src/include/efivar/efivar-dp.h' line='351' column='1' id='type-id-98'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-99' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='354' column='1' id='type-id-154'>
+    <typedef-decl name='efidp_fc' type-id='type-id-105' filepath='src/include/efivar/efivar-dp.h' line='354' column='1' id='type-id-44'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-45' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='357' column='1' id='type-id-106'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='355' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='358' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='reserved' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='356' column='1'/>
+        <var-decl name='reserved' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='359' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='wwn' type-id='type-id-57' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='357' column='1'/>
+        <var-decl name='wwn' type-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='360' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='lun' type-id='type-id-57' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='358' column='1'/>
+        <var-decl name='lun' type-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='361' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_fcex' type-id='type-id-154' filepath='src/include/efivar/efivar-dp.h' line='359' column='1' id='type-id-99'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-100' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='362' column='1' id='type-id-155'>
+
+    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='64' id='type-id-107'>
+      <subrange length='8' type-id='type-id-12' id='type-id-108'/>
+
+    </array-type-def>
+    <typedef-decl name='efidp_fcex' type-id='type-id-106' filepath='src/include/efivar/efivar-dp.h' line='362' column='1' id='type-id-45'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-46' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='365' column='1' id='type-id-109'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='363' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='366' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='reserved' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='364' column='1'/>
+        <var-decl name='reserved' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='367' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='guid' type-id='type-id-23' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='365' column='1'/>
+        <var-decl name='guid' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='368' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_1394' type-id='type-id-155' filepath='src/include/efivar/efivar-dp.h' line='366' column='1' id='type-id-100'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-101' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='369' column='1' id='type-id-156'>
+    <typedef-decl name='efidp_1394' type-id='type-id-109' filepath='src/include/efivar/efivar-dp.h' line='369' column='1' id='type-id-46'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-47' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='372' column='1' id='type-id-110'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='370' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='373' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='parent_port' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='371' column='1'/>
+        <var-decl name='parent_port' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='374' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='interface' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='372' column='1'/>
+        <var-decl name='interface' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='375' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_usb' type-id='type-id-156' filepath='src/include/efivar/efivar-dp.h' line='373' column='1' id='type-id-101'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='88' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-102' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='376' column='1' id='type-id-157'>
+    <typedef-decl name='efidp_usb' type-id='type-id-110' filepath='src/include/efivar/efivar-dp.h' line='376' column='1' id='type-id-47'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='88' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-48' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='379' column='1' id='type-id-111'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='377' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='380' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_id' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='378' column='1'/>
+        <var-decl name='vendor_id' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='381' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='product_id' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='379' column='1'/>
+        <var-decl name='product_id' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='382' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='device_class' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='380' column='1'/>
+        <var-decl name='device_class' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='383' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='72'>
-        <var-decl name='device_subclass' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='381' column='1'/>
+        <var-decl name='device_subclass' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='384' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='80'>
-        <var-decl name='device_protocol' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='382' column='1'/>
+        <var-decl name='device_protocol' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='385' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_usb_class' type-id='type-id-157' filepath='src/include/efivar/efivar-dp.h' line='383' column='1' id='type-id-102'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-103' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='403' column='1' id='type-id-158'>
+    <typedef-decl name='efidp_usb_class' type-id='type-id-111' filepath='src/include/efivar/efivar-dp.h' line='386' column='1' id='type-id-48'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-49' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='406' column='1' id='type-id-112'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='404' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='407' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='interface' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='405' column='1'/>
+        <var-decl name='interface' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='408' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='vendor_id' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='406' column='1'/>
+        <var-decl name='vendor_id' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='409' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='product_id' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='407' column='1'/>
+        <var-decl name='product_id' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='410' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='80'>
-        <var-decl name='serial_number' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='408' column='1'/>
+        <var-decl name='serial_number' type-id='type-id-7' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='411' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_usb_wwid' type-id='type-id-158' filepath='src/include/efivar/efivar-dp.h' line='409' column='1' id='type-id-103'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-104' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='412' column='1' id='type-id-159'>
+    <typedef-decl name='efidp_usb_wwid' type-id='type-id-112' filepath='src/include/efivar/efivar-dp.h' line='412' column='1' id='type-id-49'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-50' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='415' column='1' id='type-id-113'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='413' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='416' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='lun' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='414' column='1'/>
+        <var-decl name='lun' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='417' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_lun' type-id='type-id-159' filepath='src/include/efivar/efivar-dp.h' line='415' column='1' id='type-id-104'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-105' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='418' column='1' id='type-id-160'>
+    <typedef-decl name='efidp_lun' type-id='type-id-113' filepath='src/include/efivar/efivar-dp.h' line='418' column='1' id='type-id-50'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='421' column='1' id='type-id-114'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='419' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='422' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='hba_port' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='420' column='1'/>
+        <var-decl name='hba_port' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='423' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='port_multiplier_port' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='421' column='1'/>
+        <var-decl name='port_multiplier_port' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='424' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='lun' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='422' column='1'/>
+        <var-decl name='lun' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='425' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_sata' type-id='type-id-160' filepath='src/include/efivar/efivar-dp.h' line='423' column='1' id='type-id-105'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-106' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='429' column='1' id='type-id-161'>
+    <typedef-decl name='efidp_sata' type-id='type-id-114' filepath='src/include/efivar/efivar-dp.h' line='426' column='1' id='type-id-51'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='432' column='1' id='type-id-115'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='430' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='433' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='target' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='431' column='1'/>
+        <var-decl name='target' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='434' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_i2o' type-id='type-id-161' filepath='src/include/efivar/efivar-dp.h' line='432' column='1' id='type-id-106'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='296' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='435' column='1' id='type-id-162'>
+    <typedef-decl name='efidp_i2o' type-id='type-id-115' filepath='src/include/efivar/efivar-dp.h' line='435' column='1' id='type-id-52'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='296' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='438' column='1' id='type-id-116'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='436' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='439' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='mac_addr' type-id='type-id-163' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='437' column='1'/>
+        <var-decl name='mac_addr' type-id='type-id-117' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='440' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='288'>
-        <var-decl name='if_type' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='438' column='1'/>
+        <var-decl name='if_type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='441' column='1'/>
       </data-member>
     </class-decl>
 
-    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='256' id='type-id-163'>
-      <subrange length='32' type-id='type-id-38' id='type-id-164'/>
+    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='256' id='type-id-117'>
+      <subrange length='32' type-id='type-id-12' id='type-id-118'/>
 
     </array-type-def>
-    <typedef-decl name='efidp_mac_addr' type-id='type-id-162' filepath='src/include/efivar/efivar-dp.h' line='439' column='1' id='type-id-107'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='216' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-108' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='447' column='1' id='type-id-165'>
+    <typedef-decl name='efidp_mac_addr' type-id='type-id-116' filepath='src/include/efivar/efivar-dp.h' line='442' column='1' id='type-id-53'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='216' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='450' column='1' id='type-id-119'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='448' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='451' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='local_ipv4_addr' type-id='type-id-166' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='449' column='1'/>
+        <var-decl name='local_ipv4_addr' type-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='452' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='remote_ipv4_addr' type-id='type-id-166' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='450' column='1'/>
+        <var-decl name='remote_ipv4_addr' type-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='453' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='local_port' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='451' column='1'/>
+        <var-decl name='local_port' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='454' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='112'>
-        <var-decl name='remote_port' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='452' column='1'/>
+        <var-decl name='remote_port' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='455' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='protocol' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='453' column='1'/>
+        <var-decl name='protocol' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='456' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='144'>
-        <var-decl name='static_ip_addr' type-id='type-id-167' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='454' column='1'/>
+        <var-decl name='static_ip_addr' type-id='type-id-121' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='457' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='152'>
-        <var-decl name='gateway' type-id='type-id-166' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='455' column='1'/>
+        <var-decl name='gateway' type-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='458' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='184'>
-        <var-decl name='netmask' type-id='type-id-166' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='456' column='1'/>
+        <var-decl name='netmask' type-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='459' column='1'/>
       </data-member>
     </class-decl>
 
-    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='32' id='type-id-166'>
-      <subrange length='4' type-id='type-id-38' id='type-id-168'/>
+    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='32' id='type-id-120'>
+      <subrange length='4' type-id='type-id-12' id='type-id-122'/>
 
     </array-type-def>
-    <typedef-decl name='efidp_boolean' type-id='type-id-44' filepath='src/include/efivar/efivar-dp.h' line='43' column='1' id='type-id-167'/>
-    <typedef-decl name='efidp_ipv4_addr' type-id='type-id-165' filepath='src/include/efivar/efivar-dp.h' line='457' column='1' id='type-id-108'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='360' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-109' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='469' column='1' id='type-id-169'>
+    <typedef-decl name='efidp_boolean' type-id='type-id-21' filepath='src/include/efivar/efivar-dp.h' line='43' column='1' id='type-id-121'/>
+    <typedef-decl name='efidp_ipv4_addr' type-id='type-id-119' filepath='src/include/efivar/efivar-dp.h' line='460' column='1' id='type-id-54'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='360' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-55' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='472' column='1' id='type-id-123'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='470' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='473' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='local_ipv6_addr' type-id='type-id-170' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='471' column='1'/>
+        <var-decl name='local_ipv6_addr' type-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='474' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='remote_ipv6_addr' type-id='type-id-170' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='472' column='1'/>
+        <var-decl name='remote_ipv6_addr' type-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='475' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='288'>
-        <var-decl name='local_port' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='473' column='1'/>
+        <var-decl name='local_port' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='476' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='304'>
-        <var-decl name='remote_port' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='474' column='1'/>
+        <var-decl name='remote_port' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='477' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='protocol' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='475' column='1'/>
+        <var-decl name='protocol' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='478' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='336'>
-        <var-decl name='ip_addr_origin' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='476' column='1'/>
+        <var-decl name='ip_addr_origin' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='479' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='344'>
-        <var-decl name='prefix_length' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='477' column='1'/>
+        <var-decl name='prefix_length' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='480' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='352'>
-        <var-decl name='gateway_ipv6_addr' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='478' column='1'/>
+        <var-decl name='gateway_ipv6_addr' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='481' column='1'/>
       </data-member>
     </class-decl>
 
-    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='128' id='type-id-170'>
-      <subrange length='16' type-id='type-id-38' id='type-id-171'/>
+    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='128' id='type-id-124'>
+      <subrange length='16' type-id='type-id-12' id='type-id-125'/>
 
     </array-type-def>
-    <typedef-decl name='efidp_ipv6_addr' type-id='type-id-169' filepath='src/include/efivar/efivar-dp.h' line='479' column='1' id='type-id-109'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-110' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='486' column='1' id='type-id-172'>
+    <typedef-decl name='efidp_ipv6_addr' type-id='type-id-123' filepath='src/include/efivar/efivar-dp.h' line='482' column='1' id='type-id-55'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-56' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='489' column='1' id='type-id-126'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='487' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='490' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vlan_id' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='488' column='1'/>
+        <var-decl name='vlan_id' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='491' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_vlan' type-id='type-id-172' filepath='src/include/efivar/efivar-dp.h' line='489' column='1' id='type-id-110'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='384' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-111' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='492' column='1' id='type-id-173'>
+    <typedef-decl name='efidp_vlan' type-id='type-id-126' filepath='src/include/efivar/efivar-dp.h' line='492' column='1' id='type-id-56'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='384' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-57' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='495' column='1' id='type-id-127'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='493' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='496' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='resource_flags' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='494' column='1'/>
+        <var-decl name='resource_flags' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='497' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='port_gid' type-id='type-id-174' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='495' column='1'/>
+        <var-decl name='port_gid' type-id='type-id-128' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='498' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='' type-id='type-id-175' visibility='default'/>
+        <var-decl name='' type-id='type-id-129' visibility='default'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='target_port_id' type-id='type-id-23' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='500' column='1'/>
+        <var-decl name='target_port_id' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='503' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='device_id' type-id='type-id-23' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='501' column='1'/>
+        <var-decl name='device_id' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='504' column='1'/>
       </data-member>
     </class-decl>
 
-    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='128' id='type-id-174'>
-      <subrange length='2' type-id='type-id-38' id='type-id-176'/>
+    <array-type-def dimensions='1' type-id='type-id-88' size-in-bits='128' id='type-id-128'>
+      <subrange length='2' type-id='type-id-12' id='type-id-130'/>
 
     </array-type-def>
-    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='496' column='1' id='type-id-175'>
+    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='499' column='1' id='type-id-129'>
       <data-member access='private'>
-        <var-decl name='ioc_guid' type-id='type-id-23' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='497' column='1'/>
+        <var-decl name='ioc_guid' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='500' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='service_id' type-id='type-id-23' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='498' column='1'/>
+        <var-decl name='service_id' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='501' column='1'/>
       </data-member>
     </union-decl>
-    <typedef-decl name='efidp_infiniband' type-id='type-id-173' filepath='src/include/efivar/efivar-dp.h' line='502' column='1' id='type-id-111'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='152' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-112' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='511' column='1' id='type-id-177'>
+    <typedef-decl name='efidp_infiniband' type-id='type-id-127' filepath='src/include/efivar/efivar-dp.h' line='505' column='1' id='type-id-57'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='152' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-58' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='514' column='1' id='type-id-131'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='512' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='515' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='reserved' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='513' column='1'/>
+        <var-decl name='reserved' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='516' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='baud_rate' type-id='type-id-23' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='514' column='1'/>
+        <var-decl name='baud_rate' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='517' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='data_bits' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='515' column='1'/>
+        <var-decl name='data_bits' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='518' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='136'>
-        <var-decl name='parity' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='516' column='1'/>
+        <var-decl name='parity' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='519' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='144'>
-        <var-decl name='stop_bits' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='517' column='1'/>
+        <var-decl name='stop_bits' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='520' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_uart' type-id='type-id-177' filepath='src/include/efivar/efivar-dp.h' line='518' column='1' id='type-id-112'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-113' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='542' column='1' id='type-id-178'>
+    <typedef-decl name='efidp_uart' type-id='type-id-131' filepath='src/include/efivar/efivar-dp.h' line='521' column='1' id='type-id-58'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-59' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='545' column='1' id='type-id-132'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='543' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='546' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_guid' type-id='type-id-60' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='544' column='1'/>
+        <var-decl name='vendor_guid' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='547' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='vendor_data' type-id='type-id-143' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='545' column='1'/>
+        <var-decl name='vendor_data' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='548' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_msg_vendor' type-id='type-id-178' filepath='src/include/efivar/efivar-dp.h' line='546' column='1' id='type-id-113'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-114' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='555' column='1' id='type-id-179'>
+    <typedef-decl name='efidp_msg_vendor' type-id='type-id-132' filepath='src/include/efivar/efivar-dp.h' line='549' column='1' id='type-id-59'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-60' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='558' column='1' id='type-id-133'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='556' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='559' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_guid' type-id='type-id-60' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='557' column='1'/>
+        <var-decl name='vendor_guid' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='560' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='flow_control_map' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='558' column='1'/>
+        <var-decl name='flow_control_map' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='561' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_uart_flow_control' type-id='type-id-179' filepath='src/include/efivar/efivar-dp.h' line='559' column='1' id='type-id-114'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='352' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-115' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='566' column='1' id='type-id-180'>
+    <typedef-decl name='efidp_uart_flow_control' type-id='type-id-133' filepath='src/include/efivar/efivar-dp.h' line='562' column='1' id='type-id-60'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='352' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-61' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='569' column='1' id='type-id-134'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='567' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='570' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_guid' type-id='type-id-60' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='568' column='1'/>
+        <var-decl name='vendor_guid' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='571' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='reserved' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='569' column='1'/>
+        <var-decl name='reserved' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='572' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='sas_address' type-id='type-id-23' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='570' column='1'/>
+        <var-decl name='sas_address' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='573' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='lun' type-id='type-id-23' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='571' column='1'/>
+        <var-decl name='lun' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='574' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='device_topology_info' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='572' column='1'/>
+        <var-decl name='device_topology_info' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='575' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='328'>
-        <var-decl name='drive_bay_id' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='573' column='1'/>
+        <var-decl name='drive_bay_id' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='576' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='336'>
-        <var-decl name='rtp' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='574' column='1'/>
+        <var-decl name='rtp' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='577' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_sas' type-id='type-id-180' filepath='src/include/efivar/efivar-dp.h' line='575' column='1' id='type-id-115'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-116' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='599' column='1' id='type-id-181'>
+    <typedef-decl name='efidp_sas' type-id='type-id-134' filepath='src/include/efivar/efivar-dp.h' line='578' column='1' id='type-id-61'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-62' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='602' column='1' id='type-id-135'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='600' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='603' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='sas_address' type-id='type-id-57' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='601' column='1'/>
+        <var-decl name='sas_address' type-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='604' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='lun' type-id='type-id-57' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='602' column='1'/>
+        <var-decl name='lun' type-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='605' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='device_topology_info' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='603' column='1'/>
+        <var-decl name='device_topology_info' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='606' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='168'>
-        <var-decl name='drive_bay_id' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='604' column='1'/>
+        <var-decl name='drive_bay_id' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='607' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='176'>
-        <var-decl name='rtp' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='605' column='1'/>
+        <var-decl name='rtp' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='608' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_sas_ex' type-id='type-id-181' filepath='src/include/efivar/efivar-dp.h' line='606' column='1' id='type-id-116'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='144' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-117' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='612' column='1' id='type-id-182'>
+    <typedef-decl name='efidp_sas_ex' type-id='type-id-135' filepath='src/include/efivar/efivar-dp.h' line='609' column='1' id='type-id-62'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='144' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='615' column='1' id='type-id-136'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='613' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='616' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='protocol' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='614' column='1'/>
+        <var-decl name='protocol' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='617' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='options' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='615' column='1'/>
+        <var-decl name='options' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='618' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='lun' type-id='type-id-57' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='616' column='1'/>
+        <var-decl name='lun' type-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='619' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='tpgt' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='617' column='1'/>
+        <var-decl name='tpgt' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='620' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='144'>
-        <var-decl name='target_name' type-id='type-id-143' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='618' column='1'/>
+        <var-decl name='target_name' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='621' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_iscsi' type-id='type-id-182' filepath='src/include/efivar/efivar-dp.h' line='619' column='1' id='type-id-117'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-118' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='647' column='1' id='type-id-183'>
+    <typedef-decl name='efidp_iscsi' type-id='type-id-136' filepath='src/include/efivar/efivar-dp.h' line='622' column='1' id='type-id-63'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-64' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='650' column='1' id='type-id-137'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='648' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='651' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='namespace_id' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='649' column='1'/>
+        <var-decl name='namespace_id' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='652' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='ieee_eui_64' type-id='type-id-57' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='650' column='1'/>
+        <var-decl name='ieee_eui_64' type-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='653' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_nvme' type-id='type-id-183' filepath='src/include/efivar/efivar-dp.h' line='651' column='1' id='type-id-118'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-119' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='656' column='1' id='type-id-184'>
+    <typedef-decl name='efidp_nvme' type-id='type-id-137' filepath='src/include/efivar/efivar-dp.h' line='654' column='1' id='type-id-64'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='659' column='1' id='type-id-138'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='657' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='660' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='uri' type-id='type-id-143' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='658' column='1'/>
+        <var-decl name='uri' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='661' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_uri' type-id='type-id-184' filepath='src/include/efivar/efivar-dp.h' line='659' column='1' id='type-id-119'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='662' column='1' id='type-id-185'>
+    <typedef-decl name='efidp_uri' type-id='type-id-138' filepath='src/include/efivar/efivar-dp.h' line='662' column='1' id='type-id-65'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-66' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='665' column='1' id='type-id-139'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='663' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='666' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='target_id' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='664' column='1'/>
+        <var-decl name='target_id' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='667' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='lun' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='665' column='1'/>
+        <var-decl name='lun' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='668' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_ufs' type-id='type-id-185' filepath='src/include/efivar/efivar-dp.h' line='666' column='1' id='type-id-120'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-121' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='669' column='1' id='type-id-186'>
+    <typedef-decl name='efidp_ufs' type-id='type-id-139' filepath='src/include/efivar/efivar-dp.h' line='669' column='1' id='type-id-66'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-67' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='672' column='1' id='type-id-140'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='670' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='673' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='slot_number' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='671' column='1'/>
+        <var-decl name='slot_number' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='674' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_sd' type-id='type-id-186' filepath='src/include/efivar/efivar-dp.h' line='672' column='1' id='type-id-121'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-122' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='675' column='1' id='type-id-187'>
+    <typedef-decl name='efidp_sd' type-id='type-id-140' filepath='src/include/efivar/efivar-dp.h' line='675' column='1' id='type-id-67'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-68' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='678' column='1' id='type-id-141'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='676' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='679' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='addr' type-id='type-id-62' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='677' column='1'/>
+        <var-decl name='addr' type-id='type-id-94' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='680' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_bt' type-id='type-id-187' filepath='src/include/efivar/efivar-dp.h' line='678' column='1' id='type-id-122'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='288' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-123' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='681' column='1' id='type-id-188'>
+    <typedef-decl name='efidp_bt' type-id='type-id-141' filepath='src/include/efivar/efivar-dp.h' line='681' column='1' id='type-id-68'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='288' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='684' column='1' id='type-id-142'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='682' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='685' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='ssid' type-id='type-id-163' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='683' column='1'/>
+        <var-decl name='ssid' type-id='type-id-117' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='686' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_wifi' type-id='type-id-188' filepath='src/include/efivar/efivar-dp.h' line='684' column='1' id='type-id-123'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='687' column='1' id='type-id-189'>
+    <typedef-decl name='efidp_wifi' type-id='type-id-142' filepath='src/include/efivar/efivar-dp.h' line='687' column='1' id='type-id-69'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='690' column='1' id='type-id-143'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='688' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='691' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='slot' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='689' column='1'/>
+        <var-decl name='slot' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='692' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_emmc' type-id='type-id-189' filepath='src/include/efivar/efivar-dp.h' line='690' column='1' id='type-id-124'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='88' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-125' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='693' column='1' id='type-id-190'>
+    <typedef-decl name='efidp_emmc' type-id='type-id-143' filepath='src/include/efivar/efivar-dp.h' line='693' column='1' id='type-id-70'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='88' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-71' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='698' column='1' id='type-id-144'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='694' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='699' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='addr' type-id='type-id-62' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='695' column='1'/>
+        <var-decl name='addr' type-id='type-id-94' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='700' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='80'>
-        <var-decl name='addr_type' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='696' column='1'/>
+        <var-decl name='addr_type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='701' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_btle' type-id='type-id-190' filepath='src/include/efivar/efivar-dp.h' line='697' column='1' id='type-id-125'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-126' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='703' column='1' id='type-id-191'>
+    <typedef-decl name='efidp_btle' type-id='type-id-144' filepath='src/include/efivar/efivar-dp.h' line='702' column='1' id='type-id-71'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-72' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='708' column='1' id='type-id-145'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='704' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='709' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='is_ipv6' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='705' column='1'/>
+        <var-decl name='is_ipv6' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='710' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='addrs' type-id='type-id-192' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='706' column='1'/>
+        <var-decl name='addrs' type-id='type-id-146' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='711' column='1'/>
       </data-member>
     </class-decl>
-    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar.h' line='49' column='1' id='type-id-193'>
+    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar.h' line='50' column='1' id='type-id-147'>
       <data-member access='private'>
-        <var-decl name='addr' type-id='type-id-194' visibility='default' filepath='src/include/efivar/efivar.h' line='50' column='1'/>
+        <var-decl name='addr' type-id='type-id-148' visibility='default' filepath='src/include/efivar/efivar.h' line='51' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='v4' type-id='type-id-195' visibility='default' filepath='src/include/efivar/efivar.h' line='51' column='1'/>
+        <var-decl name='v4' type-id='type-id-149' visibility='default' filepath='src/include/efivar/efivar.h' line='52' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='v6' type-id='type-id-196' visibility='default' filepath='src/include/efivar/efivar.h' line='52' column='1'/>
+        <var-decl name='v6' type-id='type-id-150' visibility='default' filepath='src/include/efivar/efivar.h' line='53' column='1'/>
       </data-member>
     </union-decl>
 
-    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='128' id='type-id-194'>
-      <subrange length='4' type-id='type-id-38' id='type-id-168'/>
+    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='128' id='type-id-148'>
+      <subrange length='4' type-id='type-id-12' id='type-id-122'/>
 
     </array-type-def>
-    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-195' visibility='default' filepath='src/include/efivar/efivar.h' line='41' column='1' id='type-id-197'>
+    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-149' visibility='default' filepath='src/include/efivar/efivar.h' line='42' column='1' id='type-id-151'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='addr' type-id='type-id-166' visibility='default' filepath='src/include/efivar/efivar.h' line='42' column='1'/>
+        <var-decl name='addr' type-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar.h' line='43' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efi_ipv4_addr_t' type-id='type-id-197' filepath='src/include/efivar/efivar.h' line='43' column='1' id='type-id-195'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-196' visibility='default' filepath='src/include/efivar/efivar.h' line='45' column='1' id='type-id-198'>
+    <typedef-decl name='efi_ipv4_addr_t' type-id='type-id-151' filepath='src/include/efivar/efivar.h' line='44' column='1' id='type-id-149'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-150' visibility='default' filepath='src/include/efivar/efivar.h' line='46' column='1' id='type-id-152'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='addr' type-id='type-id-170' visibility='default' filepath='src/include/efivar/efivar.h' line='46' column='1'/>
+        <var-decl name='addr' type-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar.h' line='47' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efi_ipv6_addr_t' type-id='type-id-198' filepath='src/include/efivar/efivar.h' line='47' column='1' id='type-id-196'/>
-    <typedef-decl name='efi_ip_addr_t' type-id='type-id-193' filepath='src/include/efivar/efivar.h' line='53' column='1' id='type-id-199'/>
+    <typedef-decl name='efi_ipv6_addr_t' type-id='type-id-152' filepath='src/include/efivar/efivar.h' line='48' column='1' id='type-id-150'/>
+    <typedef-decl name='efi_ip_addr_t' type-id='type-id-147' filepath='src/include/efivar/efivar.h' line='54' column='1' id='type-id-153'/>
 
-    <array-type-def dimensions='1' type-id='type-id-199' size-in-bits='128' id='type-id-192'>
-      <subrange length='1' type-id='type-id-38' id='type-id-76'/>
+    <array-type-def dimensions='1' type-id='type-id-153' size-in-bits='infinite' id='type-id-146'>
+      <subrange length='infinite' type-id='type-id-12' id='type-id-13'/>
 
     </array-type-def>
-    <typedef-decl name='efidp_dns' type-id='type-id-191' filepath='src/include/efivar/efivar-dp.h' line='707' column='1' id='type-id-126'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-127' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='710' column='1' id='type-id-200'>
+    <typedef-decl name='efidp_dns' type-id='type-id-145' filepath='src/include/efivar/efivar-dp.h' line='712' column='1' id='type-id-72'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='715' column='1' id='type-id-154'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='711' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='716' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='uuid' type-id='type-id-60' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='712' column='1'/>
+        <var-decl name='uuid' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='717' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_nvdimm' type-id='type-id-200' filepath='src/include/efivar/efivar-dp.h' line='713' column='1' id='type-id-127'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='336' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-128' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='718' column='1' id='type-id-201'>
+    <typedef-decl name='efidp_nvdimm' type-id='type-id-154' filepath='src/include/efivar/efivar-dp.h' line='718' column='1' id='type-id-73'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='336' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-74' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='723' column='1' id='type-id-155'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='719' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='724' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='partition_number' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='720' column='1'/>
+        <var-decl name='partition_number' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='725' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='start' type-id='type-id-23' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='721' column='1'/>
+        <var-decl name='start' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='726' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='size' type-id='type-id-23' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='722' column='1'/>
+        <var-decl name='size' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='727' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='signature' type-id='type-id-170' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='723' column='1'/>
+        <var-decl name='signature' type-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='728' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='format' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='724' column='1'/>
+        <var-decl name='format' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='729' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='328'>
-        <var-decl name='signature_type' type-id='type-id-44' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='725' column='1'/>
+        <var-decl name='signature_type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='730' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_hd' type-id='type-id-201' filepath='src/include/efivar/efivar-dp.h' line='729' column='1' id='type-id-128'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-129' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='743' column='1' id='type-id-202'>
+    <typedef-decl name='efidp_hd' type-id='type-id-155' filepath='src/include/efivar/efivar-dp.h' line='734' column='1' id='type-id-74'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='748' column='1' id='type-id-156'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='744' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='749' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='boot_catalog_entry' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='745' column='1'/>
+        <var-decl name='boot_catalog_entry' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='750' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='partition_rba' type-id='type-id-23' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='746' column='1'/>
+        <var-decl name='partition_rba' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='751' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='sectors' type-id='type-id-23' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='747' column='1'/>
+        <var-decl name='sectors' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='752' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_cdrom' type-id='type-id-202' filepath='src/include/efivar/efivar-dp.h' line='748' column='1' id='type-id-129'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-130' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='751' column='1' id='type-id-203'>
+    <typedef-decl name='efidp_cdrom' type-id='type-id-156' filepath='src/include/efivar/efivar-dp.h' line='753' column='1' id='type-id-75'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='756' column='1' id='type-id-157'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='752' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='757' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_guid' type-id='type-id-60' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='753' column='1'/>
+        <var-decl name='vendor_guid' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='758' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='vendor_data' type-id='type-id-143' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='754' column='1'/>
+        <var-decl name='vendor_data' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='759' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_media_vendor' type-id='type-id-203' filepath='src/include/efivar/efivar-dp.h' line='755' column='1' id='type-id-130'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-131' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='762' column='1' id='type-id-204'>
+    <typedef-decl name='efidp_media_vendor' type-id='type-id-157' filepath='src/include/efivar/efivar-dp.h' line='760' column='1' id='type-id-76'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-77' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='767' column='1' id='type-id-158'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='763' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='768' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='name' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='764' column='1'/>
+        <var-decl name='name' type-id='type-id-7' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='769' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_file' type-id='type-id-204' filepath='src/include/efivar/efivar-dp.h' line='765' column='1' id='type-id-131'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-132' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='769' column='1' id='type-id-205'>
+    <typedef-decl name='efidp_file' type-id='type-id-158' filepath='src/include/efivar/efivar-dp.h' line='770' column='1' id='type-id-77'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='774' column='1' id='type-id-159'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='770' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='775' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='protocol_guid' type-id='type-id-60' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='771' column='1'/>
+        <var-decl name='protocol_guid' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='776' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_protocol' type-id='type-id-205' filepath='src/include/efivar/efivar-dp.h' line='772' column='1' id='type-id-132'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-133' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='775' column='1' id='type-id-206'>
+    <typedef-decl name='efidp_protocol' type-id='type-id-159' filepath='src/include/efivar/efivar-dp.h' line='777' column='1' id='type-id-78'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-79' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='780' column='1' id='type-id-160'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='776' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='781' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='pi_info' type-id='type-id-143' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='777' column='1'/>
+        <var-decl name='pi_info' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='782' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_firmware_file' type-id='type-id-206' filepath='src/include/efivar/efivar-dp.h' line='778' column='1' id='type-id-133'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-134' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='781' column='1' id='type-id-207'>
+    <typedef-decl name='efidp_firmware_file' type-id='type-id-160' filepath='src/include/efivar/efivar-dp.h' line='783' column='1' id='type-id-79'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='786' column='1' id='type-id-161'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='782' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='787' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='pi_info' type-id='type-id-143' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='783' column='1'/>
+        <var-decl name='pi_info' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='788' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_firmware_volume' type-id='type-id-207' filepath='src/include/efivar/efivar-dp.h' line='784' column='1' id='type-id-134'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-135' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='787' column='1' id='type-id-208'>
+    <typedef-decl name='efidp_firmware_volume' type-id='type-id-161' filepath='src/include/efivar/efivar-dp.h' line='789' column='1' id='type-id-80'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-81' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='792' column='1' id='type-id-162'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='788' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='793' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='reserved' type-id='type-id-4' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='789' column='1'/>
+        <var-decl name='reserved' type-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='794' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='first_byte' type-id='type-id-23' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='790' column='1'/>
+        <var-decl name='first_byte' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='795' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='last_byte' type-id='type-id-23' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='791' column='1'/>
+        <var-decl name='last_byte' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='796' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_relative_offset' type-id='type-id-208' filepath='src/include/efivar/efivar-dp.h' line='792' column='1' id='type-id-135'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='304' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-136' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='795' column='1' id='type-id-209'>
+    <typedef-decl name='efidp_relative_offset' type-id='type-id-162' filepath='src/include/efivar/efivar-dp.h' line='797' column='1' id='type-id-81'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='304' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-82' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='800' column='1' id='type-id-163'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='796' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='801' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='start_addr' type-id='type-id-23' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='797' column='1'/>
+        <var-decl name='start_addr' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='802' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='end_addr' type-id='type-id-23' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='798' column='1'/>
+        <var-decl name='end_addr' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='803' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='disk_type_guid' type-id='type-id-60' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='799' column='1'/>
+        <var-decl name='disk_type_guid' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='804' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='288'>
-        <var-decl name='instance_number' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='800' column='1'/>
+        <var-decl name='instance_number' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='805' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_ramdisk' type-id='type-id-209' filepath='src/include/efivar/efivar-dp.h' line='801' column='1' id='type-id-136'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-137' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='814' column='1' id='type-id-210'>
+    <typedef-decl name='efidp_ramdisk' type-id='type-id-163' filepath='src/include/efivar/efivar-dp.h' line='806' column='1' id='type-id-82'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-83' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='819' column='1' id='type-id-164'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='815' column='1'/>
+        <var-decl name='header' type-id='type-id-32' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='820' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='device_type' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='816' column='1'/>
+        <var-decl name='device_type' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='821' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='status' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='817' column='1'/>
+        <var-decl name='status' type-id='type-id-6' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='822' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='description' type-id='type-id-143' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='818' column='1'/>
-      </data-member>
-    </class-decl>
-    <typedef-decl name='efidp_bios_boot' type-id='type-id-210' filepath='src/include/efivar/efivar-dp.h' line='819' column='1' id='type-id-137'/>
-    <typedef-decl name='efidp_data' type-id='type-id-84' filepath='src/include/efivar/efivar-dp.h' line='891' column='1' id='type-id-211'/>
-    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-212'/>
-    <typedef-decl name='efidp' type-id='type-id-212' filepath='src/include/efivar/efivar-dp.h' line='892' column='1' id='type-id-213'/>
-    <function-decl name='efi_loadopt_path' mangled-name='efi_loadopt_path' filepath='src/&lt;built-in&gt;' line='207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_path@@libefiboot.so.0'>
-      <parameter type-id='type-id-78' name='opt' filepath='src/&lt;built-in&gt;' line='207' column='1'/>
-      <parameter type-id='type-id-15' name='limit' filepath='src/&lt;built-in&gt;' line='207' column='1'/>
-      <return type-id='type-id-213'/>
-    </function-decl>
-    <function-decl name='efi_loadopt_pathlen' mangled-name='efi_loadopt_pathlen' filepath='src/&lt;built-in&gt;' line='193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_pathlen@@libefiboot.so.0'>
-      <parameter type-id='type-id-78' name='opt' filepath='src/&lt;built-in&gt;' line='193' column='1'/>
-      <parameter type-id='type-id-15' name='limit' filepath='src/&lt;built-in&gt;' line='193' column='1'/>
-      <return type-id='type-id-43'/>
-    </function-decl>
-    <type-decl name='void' id='type-id-214'/>
-    <function-decl name='efi_loadopt_attr_clear' mangled-name='efi_loadopt_attr_clear' filepath='src/&lt;built-in&gt;' line='186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_attr_clear@@libefiboot.so.0'>
-      <parameter type-id='type-id-78' name='opt' filepath='src/&lt;built-in&gt;' line='186' column='1'/>
-      <parameter type-id='type-id-43' name='attr' filepath='src/&lt;built-in&gt;' line='186' column='1'/>
-      <return type-id='type-id-214'/>
-    </function-decl>
-    <function-decl name='efi_loadopt_attr_set' mangled-name='efi_loadopt_attr_set' filepath='src/&lt;built-in&gt;' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_attr_set@@libefiboot.so.0'>
-      <parameter type-id='type-id-78' name='opt' filepath='src/&lt;built-in&gt;' line='186' column='1'/>
-      <parameter type-id='type-id-43' name='attr' filepath='src/&lt;built-in&gt;' line='186' column='1'/>
-      <return type-id='type-id-214'/>
-    </function-decl>
-    <function-decl name='efi_loadopt_attrs' mangled-name='efi_loadopt_attrs' filepath='src/&lt;built-in&gt;' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_attrs@@libefiboot.so.0'>
-      <parameter type-id='type-id-78' name='opt' filepath='src/&lt;built-in&gt;' line='174' column='1'/>
-      <return type-id='type-id-4'/>
-    </function-decl>
-    <function-decl name='efi_loadopt_is_valid' mangled-name='efi_loadopt_is_valid' filepath='src/&lt;built-in&gt;' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_is_valid@@libefiboot.so.0'>
-      <parameter type-id='type-id-78' name='opt' filepath='src/&lt;built-in&gt;' line='165' column='1'/>
-      <parameter type-id='type-id-80' name='size' filepath='src/&lt;built-in&gt;' line='165' column='1'/>
-      <return type-id='type-id-22'/>
-    </function-decl>
-    <function-decl name='efi_loadopt_optional_data_size' mangled-name='efi_loadopt_optional_data_size' filepath='src/&lt;built-in&gt;' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_optional_data_size@@libefiboot.so.0'>
-      <parameter type-id='type-id-78' name='opt' filepath='src/&lt;built-in&gt;' line='117' column='1'/>
-      <parameter type-id='type-id-80' name='size' filepath='src/&lt;built-in&gt;' line='117' column='1'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_loadopt_create' mangled-name='efi_loadopt_create' filepath='src/&lt;built-in&gt;' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_create@@libefiboot.so.0'>
-      <parameter type-id='type-id-69' name='buf' filepath='src/&lt;built-in&gt;' line='40' column='1'/>
-      <parameter type-id='type-id-15' name='size' filepath='src/&lt;built-in&gt;' line='40' column='1'/>
-      <parameter type-id='type-id-4' name='attributes' filepath='src/&lt;built-in&gt;' line='40' column='1'/>
-      <parameter type-id='type-id-213' name='dp' filepath='src/&lt;built-in&gt;' line='41' column='1'/>
-      <parameter type-id='type-id-15' name='dp_size' filepath='src/&lt;built-in&gt;' line='41' column='1'/>
-      <parameter type-id='type-id-81' name='description' filepath='src/&lt;built-in&gt;' line='41' column='1'/>
-      <parameter type-id='type-id-69' name='optional_data' filepath='src/&lt;built-in&gt;' line='42' column='1'/>
-      <parameter type-id='type-id-80' name='optional_data_size' filepath='src/&lt;built-in&gt;' line='42' column='1'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_generate_ipv4_device_path' mangled-name='efi_generate_ipv4_device_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_ipv4_device_path@@libefiboot.so.0'>
-      <parameter type-id='type-id-69' name='buf'/>
-      <parameter type-id='type-id-15' name='size'/>
-      <parameter type-id='type-id-67' name='ifname'/>
-      <parameter type-id='type-id-67' name='local_addr'/>
-      <parameter type-id='type-id-67' name='remote_addr'/>
-      <parameter type-id='type-id-67' name='gateway_addr'/>
-      <parameter type-id='type-id-67' name='netmask'/>
-      <parameter type-id='type-id-43' name='local_port'/>
-      <parameter type-id='type-id-43' name='remote_port'/>
-      <parameter type-id='type-id-43' name='protocol'/>
-      <parameter type-id='type-id-44' name='addr_origin'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_generate_file_device_path' mangled-name='efi_generate_file_device_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_file_device_path@@libefiboot.so.0'>
-      <parameter type-id='type-id-69' name='buf'/>
-      <parameter type-id='type-id-15' name='size'/>
-      <parameter type-id='type-id-67' name='filepath'/>
-      <parameter type-id='type-id-4' name='options'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_generate_file_device_path_from_esp' mangled-name='efi_generate_file_device_path_from_esp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_file_device_path_from_esp@@libefiboot.so.0'>
-      <parameter type-id='type-id-69' name='buf'/>
-      <parameter type-id='type-id-15' name='size'/>
-      <parameter type-id='type-id-66' name='devpath'/>
-      <parameter type-id='type-id-22' name='partition'/>
-      <parameter type-id='type-id-66' name='relpath'/>
-      <parameter type-id='type-id-4' name='options'/>
-      <return type-id='type-id-15'/>
+        <var-decl name='description' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='823' column='1'/>
+      </data-member>
+    </class-decl>
+    <typedef-decl name='efidp_bios_boot' type-id='type-id-164' filepath='src/include/efivar/efivar-dp.h' line='824' column='1' id='type-id-83'/>
+    <typedef-decl name='efidp_data' type-id='type-id-30' filepath='src/include/efivar/efivar-dp.h' line='896' column='1' id='type-id-165'/>
+    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-166'/>
+    <typedef-decl name='efidp' type-id='type-id-166' filepath='src/include/efivar/efivar-dp.h' line='897' column='1' id='type-id-167'/>
+    <function-decl name='efi_loadopt_path' mangled-name='efi_loadopt_path' filepath='src/hexdump.h' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_path@@libefiboot.so.0'>
+      <parameter type-id='type-id-15' name='opt' filepath='src/hexdump.h' line='206' column='1'/>
+      <parameter type-id='type-id-18' name='limit' filepath='src/hexdump.h' line='206' column='1'/>
+      <return type-id='type-id-167'/>
     </function-decl>
-
-    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='64' alignment-in-bits='32' id='type-id-215'>
-      <subrange length='2' type-id='type-id-38' id='type-id-176'/>
-
-    </array-type-def>
-    <var-decl name='pci_iftypes' type-id='type-id-215' visibility='default' filepath='src/linux-pci.c' line='235' column='1'/>
-    <var-decl name='pmem_iftypes' type-id='type-id-215' visibility='default' filepath='src/linux-pmem.c' line='183' column='1'/>
-    <var-decl name='virtblk_iftypes' type-id='type-id-215' visibility='default' filepath='src/linux-virtblk.c' line='78' column='1'/>
-    <var-decl name='sas_iftypes' type-id='type-id-215' visibility='default' filepath='src/linux-sas.c' line='122' column='1'/>
-    <var-decl name='sata_iftypes' type-id='type-id-215' visibility='default' filepath='src/linux-sata.c' line='255' column='1'/>
-
-    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='96' alignment-in-bits='32' id='type-id-216'>
-      <subrange length='3' type-id='type-id-38' id='type-id-41'/>
-
-    </array-type-def>
-    <var-decl name='ata_iftypes' type-id='type-id-216' visibility='default' filepath='src/linux-ata.c' line='151' column='1'/>
-    <var-decl name='scsi_iftypes' type-id='type-id-215' visibility='default' filepath='src/linux-scsi.c' line='239' column='1'/>
-    <var-decl name='i2o_iftypes' type-id='type-id-215' visibility='default' filepath='src/linux-i2o.c' line='55' column='1'/>
-    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
-      <return type-id='type-id-214'/>
+    <function-decl name='efi_loadopt_pathlen' mangled-name='efi_loadopt_pathlen' filepath='src/hexdump.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_pathlen@@libefiboot.so.0'>
+      <parameter type-id='type-id-15' name='opt' filepath='src/hexdump.h' line='192' column='1'/>
+      <parameter type-id='type-id-18' name='limit' filepath='src/hexdump.h' line='192' column='1'/>
+      <return type-id='type-id-6'/>
     </function-decl>
-    <function-decl name='__builtin_calloc' mangled-name='calloc' visibility='default' binding='global' size-in-bits='64'>
-      <return type-id='type-id-214'/>
+    <type-decl name='void' id='type-id-168'/>
+    <function-decl name='efi_loadopt_attr_clear' mangled-name='efi_loadopt_attr_clear' filepath='src/hexdump.h' line='185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_attr_clear@@libefiboot.so.0'>
+      <parameter type-id='type-id-15' name='opt' filepath='src/hexdump.h' line='185' column='1'/>
+      <parameter type-id='type-id-6' name='attr' filepath='src/hexdump.h' line='185' column='1'/>
+      <return type-id='type-id-168'/>
     </function-decl>
-    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64'>
-      <return type-id='type-id-214'/>
+    <function-decl name='efi_loadopt_attr_set' mangled-name='efi_loadopt_attr_set' filepath='src/hexdump.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_attr_set@@libefiboot.so.0'>
+      <parameter type-id='type-id-15' name='opt' filepath='src/hexdump.h' line='185' column='1'/>
+      <parameter type-id='type-id-6' name='attr' filepath='src/hexdump.h' line='185' column='1'/>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efi_loadopt_attrs' mangled-name='efi_loadopt_attrs' filepath='src/hexdump.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_attrs@@libefiboot.so.0'>
+      <parameter type-id='type-id-15' name='opt' filepath='src/hexdump.h' line='173' column='1'/>
+      <return type-id='type-id-5'/>
+    </function-decl>
+    <function-decl name='efi_loadopt_optional_data_size' mangled-name='efi_loadopt_optional_data_size' filepath='src/hexdump.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_optional_data_size@@libefiboot.so.0'>
+      <parameter type-id='type-id-15' name='opt' filepath='src/hexdump.h' line='116' column='1'/>
+      <parameter type-id='type-id-26' name='size' filepath='src/hexdump.h' line='116' column='1'/>
+      <return type-id='type-id-18'/>
+    </function-decl>
+    <function-decl name='efi_loadopt_is_valid' mangled-name='efi_loadopt_is_valid' filepath='src/hexdump.h' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_is_valid@@libefiboot.so.0'>
+      <parameter type-id='type-id-15' name='opt' filepath='src/hexdump.h' line='164' column='1'/>
+      <parameter type-id='type-id-26' name='size' filepath='src/hexdump.h' line='164' column='1'/>
+      <return type-id='type-id-25'/>
+    </function-decl>
+    <function-decl name='efi_loadopt_create' mangled-name='efi_loadopt_create' filepath='src/hexdump.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_create@@libefiboot.so.0'>
+      <parameter type-id='type-id-22' name='buf' filepath='src/hexdump.h' line='40' column='1'/>
+      <parameter type-id='type-id-18' name='size' filepath='src/hexdump.h' line='40' column='1'/>
+      <parameter type-id='type-id-5' name='attributes' filepath='src/hexdump.h' line='40' column='1'/>
+      <parameter type-id='type-id-167' name='dp' filepath='src/hexdump.h' line='41' column='1'/>
+      <parameter type-id='type-id-18' name='dp_size' filepath='src/hexdump.h' line='41' column='1'/>
+      <parameter type-id='type-id-27' name='description' filepath='src/hexdump.h' line='41' column='1'/>
+      <parameter type-id='type-id-22' name='optional_data' filepath='src/hexdump.h' line='42' column='1'/>
+      <parameter type-id='type-id-26' name='optional_data_size' filepath='src/hexdump.h' line='42' column='1'/>
+      <return type-id='type-id-18'/>
     </function-decl>
+    <qualified-type-def type-id='type-id-23' const='yes' id='type-id-169'/>
+    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-170'/>
+    <qualified-type-def type-id='type-id-170' const='yes' id='type-id-171'/>
+    <function-decl name='efi_generate_ipv4_device_path' mangled-name='efi_generate_ipv4_device_path' filepath='src/include/efivar/efivar-dp.h' line='475' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_ipv4_device_path@@libefiboot.so.0'>
+      <parameter type-id='type-id-22' name='buf' filepath='src/include/efivar/efivar-dp.h' line='475' column='1'/>
+      <parameter type-id='type-id-18' name='size' filepath='src/include/efivar/efivar-dp.h' line='475' column='1'/>
+      <parameter type-id='type-id-171' name='ifname' filepath='src/include/efivar/efivar-dp.h' line='476' column='1'/>
+      <parameter type-id='type-id-171' name='local_addr' filepath='src/include/efivar/efivar-dp.h' line='477' column='1'/>
+      <parameter type-id='type-id-171' name='remote_addr' filepath='src/include/efivar/efivar-dp.h' line='478' column='1'/>
+      <parameter type-id='type-id-171' name='gateway_addr' filepath='src/include/efivar/efivar-dp.h' line='479' column='1'/>
+      <parameter type-id='type-id-171' name='netmask' filepath='src/include/efivar/efivar-dp.h' line='480' column='1'/>
+      <parameter type-id='type-id-6' name='local_port' filepath='src/include/efivar/efivar-dp.h' line='481' column='1'/>
+      <parameter type-id='type-id-6' name='remote_port' filepath='src/include/efivar/efivar-dp.h' line='482' column='1'/>
+      <parameter type-id='type-id-6' name='protocol' filepath='src/include/efivar/efivar-dp.h' line='483' column='1'/>
+      <parameter type-id='type-id-21' name='addr_origin' filepath='src/include/efivar/efivar-dp.h' line='484' column='1'/>
+      <return type-id='type-id-18'/>
+    </function-decl>
+    <function-decl name='efi_generate_file_device_path' mangled-name='efi_generate_file_device_path' filepath='src/include/efivar/efivar-dp.h' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_file_device_path@@libefiboot.so.0'>
+      <parameter type-id='type-id-22' name='buf' filepath='src/include/efivar/efivar-dp.h' line='384' column='1'/>
+      <parameter type-id='type-id-18' name='size' filepath='src/include/efivar/efivar-dp.h' line='384' column='1'/>
+      <parameter type-id='type-id-171' name='filepath' filepath='src/include/efivar/efivar-dp.h' line='385' column='1'/>
+      <parameter type-id='type-id-5' name='options' filepath='src/include/efivar/efivar-dp.h' line='386' column='1'/>
+      <return type-id='type-id-18'/>
+    </function-decl>
+    <function-decl name='efi_generate_file_device_path_from_esp' mangled-name='efi_generate_file_device_path_from_esp' filepath='src/include/efivar/efivar-dp.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_file_device_path_from_esp@@libefiboot.so.0'>
+      <parameter type-id='type-id-22' name='buf' filepath='src/include/efivar/efivar-dp.h' line='332' column='1'/>
+      <parameter type-id='type-id-18' name='size' filepath='src/include/efivar/efivar-dp.h' line='332' column='1'/>
+      <parameter type-id='type-id-170' name='devpath' filepath='src/include/efivar/efivar-dp.h' line='333' column='1'/>
+      <parameter type-id='type-id-25' name='partition' filepath='src/include/efivar/efivar-dp.h' line='333' column='1'/>
+      <parameter type-id='type-id-170' name='relpath' filepath='src/include/efivar/efivar-dp.h' line='334' column='1'/>
+      <parameter type-id='type-id-5' name='options' filepath='src/include/efivar/efivar-dp.h' line='335' column='1'/>
+      <return type-id='type-id-18'/>
+    </function-decl>
+    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-172'/>
+    <enum-decl name='interface_type' filepath='src/linux.h' line='100' column='1' id='type-id-173'>
+      <underlying-type type-id='type-id-172'/>
+      <enumerator name='unknown' value='0'/>
+      <enumerator name='isa' value='1'/>
+      <enumerator name='acpi_root' value='2'/>
+      <enumerator name='pci_root' value='3'/>
+      <enumerator name='soc_root' value='4'/>
+      <enumerator name='pci' value='5'/>
+      <enumerator name='network' value='6'/>
+      <enumerator name='ata' value='7'/>
+      <enumerator name='atapi' value='8'/>
+      <enumerator name='scsi' value='9'/>
+      <enumerator name='sata' value='10'/>
+      <enumerator name='sas' value='11'/>
+      <enumerator name='usb' value='12'/>
+      <enumerator name='i1394' value='13'/>
+      <enumerator name='fibre' value='14'/>
+      <enumerator name='i2o' value='15'/>
+      <enumerator name='md' value='16'/>
+      <enumerator name='virtblk' value='17'/>
+      <enumerator name='nvme' value='18'/>
+      <enumerator name='nd_pmem' value='19'/>
+      <enumerator name='emmc' value='20'/>
+    </enum-decl>
+
+    <array-type-def dimensions='1' type-id='type-id-173' size-in-bits='64' alignment-in-bits='32' id='type-id-174'>
+      <subrange length='2' type-id='type-id-12' id='type-id-130'/>
+
+    </array-type-def>
+    <var-decl name='i2o_iftypes' type-id='type-id-174' visibility='default' filepath='src/linux-i2o.c' line='55' column='1'/>
+    <var-decl name='scsi_iftypes' type-id='type-id-174' visibility='default' filepath='src/linux-scsi.c' line='296' column='1'/>
+
+    <array-type-def dimensions='1' type-id='type-id-173' size-in-bits='96' alignment-in-bits='32' id='type-id-175'>
+      <subrange length='3' type-id='type-id-12' id='type-id-176'/>
+
+    </array-type-def>
+    <var-decl name='ata_iftypes' type-id='type-id-175' visibility='default' filepath='src/linux-ata.c' line='152' column='1'/>
+    <var-decl name='sata_iftypes' type-id='type-id-174' visibility='default' filepath='src/linux-sata.c' line='244' column='1'/>
+    <var-decl name='sas_iftypes' type-id='type-id-174' visibility='default' filepath='src/linux-sas.c' line='256' column='1'/>
+    <var-decl name='virtblk_iftypes' type-id='type-id-174' visibility='default' filepath='src/linux-virtblk.c' line='70' column='1'/>
+    <var-decl name='soc_root_iftypes' type-id='type-id-174' visibility='default' filepath='src/linux-soc-root.c' line='58' column='1'/>
+    <var-decl name='pci_root_iftypes' type-id='type-id-174' visibility='default' filepath='src/linux-pci-root.c' line='117' column='1'/>
+    <var-decl name='acpi_root_iftypes' type-id='type-id-174' visibility='default' filepath='src/linux-acpi-root.c' line='183' column='1'/>
+    <var-decl name='pmem_iftypes' type-id='type-id-174' visibility='default' filepath='src/linux-pmem.c' line='183' column='1'/>
+    <class-decl name='dev_probe' size-in-bits='384' is-struct='yes' visibility='default' filepath='src/linux.h' line='258' column='1' id='type-id-177'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <var-decl name='name' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='259' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='64'>
+        <var-decl name='iftypes' type-id='type-id-178' visibility='default' filepath='src/linux.h' line='260' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='128'>
+        <var-decl name='flags' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='261' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='192'>
+        <var-decl name='parse' type-id='type-id-179' visibility='default' filepath='src/linux.h' line='262' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='256'>
+        <var-decl name='create' type-id='type-id-180' visibility='default' filepath='src/linux.h' line='264' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='320'>
+        <var-decl name='make_part_name' type-id='type-id-181' visibility='default' filepath='src/linux.h' line='266' column='1'/>
+      </data-member>
+    </class-decl>
+    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-178'/>
+    <class-decl name='device' size-in-bits='2752' is-struct='yes' visibility='default' filepath='src/linux.h' line='112' column='1' id='type-id-182'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <var-decl name='interface_type' type-id='type-id-173' visibility='default' filepath='src/linux.h' line='113' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='32'>
+        <var-decl name='flags' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='114' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='64'>
+        <var-decl name='link' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='115' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='128'>
+        <var-decl name='device' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='116' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='192'>
+        <var-decl name='driver' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='117' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='256'>
+        <var-decl name='probes' type-id='type-id-183' visibility='default' filepath='src/linux.h' line='119' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='320'>
+        <var-decl name='n_probes' type-id='type-id-8' visibility='default' filepath='src/linux.h' line='120' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='384'>
+        <var-decl name='' type-id='type-id-184' visibility='default'/>
+      </data-member>
+    </class-decl>
+    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-185'/>
+    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-183'/>
+    <union-decl name='__anonymous_union__' size-in-bits='2368' is-anonymous='yes' visibility='default' filepath='src/linux.h' line='122' column='1' id='type-id-184'>
+      <data-member access='private'>
+        <var-decl name='' type-id='type-id-186' visibility='default'/>
+      </data-member>
+      <data-member access='private'>
+        <var-decl name='ifname' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='151' column='1'/>
+      </data-member>
+    </union-decl>
+    <class-decl name='__anonymous_struct__' size-in-bits='2368' is-struct='yes' is-anonymous='yes' visibility='default' filepath='src/linux.h' line='123' column='1' id='type-id-186'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <var-decl name='stat' type-id='type-id-187' visibility='default' filepath='src/linux.h' line='124' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1152'>
+        <var-decl name='controllernum' type-id='type-id-8' visibility='default' filepath='src/linux.h' line='126' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1184'>
+        <var-decl name='disknum' type-id='type-id-8' visibility='default' filepath='src/linux.h' line='127' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1216'>
+        <var-decl name='part' type-id='type-id-25' visibility='default' filepath='src/linux.h' line='128' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1280'>
+        <var-decl name='major' type-id='type-id-88' visibility='default' filepath='src/linux.h' line='129' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1344'>
+        <var-decl name='minor' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='130' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1376'>
+        <var-decl name='edd10_devicenum' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='131' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1408'>
+        <var-decl name='disk_name' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='133' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1472'>
+        <var-decl name='part_name' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='134' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1536'>
+        <var-decl name='acpi_root' type-id='type-id-188' visibility='default' filepath='src/linux.h' line='136' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1920'>
+        <var-decl name='pci_root' type-id='type-id-189' visibility='default' filepath='src/linux.h' line='137' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1952'>
+        <var-decl name='n_pci_devs' type-id='type-id-8' visibility='default' filepath='src/linux.h' line='138' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1984'>
+        <var-decl name='pci_dev' type-id='type-id-190' visibility='default' filepath='src/linux.h' line='139' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='2048'>
+        <var-decl name='' type-id='type-id-191' visibility='default'/>
+      </data-member>
+    </class-decl>
+    <class-decl name='stat' size-in-bits='1152' is-struct='yes' visibility='default' filepath='/usr/include/bits/stat.h' line='46' column='1' id='type-id-187'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <var-decl name='st_dev' type-id='type-id-192' visibility='default' filepath='/usr/include/bits/stat.h' line='48' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='64'>
+        <var-decl name='st_ino' type-id='type-id-193' visibility='default' filepath='/usr/include/bits/stat.h' line='53' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='128'>
+        <var-decl name='st_nlink' type-id='type-id-194' visibility='default' filepath='/usr/include/bits/stat.h' line='61' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='192'>
+        <var-decl name='st_mode' type-id='type-id-195' visibility='default' filepath='/usr/include/bits/stat.h' line='62' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='224'>
+        <var-decl name='st_uid' type-id='type-id-196' visibility='default' filepath='/usr/include/bits/stat.h' line='64' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='256'>
+        <var-decl name='st_gid' type-id='type-id-197' visibility='default' filepath='/usr/include/bits/stat.h' line='65' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='288'>
+        <var-decl name='__pad0' type-id='type-id-25' visibility='default' filepath='/usr/include/bits/stat.h' line='67' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='320'>
+        <var-decl name='st_rdev' type-id='type-id-192' visibility='default' filepath='/usr/include/bits/stat.h' line='69' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='384'>
+        <var-decl name='st_size' type-id='type-id-198' visibility='default' filepath='/usr/include/bits/stat.h' line='74' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='448'>
+        <var-decl name='st_blksize' type-id='type-id-199' visibility='default' filepath='/usr/include/bits/stat.h' line='78' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='512'>
+        <var-decl name='st_blocks' type-id='type-id-200' visibility='default' filepath='/usr/include/bits/stat.h' line='80' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='576'>
+        <var-decl name='st_atim' type-id='type-id-201' visibility='default' filepath='/usr/include/bits/stat.h' line='91' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='704'>
+        <var-decl name='st_mtim' type-id='type-id-201' visibility='default' filepath='/usr/include/bits/stat.h' line='92' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='832'>
+        <var-decl name='st_ctim' type-id='type-id-201' visibility='default' filepath='/usr/include/bits/stat.h' line='93' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='960'>
+        <var-decl name='__glibc_reserved' type-id='type-id-202' visibility='default' filepath='/usr/include/bits/stat.h' line='106' column='1'/>
+      </data-member>
+    </class-decl>
+    <typedef-decl name='__dev_t' type-id='type-id-12' filepath='/usr/include/bits/types.h' line='145' column='1' id='type-id-192'/>
+    <typedef-decl name='__ino_t' type-id='type-id-12' filepath='/usr/include/bits/types.h' line='148' column='1' id='type-id-193'/>
+    <typedef-decl name='__nlink_t' type-id='type-id-12' filepath='/usr/include/bits/types.h' line='151' column='1' id='type-id-194'/>
+    <typedef-decl name='__mode_t' type-id='type-id-8' filepath='/usr/include/bits/types.h' line='150' column='1' id='type-id-195'/>
+    <typedef-decl name='__uid_t' type-id='type-id-8' filepath='/usr/include/bits/types.h' line='146' column='1' id='type-id-196'/>
+    <typedef-decl name='__gid_t' type-id='type-id-8' filepath='/usr/include/bits/types.h' line='147' column='1' id='type-id-197'/>
+    <typedef-decl name='__off_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-198'/>
+    <typedef-decl name='__blksize_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='174' column='1' id='type-id-199'/>
+    <typedef-decl name='__blkcnt_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='179' column='1' id='type-id-200'/>
+    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='9' column='1' id='type-id-201'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <var-decl name='tv_sec' type-id='type-id-203' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='64'>
+        <var-decl name='tv_nsec' type-id='type-id-204' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='12' column='1'/>
+      </data-member>
+    </class-decl>
+    <typedef-decl name='__time_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-203'/>
+    <typedef-decl name='__syscall_slong_t' type-id='type-id-16' filepath='/usr/include/bits/types.h' line='196' column='1' id='type-id-204'/>
+
+    <array-type-def dimensions='1' type-id='type-id-204' size-in-bits='192' id='type-id-202'>
+      <subrange length='3' type-id='type-id-12' id='type-id-176'/>
+
+    </array-type-def>
+    <class-decl name='acpi_root_info' size-in-bits='384' is-struct='yes' visibility='default' filepath='src/linux.h' line='24' column='1' id='type-id-188'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <var-decl name='acpi_hid' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='25' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='64'>
+        <var-decl name='acpi_uid' type-id='type-id-88' visibility='default' filepath='src/linux.h' line='26' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='128'>
+        <var-decl name='acpi_cid' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='27' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='192'>
+        <var-decl name='acpi_hid_str' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='28' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='256'>
+        <var-decl name='acpi_uid_str' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='29' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='320'>
+        <var-decl name='acpi_cid_str' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='30' column='1'/>
+      </data-member>
+    </class-decl>
+    <class-decl name='pci_root_info' size-in-bits='32' is-struct='yes' visibility='default' filepath='src/linux.h' line='33' column='1' id='type-id-189'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <var-decl name='pci_domain' type-id='type-id-6' visibility='default' filepath='src/linux.h' line='34' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='16'>
+        <var-decl name='pci_bus' type-id='type-id-21' visibility='default' filepath='src/linux.h' line='35' column='1'/>
+      </data-member>
+    </class-decl>
+    <class-decl name='pci_dev_info' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/linux.h' line='38' column='1' id='type-id-205'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <var-decl name='pci_domain' type-id='type-id-6' visibility='default' filepath='src/linux.h' line='39' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='16'>
+        <var-decl name='pci_bus' type-id='type-id-21' visibility='default' filepath='src/linux.h' line='40' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='24'>
+        <var-decl name='pci_device' type-id='type-id-21' visibility='default' filepath='src/linux.h' line='41' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='32'>
+        <var-decl name='pci_function' type-id='type-id-21' visibility='default' filepath='src/linux.h' line='42' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='64'>
+        <var-decl name='driverlink' type-id='type-id-24' visibility='default' filepath='src/linux.h' line='43' column='1'/>
+      </data-member>
+    </class-decl>
+    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-190'/>
+    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='src/linux.h' line='141' column='1' id='type-id-191'>
+      <data-member access='private'>
+        <var-decl name='scsi_info' type-id='type-id-206' visibility='default' filepath='src/linux.h' line='142' column='1'/>
+      </data-member>
+      <data-member access='private'>
+        <var-decl name='sas_info' type-id='type-id-207' visibility='default' filepath='src/linux.h' line='143' column='1'/>
+      </data-member>
+      <data-member access='private'>
+        <var-decl name='sata_info' type-id='type-id-208' visibility='default' filepath='src/linux.h' line='144' column='1'/>
+      </data-member>
+      <data-member access='private'>
+        <var-decl name='ata_info' type-id='type-id-209' visibility='default' filepath='src/linux.h' line='145' column='1'/>
+      </data-member>
+      <data-member access='private'>
+        <var-decl name='nvme_info' type-id='type-id-210' visibility='default' filepath='src/linux.h' line='146' column='1'/>
+      </data-member>
+      <data-member access='private'>
+        <var-decl name='emmc_info' type-id='type-id-211' visibility='default' filepath='src/linux.h' line='147' column='1'/>
+      </data-member>
+      <data-member access='private'>
+        <var-decl name='nvdimm_info' type-id='type-id-212' visibility='default' filepath='src/linux.h' line='148' column='1'/>
+      </data-member>
+    </union-decl>
+    <class-decl name='scsi_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='src/linux.h' line='46' column='1' id='type-id-206'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <var-decl name='scsi_bus' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='47' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='32'>
+        <var-decl name='scsi_device' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='48' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='64'>
+        <var-decl name='scsi_target' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='49' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='128'>
+        <var-decl name='scsi_lun' type-id='type-id-88' visibility='default' filepath='src/linux.h' line='50' column='1'/>
+      </data-member>
+    </class-decl>
+    <class-decl name='sas_info' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/linux.h' line='53' column='1' id='type-id-207'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <var-decl name='scsi_bus' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='54' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='32'>
+        <var-decl name='scsi_device' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='55' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='64'>
+        <var-decl name='scsi_target' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='56' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='128'>
+        <var-decl name='scsi_lun' type-id='type-id-88' visibility='default' filepath='src/linux.h' line='57' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='192'>
+        <var-decl name='sas_address' type-id='type-id-88' visibility='default' filepath='src/linux.h' line='59' column='1'/>
+      </data-member>
+    </class-decl>
+    <class-decl name='sata_info' size-in-bits='320' is-struct='yes' visibility='default' filepath='src/linux.h' line='62' column='1' id='type-id-208'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <var-decl name='scsi_bus' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='63' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='32'>
+        <var-decl name='scsi_device' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='64' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='64'>
+        <var-decl name='scsi_target' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='65' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='128'>
+        <var-decl name='scsi_lun' type-id='type-id-88' visibility='default' filepath='src/linux.h' line='66' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='192'>
+        <var-decl name='ata_devno' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='68' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='224'>
+        <var-decl name='ata_port' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='69' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='256'>
+        <var-decl name='ata_pmp' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='70' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='288'>
+        <var-decl name='ata_print_id' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='72' column='1'/>
+      </data-member>
+    </class-decl>
+    <class-decl name='ata_info' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/linux.h' line='75' column='1' id='type-id-209'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <var-decl name='scsi_bus' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='76' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='32'>
+        <var-decl name='scsi_device' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='77' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='64'>
+        <var-decl name='scsi_target' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='78' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='128'>
+        <var-decl name='scsi_lun' type-id='type-id-88' visibility='default' filepath='src/linux.h' line='79' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='192'>
+        <var-decl name='scsi_host' type-id='type-id-5' visibility='default' filepath='src/linux.h' line='81' column='1'/>
+      </data-member>
+    </class-decl>
+    <class-decl name='nvme_info' size-in-bits='160' is-struct='yes' visibility='default' filepath='src/linux.h' line='84' column='1' id='type-id-210'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <var-decl name='ctrl_id' type-id='type-id-213' visibility='default' filepath='src/linux.h' line='85' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='32'>
+        <var-decl name='ns_id' type-id='type-id-213' visibility='default' filepath='src/linux.h' line='86' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='64'>
+        <var-decl name='has_eui' type-id='type-id-25' visibility='default' filepath='src/linux.h' line='87' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='96'>
+        <var-decl name='eui' type-id='type-id-107' visibility='default' filepath='src/linux.h' line='88' column='1'/>
+      </data-member>
+    </class-decl>
+    <typedef-decl name='__int32_t' type-id='type-id-25' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-214'/>
+    <typedef-decl name='int32_t' type-id='type-id-214' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-213'/>
+    <class-decl name='emmc_info' size-in-bits='32' is-struct='yes' visibility='default' filepath='src/linux.h' line='96' column='1' id='type-id-211'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <var-decl name='slot_id' type-id='type-id-213' visibility='default' filepath='src/linux.h' line='97' column='1'/>
+      </data-member>
+    </class-decl>
+    <class-decl name='nvdimm_info' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/linux.h' line='91' column='1' id='type-id-212'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <var-decl name='namespace_label' type-id='type-id-91' visibility='default' filepath='src/linux.h' line='92' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='128'>
+        <var-decl name='nvdimm_label' type-id='type-id-91' visibility='default' filepath='src/linux.h' line='93' column='1'/>
+      </data-member>
+    </class-decl>
+    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-215'/>
+    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-179'/>
+    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-180'/>
+    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-181'/>
+    <var-decl name='emmc_parser' type-id='type-id-177' visibility='default' filepath='src/linux.h' line='288' column='1'/>
+    <var-decl name='i2o_parser' type-id='type-id-177' visibility='default' filepath='src/linux.h' line='285' column='1'/>
+    <var-decl name='scsi_parser' type-id='type-id-177' visibility='default' filepath='src/linux.h' line='286' column='1'/>
+    <var-decl name='ata_parser' type-id='type-id-177' visibility='default' filepath='src/linux.h' line='287' column='1'/>
+    <var-decl name='nvme_parser' type-id='type-id-177' visibility='default' filepath='src/linux.h' line='283' column='1'/>
+    <var-decl name='sata_parser' type-id='type-id-177' visibility='default' filepath='src/linux.h' line='282' column='1'/>
+    <var-decl name='sas_parser' type-id='type-id-177' visibility='default' filepath='src/linux.h' line='281' column='1'/>
+    <var-decl name='virtblk_parser' type-id='type-id-177' visibility='default' filepath='src/linux.h' line='284' column='1'/>
+    <var-decl name='soc_root_parser' type-id='type-id-177' visibility='default' filepath='src/linux.h' line='279' column='1'/>
+    <var-decl name='pci_root_parser' type-id='type-id-177' visibility='default' filepath='src/linux.h' line='277' column='1'/>
+    <var-decl name='acpi_root_parser' type-id='type-id-177' visibility='default' filepath='src/linux.h' line='278' column='1'/>
+    <var-decl name='pmem_parser' type-id='type-id-177' visibility='default' filepath='src/linux.h' line='276' column='1'/>
+    <var-decl name='pci_iftypes' type-id='type-id-174' visibility='default' filepath='src/linux-pci.c' line='147' column='1'/>
+    <var-decl name='pci_parser' type-id='type-id-177' visibility='default' filepath='src/linux.h' line='280' column='1'/>
+    <function-decl name='free' mangled-name='free' filepath='/usr/include/stdlib.h' line='565' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='strcspn' mangled-name='strcspn' filepath='/usr/include/string.h' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='__errno_location' mangled-name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='vasprintf' mangled-name='vasprintf' filepath='/usr/include/stdio.h' line='366' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efi_error_set' mangled-name='efi_error_set' filepath='src/include/efivar/efivar.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='strlen' mangled-name='strlen' filepath='/usr/include/string.h' line='384' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='calloc' mangled-name='calloc' filepath='/usr/include/stdlib.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='realloc' mangled-name='realloc' filepath='/usr/include/stdlib.h' line='550' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='read' mangled-name='read' filepath='/usr/include/unistd.h' line='360' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='sched_yield' mangled-name='sched_yield' filepath='/usr/include/sched.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='open' mangled-name='open' filepath='/usr/include/fcntl.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='close' mangled-name='close' filepath='/usr/include/unistd.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='readlink' mangled-name='readlink' filepath='/usr/include/unistd.h' line='808' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='strcpy' mangled-name='strcpy' filepath='/usr/include/string.h' line='121' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='__xstat' mangled-name='__xstat' filepath='/usr/include/sys/stat.h' line='397' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='strncmp' mangled-name='strncmp' filepath='/usr/include/string.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='strdup' mangled-name='strdup' filepath='/usr/include/string.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='getmntent' mangled-name='getmntent' filepath='/usr/include/mntent.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='feof' mangled-name='feof' filepath='/usr/include/stdio.h' line='759' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='fopen' mangled-name='fopen' filepath='/usr/include/stdio.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='endmntent' mangled-name='endmntent' filepath='/usr/include/mntent.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efi_get_logfile' mangled-name='efi_get_logfile' filepath='src/include/efivar/efivar.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='fprintf' mangled-name='fprintf' filepath='/usr/include/stdio.h' line='326' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='__builtin_fputc' mangled-name='fputc' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efi_get_verbose' mangled-name='efi_get_verbose' filepath='src/include/efivar/efivar.h' line='233' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efidp_make_acpi_hid_ex' mangled-name='efidp_make_acpi_hid_ex' filepath='src/include/efivar/efivar-dp.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efidp_make_acpi_hid' mangled-name='efidp_make_acpi_hid' filepath='src/include/efivar/efivar-dp.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='sscanf' mangled-name='__isoc99_sscanf' filepath='/usr/include/stdio.h' line='412' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='__builtin_fwrite' mangled-name='fwrite' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='strnlen' mangled-name='strnlen' filepath='/usr/include/string.h' line='390' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='strchr' mangled-name='strchr' filepath='/usr/include/string.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='strndup' mangled-name='strndup' filepath='/usr/include/string.h' line='174' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efidp_make_atapi' mangled-name='efidp_make_atapi' filepath='src/include/efivar/efivar-dp.h' line='336' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='strrchr' mangled-name='strrchr' filepath='/usr/include/string.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efidp_make_scsi' mangled-name='efidp_make_scsi' filepath='src/include/efivar/efivar-dp.h' line='345' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='asprintf' mangled-name='asprintf' filepath='/usr/include/stdio.h' line='372' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='strstr' mangled-name='strstr' filepath='/usr/include/string.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efidp_make_nvme' mangled-name='efidp_make_nvme' filepath='src/include/efivar/efivar-dp.h' line='655' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efidp_make_pci' mangled-name='efidp_make_pci' filepath='src/include/efivar/efivar-dp.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efidp_make_emmc' mangled-name='efidp_make_emmc' filepath='src/include/efivar/efivar-dp.h' line='695' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efidp_make_sata' mangled-name='efidp_make_sata' filepath='src/include/efivar/efivar-dp.h' line='428' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='opendir' mangled-name='opendir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='closedir' mangled-name='closedir' filepath='/usr/include/dirent.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='readdir' mangled-name='readdir' filepath='/usr/include/dirent.h' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efidp_make_nvdimm' mangled-name='efidp_make_nvdimm' filepath='src/include/efivar/efivar-dp.h' line='719' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efi_str_to_guid' mangled-name='efi_str_to_guid' filepath='src/include/efivar/efivar.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='getenv' mangled-name='getenv' filepath='/usr/include/stdlib.h' line='634' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efidp_make_sas' mangled-name='efidp_make_sas' filepath='src/include/efivar/efivar-dp.h' line='579' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='ioctl' mangled-name='ioctl' filepath='/usr/include/sys/ioctl.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='strncpy' mangled-name='strncpy' filepath='/usr/include/string.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='socket' mangled-name='socket' filepath='/usr/include/sys/socket.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efidp_make_mac_addr' mangled-name='efidp_make_mac_addr' filepath='src/include/efivar/efivar-dp.h' line='443' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='__fxstat' mangled-name='__fxstat' filepath='/usr/include/sys/stat.h' line='395' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='__ctype_b_loc' mangled-name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='printf' mangled-name='printf' filepath='/usr/include/stdio.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='uname' mangled-name='uname' filepath='/usr/include/sys/utsname.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='strerror' mangled-name='strerror' filepath='/usr/include/string.h' line='396' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='posix_memalign' mangled-name='posix_memalign' filepath='/usr/include/stdlib.h' line='580' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='lseek' mangled-name='lseek' filepath='/usr/include/unistd.h' line='334' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='gettimeofday' mangled-name='gettimeofday' filepath='/usr/include/sys/time.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='write' mangled-name='write' filepath='/usr/include/unistd.h' line='366' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efi_error_clear' mangled-name='efi_error_clear' filepath='src/include/efivar/efivar.h' line='189' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efidp_make_hd' mangled-name='efidp_make_hd' filepath='src/include/efivar/efivar-dp.h' line='735' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efidp_make_file' mangled-name='efidp_make_file' filepath='src/include/efivar/efivar-dp.h' line='771' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efidp_make_generic' mangled-name='efidp_make_generic' filepath='src/include/efivar/efivar-dp.h' line='1250' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efidp_make_edd10' mangled-name='efidp_make_edd10' filepath='src/include/efivar/efivar-dp.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='fileno' mangled-name='fileno' filepath='/usr/include/stdio.h' line='786' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='fclose' mangled-name='fclose' filepath='/usr/include/stdio.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='fread' mangled-name='fread' filepath='/usr/include/stdio.h' line='646' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-decl name='efidp_make_ipv4' mangled-name='efidp_make_ipv4' filepath='src/include/efivar/efivar-dp.h' line='462' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-168'/>
+    </function-decl>
+    <function-type size-in-bits='64' id='type-id-218'>
+      <parameter type-id='type-id-215'/>
+      <return type-id='type-id-24'/>
+    </function-type>
+    <function-type size-in-bits='64' id='type-id-216'>
+      <parameter type-id='type-id-215'/>
+      <parameter type-id='type-id-171'/>
+      <parameter type-id='type-id-171'/>
+      <return type-id='type-id-18'/>
+    </function-type>
+    <function-type size-in-bits='64' id='type-id-217'>
+      <parameter type-id='type-id-215'/>
+      <parameter type-id='type-id-22'/>
+      <parameter type-id='type-id-18'/>
+      <parameter type-id='type-id-18'/>
+      <return type-id='type-id-18'/>
+    </function-type>
   </abi-instr>
 </abi-corpus>
diff --git a/src/libefivar.abixml b/src/libefivar.abixml
index 1a075f262ec..b54c2e3c77b 100644
--- a/src/libefivar.abixml
+++ b/src/libefivar.abixml
@@ -52,6 +52,7 @@
     <elf-symbol name='efidp_make_acpi_hid_ex' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='efidp_make_atapi' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='efidp_make_edd10' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
+    <elf-symbol name='efidp_make_emmc' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='efidp_make_file' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='efidp_make_generic' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='efidp_make_hd' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
@@ -107,1017 +108,929 @@
     <elf-symbol name='efi_well_known_guids' size='18480' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='efi_well_known_guids_end' size='1' version='libefivar.so.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
   </elf-variable-symbols>
-  <abi-instr version='1.0' address-size='64' path='efivarfs.c' comp-dir-path='src' language='LANG_C99'>
-    <class-decl name='efi_var_operations' size-in-bits='2624' is-struct='yes' visibility='default' filepath='src/lib.h' line='29' column='1' id='type-id-1'>
-      <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='name' type-id='type-id-2' visibility='default' filepath='src/lib.h' line='30' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='2048'>
-        <var-decl name='probe' type-id='type-id-3' visibility='default' filepath='src/lib.h' line='31' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='2112'>
-        <var-decl name='set_variable' type-id='type-id-4' visibility='default' filepath='src/lib.h' line='32' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='2176'>
-        <var-decl name='del_variable' type-id='type-id-5' visibility='default' filepath='src/lib.h' line='34' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='2240'>
-        <var-decl name='get_variable' type-id='type-id-6' visibility='default' filepath='src/lib.h' line='35' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='2304'>
-        <var-decl name='get_variable_attributes' type-id='type-id-7' visibility='default' filepath='src/lib.h' line='37' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='2368'>
-        <var-decl name='get_variable_size' type-id='type-id-8' visibility='default' filepath='src/lib.h' line='39' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='2432'>
-        <var-decl name='get_next_variable_name' type-id='type-id-9' visibility='default' filepath='src/lib.h' line='41' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='2496'>
-        <var-decl name='append_variable' type-id='type-id-10' visibility='default' filepath='src/lib.h' line='42' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='2560'>
-        <var-decl name='chmod_variable' type-id='type-id-11' visibility='default' filepath='src/lib.h' line='45' column='1'/>
-      </data-member>
-    </class-decl>
-    <type-decl name='char' size-in-bits='8' id='type-id-12'/>
-    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-13'/>
-
-    <array-type-def dimensions='1' type-id='type-id-12' size-in-bits='2040' id='type-id-2'>
-      <subrange length='255' type-id='type-id-13' id='type-id-14'/>
-
-    </array-type-def>
-    <type-decl name='int' size-in-bits='32' id='type-id-15'/>
-    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-3'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-17' visibility='default' filepath='src/include/efivar/efivar.h' line='33' column='1' id='type-id-18'>
+  <abi-instr version='1.0' address-size='64' path='&lt;artificial&gt;' comp-dir-path='src' language='LANG_C99'>
+    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
+    <function-decl name='efi_variables_supported' mangled-name='efi_variables_supported' filepath='/usr/include/sys/ioctl.h' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variables_supported@@libefivar.so.0'>
+      <return type-id='type-id-1'/>
+    </function-decl>
+    <type-decl name='void' id='type-id-2'/>
+    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-3'/>
+    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-4'/>
+    <function-decl name='efi_guid_cmp' mangled-name='efi_guid_cmp' filepath='/usr/include/dirent.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_cmp@@LIBEFIVAR_0.24'>
+      <parameter type-id='type-id-4' name='a' filepath='/usr/include/dirent.h' line='34' column='1'/>
+      <parameter type-id='type-id-4' name='b' filepath='/usr/include/dirent.h' line='34' column='1'/>
+      <return type-id='type-id-1'/>
+    </function-decl>
+    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-5' visibility='default' filepath='src/include/efivar/efivar.h' line='34' column='1' id='type-id-6'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='a' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar.h' line='34' column='1'/>
+        <var-decl name='a' type-id='type-id-7' visibility='default' filepath='src/include/efivar/efivar.h' line='35' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='b' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar.h' line='35' column='1'/>
+        <var-decl name='b' type-id='type-id-8' visibility='default' filepath='src/include/efivar/efivar.h' line='36' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='c' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar.h' line='36' column='1'/>
+        <var-decl name='c' type-id='type-id-8' visibility='default' filepath='src/include/efivar/efivar.h' line='37' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='d' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar.h' line='37' column='1'/>
+        <var-decl name='d' type-id='type-id-8' visibility='default' filepath='src/include/efivar/efivar.h' line='38' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='80'>
-        <var-decl name='e' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar.h' line='38' column='1'/>
+        <var-decl name='e' type-id='type-id-9' visibility='default' filepath='src/include/efivar/efivar.h' line='39' column='1'/>
       </data-member>
     </class-decl>
-    <type-decl name='unsigned int' size-in-bits='32' id='type-id-22'/>
-    <typedef-decl name='__uint32_t' type-id='type-id-22' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-23'/>
-    <typedef-decl name='uint32_t' type-id='type-id-23' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-19'/>
-    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-24'/>
-    <typedef-decl name='__uint16_t' type-id='type-id-24' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-25'/>
-    <typedef-decl name='uint16_t' type-id='type-id-25' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-20'/>
-    <type-decl name='unsigned char' size-in-bits='8' id='type-id-26'/>
-    <typedef-decl name='__uint8_t' type-id='type-id-26' filepath='/usr/include/bits/types.h' line='37' column='1' id='type-id-27'/>
-    <typedef-decl name='uint8_t' type-id='type-id-27' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-28'/>
+    <type-decl name='unsigned int' size-in-bits='32' id='type-id-10'/>
+    <typedef-decl name='__uint32_t' type-id='type-id-10' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-11'/>
+    <typedef-decl name='uint32_t' type-id='type-id-11' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-7'/>
+    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-12'/>
+    <typedef-decl name='__uint16_t' type-id='type-id-12' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-13'/>
+    <typedef-decl name='uint16_t' type-id='type-id-13' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-8'/>
+    <type-decl name='unsigned char' size-in-bits='8' id='type-id-14'/>
+    <typedef-decl name='__uint8_t' type-id='type-id-14' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-15'/>
+    <typedef-decl name='uint8_t' type-id='type-id-15' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-16'/>
+    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-17'/>
 
-    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='48' id='type-id-21'>
-      <subrange length='6' type-id='type-id-13' id='type-id-29'/>
+    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='48' id='type-id-9'>
+      <subrange length='6' type-id='type-id-17' id='type-id-18'/>
 
     </array-type-def>
-    <typedef-decl name='efi_guid_t' type-id='type-id-18' filepath='src/include/efivar/efivar.h' line='39' column='1' id='type-id-17'/>
-    <qualified-type-def type-id='type-id-12' const='yes' id='type-id-30'/>
-    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-31'/>
-    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-32'/>
-    <typedef-decl name='size_t' type-id='type-id-13' filepath='/usr/lib/gcc/x86_64-redhat-linux/8/include/stddef.h' line='216' column='1' id='type-id-33'/>
-    <typedef-decl name='__mode_t' type-id='type-id-22' filepath='/usr/include/bits/types.h' line='148' column='1' id='type-id-34'/>
-    <typedef-decl name='mode_t' type-id='type-id-34' filepath='/usr/include/fcntl.h' line='50' column='1' id='type-id-35'/>
-    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-4'/>
-    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-5'/>
-    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-38'/>
-    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-39'/>
-    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-40'/>
-    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-6'/>
-    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-7'/>
-    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-8'/>
-    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-44'/>
-    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-45'/>
-    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-46'/>
-    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-47'/>
-    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-9'/>
-    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-10'/>
-    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-11'/>
-    <var-decl name='efivarfs_ops' type-id='type-id-1' visibility='default' filepath='src/lib.h' line='51' column='1'/>
-    <function-type size-in-bits='64' id='type-id-16'>
-      <return type-id='type-id-15'/>
-    </function-type>
-    <function-type size-in-bits='64' id='type-id-48'>
-      <parameter type-id='type-id-45'/>
-      <parameter type-id='type-id-47'/>
-      <return type-id='type-id-15'/>
-    </function-type>
-    <function-type size-in-bits='64' id='type-id-37'>
-      <parameter type-id='type-id-17'/>
-      <parameter type-id='type-id-31'/>
-      <return type-id='type-id-15'/>
-    </function-type>
-    <function-type size-in-bits='64' id='type-id-43'>
-      <parameter type-id='type-id-17'/>
-      <parameter type-id='type-id-31'/>
-      <parameter type-id='type-id-39'/>
-      <return type-id='type-id-15'/>
-    </function-type>
-    <function-type size-in-bits='64' id='type-id-50'>
-      <parameter type-id='type-id-17'/>
-      <parameter type-id='type-id-31'/>
-      <parameter type-id='type-id-35'/>
-      <return type-id='type-id-15'/>
-    </function-type>
-    <function-type size-in-bits='64' id='type-id-42'>
-      <parameter type-id='type-id-17'/>
-      <parameter type-id='type-id-31'/>
-      <parameter type-id='type-id-40'/>
-      <return type-id='type-id-15'/>
-    </function-type>
-    <function-type size-in-bits='64' id='type-id-41'>
-      <parameter type-id='type-id-17'/>
-      <parameter type-id='type-id-31'/>
-      <parameter type-id='type-id-38'/>
-      <parameter type-id='type-id-39'/>
-      <parameter type-id='type-id-40'/>
-      <return type-id='type-id-15'/>
-    </function-type>
-    <function-type size-in-bits='64' id='type-id-49'>
-      <parameter type-id='type-id-17'/>
-      <parameter type-id='type-id-31'/>
-      <parameter type-id='type-id-32'/>
-      <parameter type-id='type-id-33'/>
-      <parameter type-id='type-id-19'/>
-      <return type-id='type-id-15'/>
-    </function-type>
-    <function-type size-in-bits='64' id='type-id-36'>
-      <parameter type-id='type-id-17'/>
-      <parameter type-id='type-id-31'/>
-      <parameter type-id='type-id-32'/>
-      <parameter type-id='type-id-33'/>
-      <parameter type-id='type-id-19'/>
-      <parameter type-id='type-id-35'/>
-      <return type-id='type-id-15'/>
-    </function-type>
-  </abi-instr>
-  <abi-instr version='1.0' address-size='64' path='guid-symbols.c' comp-dir-path='src' language='LANG_C99'>
-    <qualified-type-def type-id='type-id-17' const='yes' id='type-id-51'/>
-    <var-decl name='efi_guid_empty' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='4' column='1'/>
-    <var-decl name='efi_guid_zero' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='5' column='1'/>
-    <var-decl name='efi_guid_sha512' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='6' column='1'/>
-    <var-decl name='efi_guid_redhat' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='7' column='1'/>
-    <var-decl name='efi_guid_fwupdate' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='8' column='1'/>
-    <var-decl name='efi_guid_sha224' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='9' column='1'/>
-    <var-decl name='efi_guid_lenovo_boot_menu' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='10' column='1'/>
-    <var-decl name='efi_guid_ux_capsule' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='11' column='1'/>
-    <var-decl name='efi_guid_x509_sha256' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='12' column='1'/>
-    <var-decl name='efi_guid_rsa2048' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='13' column='1'/>
-    <var-decl name='efi_guid_lenovo' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='14' column='1'/>
-    <var-decl name='efi_guid_lenovo_diag' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='15' column='1'/>
-    <var-decl name='efi_guid_x509_sha512' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='16' column='1'/>
-    <var-decl name='efi_guid_external_management' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='17' column='1'/>
-    <var-decl name='efi_guid_pkcs7_cert' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='18' column='1'/>
-    <var-decl name='efi_guid_shim' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='19' column='1'/>
-    <var-decl name='efi_guid_lenovo_rescue' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='20' column='1'/>
-    <var-decl name='efi_guid_rsa2048_sha1' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='21' column='1'/>
-    <var-decl name='efi_guid_x509_sha384' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='22' column='1'/>
-    <var-decl name='efi_guid_lenovo_setup' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='23' column='1'/>
-    <var-decl name='efi_guid_microsoft' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='24' column='1'/>
-    <var-decl name='efi_guid_lenovo_2' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='25' column='1'/>
-    <var-decl name='efi_guid_sha1' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='26' column='1'/>
-    <var-decl name='efi_guid_lenovo_me_config' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='27' column='1'/>
-    <var-decl name='efi_guid_global' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='28' column='1'/>
-    <var-decl name='efi_guid_x509_cert' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='29' column='1'/>
-    <var-decl name='efi_guid_rsa2048_sha256_cert' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='30' column='1'/>
-    <var-decl name='efi_guid_lenovo_diag_splash' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='31' column='1'/>
-    <var-decl name='efi_guid_redhat_2' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='32' column='1'/>
-    <var-decl name='efi_guid_lenovo_msg' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='33' column='1'/>
-    <var-decl name='efi_guid_sha256' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='34' column='1'/>
-    <var-decl name='efi_guid_shell' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='35' column='1'/>
-    <var-decl name='efi_guid_security' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='36' column='1'/>
-    <var-decl name='efi_guid_rsa2048_sha256' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='37' column='1'/>
-    <var-decl name='efi_guid_sha384' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='38' column='1'/>
-    <var-decl name='efi_guid_lenovo_startup_interrupt' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-guids.h' line='39' column='1'/>
-  </abi-instr>
-  <abi-instr version='1.0' address-size='64' path='vars.c' comp-dir-path='src' language='LANG_C99'>
-    <var-decl name='vars_ops' type-id='type-id-1' visibility='default' filepath='src/lib.h' line='50' column='1'/>
-  </abi-instr>
-  <abi-instr version='1.0' address-size='64' path='&lt;artificial&gt;' comp-dir-path='src' language='LANG_C99'>
-    <function-decl name='efi_variables_supported' mangled-name='efi_variables_supported' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variables_supported@@libefivar.so.0'>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_chmod_variable' mangled-name='efi_chmod_variable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_chmod_variable@@libefivar.so.0'>
-      <parameter type-id='type-id-17' name='guid'/>
-      <parameter type-id='type-id-31' name='name'/>
-      <parameter type-id='type-id-35' name='mode'/>
-      <parameter type-id='type-id-17' name='guid'/>
-      <parameter type-id='type-id-31' name='name'/>
-      <parameter type-id='type-id-35' name='mode'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_get_next_variable_name' mangled-name='efi_get_next_variable_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_next_variable_name@@libefivar.so.0'>
-      <parameter type-id='type-id-45' name='guid'/>
-      <parameter type-id='type-id-47' name='name'/>
-      <parameter type-id='type-id-45' name='guid'/>
-      <parameter type-id='type-id-47' name='name'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_get_variable_size' mangled-name='efi_get_variable_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_size@@libefivar.so.0'>
-      <parameter type-id='type-id-17' name='guid'/>
-      <parameter type-id='type-id-31' name='name'/>
-      <parameter type-id='type-id-39' name='size'/>
-      <parameter type-id='type-id-17' name='guid'/>
-      <parameter type-id='type-id-31' name='name'/>
-      <parameter type-id='type-id-39' name='size'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_get_variable_exists' mangled-name='efi_get_variable_exists' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_exists@@LIBEFIVAR_1.35'>
-      <parameter type-id='type-id-17' name='guid'/>
-      <parameter type-id='type-id-31' name='name'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_get_variable_attributes' mangled-name='efi_get_variable_attributes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_attributes@@libefivar.so.0'>
-      <parameter type-id='type-id-17' name='guid'/>
-      <parameter type-id='type-id-31' name='name'/>
-      <parameter type-id='type-id-40' name='attributes'/>
-      <parameter type-id='type-id-17' name='guid'/>
-      <parameter type-id='type-id-31' name='name'/>
-      <parameter type-id='type-id-40' name='attributes'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_get_variable' mangled-name='efi_get_variable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable@@libefivar.so.0'>
-      <parameter type-id='type-id-17' name='guid'/>
-      <parameter type-id='type-id-31' name='name'/>
-      <parameter type-id='type-id-38' name='data'/>
-      <parameter type-id='type-id-39' name='data_size'/>
-      <parameter type-id='type-id-40' name='attributes'/>
-      <parameter type-id='type-id-17' name='guid'/>
-      <parameter type-id='type-id-31' name='name'/>
-      <parameter type-id='type-id-38' name='data'/>
-      <parameter type-id='type-id-39' name='data_size'/>
-      <parameter type-id='type-id-40' name='attributes'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_del_variable' mangled-name='efi_del_variable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_del_variable@@libefivar.so.0'>
-      <parameter type-id='type-id-17' name='guid'/>
-      <parameter type-id='type-id-31' name='name'/>
-      <parameter type-id='type-id-17' name='guid'/>
-      <parameter type-id='type-id-31' name='name'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_append_variable' mangled-name='efi_append_variable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_append_variable@@libefivar.so.0'>
-      <parameter type-id='type-id-17' name='guid'/>
-      <parameter type-id='type-id-31' name='name'/>
-      <parameter type-id='type-id-32' name='data'/>
-      <parameter type-id='type-id-33' name='data_size'/>
-      <parameter type-id='type-id-19' name='attributes'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='_efi_set_variable_mode' mangled-name='efi_set_variable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_variable@@LIBEFIVAR_0.24'>
-      <parameter type-id='type-id-17' name='guid'/>
-      <parameter type-id='type-id-31' name='name'/>
-      <parameter type-id='type-id-32' name='data'/>
-      <parameter type-id='type-id-33' name='data_size'/>
-      <parameter type-id='type-id-19' name='attributes'/>
-      <parameter type-id='type-id-35' name='mode'/>
-      <parameter type-id='type-id-17' name='guid'/>
-      <parameter type-id='type-id-31' name='name'/>
-      <parameter type-id='type-id-32' name='data'/>
-      <parameter type-id='type-id-33' name='data_size'/>
-      <parameter type-id='type-id-19' name='attributes'/>
-      <parameter type-id='type-id-35' name='mode'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='_efi_set_variable_variadic' mangled-name='_efi_set_variable_variadic' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_efi_set_variable_variadic@@libefivar.so.0'>
-      <parameter type-id='type-id-17' name='guid'/>
-      <parameter type-id='type-id-31' name='name'/>
-      <parameter type-id='type-id-32' name='data'/>
-      <parameter type-id='type-id-33' name='data_size'/>
-      <parameter type-id='type-id-19' name='attributes'/>
-      <parameter type-id='type-id-17' name='guid'/>
-      <parameter type-id='type-id-31' name='name'/>
-      <parameter type-id='type-id-32' name='data'/>
-      <parameter type-id='type-id-33' name='data_size'/>
-      <parameter type-id='type-id-19' name='attributes'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='_efi_set_variable' mangled-name='_efi_set_variable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_efi_set_variable@libefivar.so.0'>
-      <parameter type-id='type-id-17' name='guid'/>
-      <parameter type-id='type-id-31' name='name'/>
-      <parameter type-id='type-id-32' name='data'/>
-      <parameter type-id='type-id-33' name='data_size'/>
-      <parameter type-id='type-id-19' name='attributes'/>
-      <parameter type-id='type-id-17' name='guid'/>
-      <parameter type-id='type-id-31' name='name'/>
-      <parameter type-id='type-id-32' name='data'/>
-      <parameter type-id='type-id-33' name='data_size'/>
-      <parameter type-id='type-id-19' name='attributes'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_name_to_guid' mangled-name='efi_name_to_guid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_name_to_guid@@libefivar.so.0'>
-      <parameter type-id='type-id-31' name='name'/>
-      <parameter type-id='type-id-44' name='guid'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-52'/>
-    <function-decl name='efi_guid_to_id_guid' mangled-name='efi_guid_to_id_guid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_id_guid@@libefivar.so.0'>
-      <parameter type-id='type-id-52' name='guid'/>
-      <parameter type-id='type-id-47' name='sp'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_guid_to_symbol' mangled-name='efi_guid_to_symbol' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_symbol@@libefivar.so.0'>
-      <parameter type-id='type-id-44' name='guid'/>
-      <parameter type-id='type-id-47' name='symbol'/>
-      <parameter type-id='type-id-44' name='guid'/>
-      <parameter type-id='type-id-47' name='symbol'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_guid_to_name' mangled-name='efi_guid_to_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_name@@libefivar.so.0'>
-      <parameter type-id='type-id-44' name='guid'/>
-      <parameter type-id='type-id-47' name='symbol'/>
-      <parameter type-id='type-id-44' name='guid'/>
-      <parameter type-id='type-id-47' name='symbol'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_guid_to_str' mangled-name='efi_guid_to_str' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_str@@libefivar.so.0'>
-      <parameter type-id='type-id-52' name='guid'/>
-      <parameter type-id='type-id-47' name='sp'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_str_to_guid' mangled-name='efi_str_to_guid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_str_to_guid@@libefivar.so.0'>
-      <parameter type-id='type-id-31' name='s'/>
-      <parameter type-id='type-id-44' name='guid'/>
-      <parameter type-id='type-id-31' name='s'/>
-      <parameter type-id='type-id-44' name='guid'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_guid_is_zero' mangled-name='efi_guid_is_empty' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_is_empty@@libefivar.so.0'>
-      <parameter type-id='type-id-52' name='guid'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_guid_cmp' mangled-name='efi_guid_cmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_cmp@@LIBEFIVAR_0.24'>
-      <parameter type-id='type-id-52' name='a'/>
-      <parameter type-id='type-id-52' name='b'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <class-decl name='efi_variable' size-in-bits='320' is-struct='yes' visibility='default' filepath='src/export.c' line='35' column='1' id='type-id-53'>
+    <typedef-decl name='efi_guid_t' type-id='type-id-6' filepath='src/include/efivar/efivar.h' line='40' column='1' id='type-id-5'/>
+    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-19'/>
+    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-20'/>
+    <function-decl name='efi_guid_is_zero' mangled-name='efi_guid_is_empty' filepath='/usr/include/dirent.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_is_empty@@libefivar.so.0'>
+      <parameter type-id='type-id-20' name='guid' filepath='/usr/include/dirent.h' line='40' column='1'/>
+      <return type-id='type-id-1'/>
+    </function-decl>
+    <class-decl name='efi_variable' size-in-bits='320' is-struct='yes' visibility='default' filepath='src/export.c' line='35' column='1' id='type-id-21'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='attrs' type-id='type-id-54' visibility='default' filepath='src/export.c' line='36' column='1'/>
+        <var-decl name='attrs' type-id='type-id-22' visibility='default' filepath='src/export.c' line='36' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='guid' type-id='type-id-44' visibility='default' filepath='src/export.c' line='37' column='1'/>
+        <var-decl name='guid' type-id='type-id-23' visibility='default' filepath='src/export.c' line='37' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='name' type-id='type-id-46' visibility='default' filepath='src/export.c' line='38' column='1'/>
+        <var-decl name='name' type-id='type-id-24' visibility='default' filepath='src/export.c' line='38' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='data' type-id='type-id-32' visibility='default' filepath='src/export.c' line='39' column='1'/>
+        <var-decl name='data' type-id='type-id-25' visibility='default' filepath='src/export.c' line='39' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='data_size' type-id='type-id-33' visibility='default' filepath='src/export.c' line='40' column='1'/>
+        <var-decl name='data_size' type-id='type-id-26' visibility='default' filepath='src/export.c' line='40' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='__uint64_t' type-id='type-id-13' filepath='/usr/include/bits/types.h' line='44' column='1' id='type-id-55'/>
-    <typedef-decl name='uint64_t' type-id='type-id-55' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-54'/>
-    <typedef-decl name='efi_variable_t' type-id='type-id-53' filepath='src/include/efivar/efivar.h' line='133' column='1' id='type-id-56'/>
-    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-57'/>
-    <function-decl name='efi_variable_realize' mangled-name='efi_variable_realize' filepath='src/include/efivar/efivar-dp.h' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_realize@@libefivar.so.0'>
-      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='318' column='1'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-58'/>
-    <function-decl name='efi_variable_get_attributes' mangled-name='efi_variable_get_attributes' filepath='src/include/efivar/efivar-dp.h' line='306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_attributes@@libefivar.so.0'>
-      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='306' column='1'/>
-      <parameter type-id='type-id-58' name='attrs' filepath='src/include/efivar/efivar-dp.h' line='306' column='1'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_variable_get_guid' mangled-name='efi_variable_get_guid' filepath='src/include/efivar/efivar-dp.h' line='261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_guid@@libefivar.so.0'>
-      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='261' column='1'/>
-      <parameter type-id='type-id-45' name='guid' filepath='src/include/efivar/efivar-dp.h' line='261' column='1'/>
-      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='261' column='1'/>
-      <parameter type-id='type-id-45' name='guid' filepath='src/include/efivar/efivar-dp.h' line='261' column='1'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_variable_set_attributes' mangled-name='efi_variable_set_attributes' filepath='src/include/efivar/efivar-dp.h' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_attributes@@libefivar.so.0'>
-      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='299' column='1'/>
-      <parameter type-id='type-id-54' name='attrs' filepath='src/include/efivar/efivar-dp.h' line='299' column='1'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <type-decl name='long int' size-in-bits='64' id='type-id-59'/>
-    <typedef-decl name='__ssize_t' type-id='type-id-59' filepath='/usr/include/bits/types.h' line='191' column='1' id='type-id-60'/>
-    <typedef-decl name='ssize_t' type-id='type-id-60' filepath='/usr/include/sys/types.h' line='108' column='1' id='type-id-61'/>
-    <function-decl name='efi_variable_get_data' mangled-name='efi_variable_get_data' filepath='src/include/efivar/efivar-dp.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_data@@libefivar.so.0'>
-      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='286' column='1'/>
-      <parameter type-id='type-id-38' name='data' filepath='src/include/efivar/efivar-dp.h' line='286' column='1'/>
-      <parameter type-id='type-id-39' name='size' filepath='src/include/efivar/efivar-dp.h' line='286' column='1'/>
-      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='286' column='1'/>
-      <parameter type-id='type-id-38' name='data' filepath='src/include/efivar/efivar-dp.h' line='286' column='1'/>
-      <parameter type-id='type-id-39' name='size' filepath='src/include/efivar/efivar-dp.h' line='286' column='1'/>
-      <return type-id='type-id-61'/>
-    </function-decl>
-    <function-decl name='efi_variable_set_data' mangled-name='efi_variable_set_data' filepath='src/include/efivar/efivar-dp.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_data@@libefivar.so.0'>
-      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='273' column='1'/>
-      <parameter type-id='type-id-32' name='data' filepath='src/include/efivar/efivar-dp.h' line='273' column='1'/>
-      <parameter type-id='type-id-33' name='size' filepath='src/include/efivar/efivar-dp.h' line='273' column='1'/>
-      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='273' column='1'/>
-      <parameter type-id='type-id-32' name='data' filepath='src/include/efivar/efivar-dp.h' line='273' column='1'/>
-      <parameter type-id='type-id-33' name='size' filepath='src/include/efivar/efivar-dp.h' line='273' column='1'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_variable_set_guid' mangled-name='efi_variable_set_guid' filepath='src/include/efivar/efivar-dp.h' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_guid@@libefivar.so.0'>
-      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='254' column='1'/>
-      <parameter type-id='type-id-44' name='guid' filepath='src/include/efivar/efivar-dp.h' line='254' column='1'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <function-decl name='efi_variable_get_name' mangled-name='efi_variable_get_name' filepath='src/include/efivar/efivar-dp.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_name@@libefivar.so.0'>
-      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='243' column='1'/>
-      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='243' column='1'/>
-      <return type-id='type-id-46'/>
-    </function-decl>
-    <function-decl name='efi_variable_set_name' mangled-name='efi_variable_set_name' filepath='src/include/efivar/efivar-dp.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_name@@libefivar.so.0'>
-      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='236' column='1'/>
-      <parameter type-id='type-id-46' name='name' filepath='src/include/efivar/efivar-dp.h' line='236' column='1'/>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <type-decl name='void' id='type-id-62'/>
-    <function-decl name='efi_variable_free' mangled-name='efi_variable_free' filepath='src/include/efivar/efivar-dp.h' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_free@@libefivar.so.0'>
-      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='215' column='1'/>
-      <parameter type-id='type-id-15' name='free_data' filepath='src/include/efivar/efivar-dp.h' line='215' column='1'/>
-      <return type-id='type-id-62'/>
-    </function-decl>
-    <function-decl name='efi_variable_export' mangled-name='efi_variable_export' filepath='src/include/efivar/efivar-dp.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_export@@libefivar.so.0'>
-      <parameter type-id='type-id-57' name='var' filepath='src/include/efivar/efivar-dp.h' line='150' column='1'/>
-      <parameter type-id='type-id-32' name='data' filepath='src/include/efivar/efivar-dp.h' line='150' column='1'/>
-      <parameter type-id='type-id-33' name='size' filepath='src/include/efivar/efivar-dp.h' line='150' column='1'/>
-      <return type-id='type-id-61'/>
-    </function-decl>
-    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-63'/>
-    <function-decl name='efi_variable_import' mangled-name='efi_variable_import' filepath='src/include/efivar/efivar-dp.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_import@@libefivar.so.0'>
-      <parameter type-id='type-id-32' name='data' filepath='src/include/efivar/efivar-dp.h' line='58' column='1'/>
-      <parameter type-id='type-id-33' name='size' filepath='src/include/efivar/efivar-dp.h' line='58' column='1'/>
-      <parameter type-id='type-id-63' name='var_out' filepath='src/include/efivar/efivar-dp.h' line='58' column='1'/>
-      <return type-id='type-id-61'/>
-    </function-decl>
-    <function-decl name='efi_get_verbose' mangled-name='efi_get_verbose' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_verbose@@LIBEFIVAR_1.36'>
-      <return type-id='type-id-15'/>
-    </function-decl>
-    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-64'>
+    <typedef-decl name='__uint64_t' type-id='type-id-17' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-27'/>
+    <typedef-decl name='uint64_t' type-id='type-id-27' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-22'/>
+    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-23'/>
+    <type-decl name='char' size-in-bits='8' id='type-id-28'/>
+    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-24'/>
+    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-25'/>
+    <typedef-decl name='size_t' type-id='type-id-17' filepath='/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='209' column='1' id='type-id-26'/>
+    <typedef-decl name='efi_variable_t' type-id='type-id-21' filepath='src/include/efivar/efivar.h' line='134' column='1' id='type-id-29'/>
+    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-30'/>
+    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-31'/>
+    <function-decl name='efi_variable_get_attributes' mangled-name='efi_variable_get_attributes' filepath='/usr/include/stdio.h' line='306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_attributes@@libefivar.so.0'>
+      <parameter type-id='type-id-30' name='var' filepath='/usr/include/stdio.h' line='306' column='1'/>
+      <parameter type-id='type-id-31' name='attrs' filepath='/usr/include/stdio.h' line='306' column='1'/>
+      <return type-id='type-id-1'/>
+    </function-decl>
+    <function-decl name='efi_variable_set_attributes' mangled-name='efi_variable_set_attributes' filepath='/usr/include/stdio.h' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_attributes@@libefivar.so.0'>
+      <parameter type-id='type-id-30' name='var' filepath='/usr/include/stdio.h' line='299' column='1'/>
+      <parameter type-id='type-id-22' name='attrs' filepath='/usr/include/stdio.h' line='299' column='1'/>
+      <return type-id='type-id-1'/>
+    </function-decl>
+    <type-decl name='long int' size-in-bits='64' id='type-id-32'/>
+    <typedef-decl name='__ssize_t' type-id='type-id-32' filepath='/usr/include/bits/types.h' line='193' column='1' id='type-id-33'/>
+    <typedef-decl name='ssize_t' type-id='type-id-33' filepath='/usr/include/sys/types.h' line='108' column='1' id='type-id-34'/>
+    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-35'/>
+    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-36'/>
+    <function-decl name='efi_variable_get_data' mangled-name='efi_variable_get_data' filepath='/usr/include/stdio.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_data@@libefivar.so.0'>
+      <parameter type-id='type-id-30' name='var' filepath='/usr/include/stdio.h' line='286' column='1'/>
+      <parameter type-id='type-id-35' name='data' filepath='/usr/include/stdio.h' line='286' column='1'/>
+      <parameter type-id='type-id-36' name='size' filepath='/usr/include/stdio.h' line='286' column='1'/>
+      <return type-id='type-id-34'/>
+    </function-decl>
+    <function-decl name='efi_variable_set_data' mangled-name='efi_variable_set_data' filepath='/usr/include/stdio.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_data@@libefivar.so.0'>
+      <parameter type-id='type-id-30' name='var' filepath='/usr/include/stdio.h' line='273' column='1'/>
+      <parameter type-id='type-id-25' name='data' filepath='/usr/include/stdio.h' line='273' column='1'/>
+      <parameter type-id='type-id-26' name='size' filepath='/usr/include/stdio.h' line='273' column='1'/>
+      <return type-id='type-id-1'/>
+    </function-decl>
+    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-37'/>
+    <function-decl name='efi_variable_get_guid' mangled-name='efi_variable_get_guid' filepath='/usr/include/stdio.h' line='261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_get_guid@@libefivar.so.0'>
+      <parameter type-id='type-id-30' name='var' filepath='/usr/include/stdio.h' line='261' column='1'/>
+      <parameter type-id='type-id-37' name='guid' filepath='/usr/include/stdio.h' line='261' column='1'/>
+      <return type-id='type-id-1'/>
+    </function-decl>
+    <function-decl name='efi_variable_set_guid' mangled-name='efi_variable_set_guid' filepath='/usr/include/stdio.h' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variable_set_guid@@libefivar.so.0'>
+      <parameter type-id='type-id-30' name='var' filepath='/usr/include/stdio.h' line='254' column='1'/>
