From cdb840bc122ff1527416becdf1922962c0251df9 Mon Sep 17 00:00:00 2001
From: Peter Jones <pjones@redhat.com>
Date: Fri, 8 Jun 2018 15:14:27 -0400
Subject: [PATCH 29/34] Update abidw for newer tools.

Signed-off-by: Peter Jones <pjones@redhat.com>
---
 src/libefiboot.abixml |   34 +-
 src/libefivar.abixml  | 1026 ++++++++++++++++++++---------------------
 2 files changed, 530 insertions(+), 530 deletions(-)

diff --git a/src/libefiboot.abixml b/src/libefiboot.abixml
index 94d96a2f692..97f030865ed 100644
--- a/src/libefiboot.abixml
+++ b/src/libefiboot.abixml
@@ -21,7 +21,7 @@
     <elf-symbol name='efi_loadopt_path' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='efi_loadopt_pathlen' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
   </elf-function-symbols>
-  <abi-instr version='1.0' address-size='64' path='linux-i2o.c' comp-dir-path='src' language='LANG_C99'>
+  <abi-instr version='1.0' address-size='64' path='linux-sas.c' comp-dir-path='src' language='LANG_C99'>
     <class-decl name='dev_probe' size-in-bits='384' is-struct='yes' visibility='default' filepath='src/linux.h' line='238' column='1' id='type-id-1'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='name' type-id='type-id-2' visibility='default' filepath='src/linux.h' line='239' column='1'/>
@@ -204,12 +204,12 @@
     <typedef-decl name='__off_t' type-id='type-id-13' filepath='/usr/include/bits/types.h' line='140' column='1' id='type-id-33'/>
     <typedef-decl name='__blksize_t' type-id='type-id-13' filepath='/usr/include/bits/types.h' line='162' column='1' id='type-id-34'/>
     <typedef-decl name='__blkcnt_t' type-id='type-id-13' filepath='/usr/include/bits/types.h' line='167' column='1' id='type-id-35'/>
-    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='8' column='1' id='type-id-36'>
+    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='9' column='1' id='type-id-36'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='tv_sec' type-id='type-id-39' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='10' column='1'/>
+        <var-decl name='tv_sec' type-id='type-id-39' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='tv_nsec' type-id='type-id-40' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1'/>
+        <var-decl name='tv_nsec' type-id='type-id-40' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='12' column='1'/>
       </data-member>
     </class-decl>
     <typedef-decl name='__time_t' type-id='type-id-13' filepath='/usr/include/bits/types.h' line='148' column='1' id='type-id-39'/>
@@ -416,7 +416,7 @@
     <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-69'/>
     <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-6'/>
     <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-7'/>
-    <var-decl name='i2o_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='259' column='1'/>
+    <var-decl name='sas_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='255' column='1'/>
     <function-type size-in-bits='64' id='type-id-71'>
       <parameter type-id='type-id-64'/>
       <return type-id='type-id-2'/>
@@ -434,30 +434,30 @@
       <return type-id='type-id-15'/>
     </function-type>
   </abi-instr>
-  <abi-instr version='1.0' address-size='64' path='linux-sas.c' comp-dir-path='src' language='LANG_C99'>
-    <var-decl name='sas_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='255' column='1'/>
-  </abi-instr>
-  <abi-instr version='1.0' address-size='64' path='linux-sata.c' comp-dir-path='src' language='LANG_C99'>
-    <var-decl name='sata_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='256' column='1'/>
-  </abi-instr>
-  <abi-instr version='1.0' address-size='64' path='linux-scsi.c' comp-dir-path='src' language='LANG_C99'>
-    <var-decl name='scsi_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='260' column='1'/>
-  </abi-instr>
   <abi-instr version='1.0' address-size='64' path='linux-virtblk.c' comp-dir-path='src' language='LANG_C99'>
     <var-decl name='virtblk_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='258' column='1'/>
   </abi-instr>
-  <abi-instr version='1.0' address-size='64' path='linux-pmem.c' comp-dir-path='src' language='LANG_C99'>
-    <var-decl name='pmem_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='253' column='1'/>
-  </abi-instr>
   <abi-instr version='1.0' address-size='64' path='linux-ata.c' comp-dir-path='src' language='LANG_C99'>
     <var-decl name='ata_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='261' column='1'/>
   </abi-instr>
+  <abi-instr version='1.0' address-size='64' path='linux-pmem.c' comp-dir-path='src' language='LANG_C99'>
+    <var-decl name='pmem_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='253' column='1'/>
+  </abi-instr>
+  <abi-instr version='1.0' address-size='64' path='linux-sata.c' comp-dir-path='src' language='LANG_C99'>
+    <var-decl name='sata_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='256' column='1'/>
+  </abi-instr>
   <abi-instr version='1.0' address-size='64' path='linux-pci.c' comp-dir-path='src' language='LANG_C99'>
     <var-decl name='pci_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='254' column='1'/>
   </abi-instr>
   <abi-instr version='1.0' address-size='64' path='linux-nvme.c' comp-dir-path='src' language='LANG_C99'>
     <var-decl name='nvme_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='257' column='1'/>
   </abi-instr>
+  <abi-instr version='1.0' address-size='64' path='linux-scsi.c' comp-dir-path='src' language='LANG_C99'>
+    <var-decl name='scsi_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='260' column='1'/>
+  </abi-instr>
+  <abi-instr version='1.0' address-size='64' path='linux-i2o.c' comp-dir-path='src' language='LANG_C99'>
+    <var-decl name='i2o_parser' type-id='type-id-1' visibility='default' filepath='src/linux.h' line='259' column='1'/>
+  </abi-instr>
   <abi-instr version='1.0' address-size='64' path='&lt;artificial&gt;' comp-dir-path='src' language='LANG_C99'>
     <qualified-type-def type-id='type-id-47' const='yes' id='type-id-72'/>
     <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-73'/>
diff --git a/src/libefivar.abixml b/src/libefivar.abixml
index f0137030eb0..bee8bf60efb 100644
--- a/src/libefivar.abixml
+++ b/src/libefivar.abixml
@@ -303,115 +303,115 @@
     <var-decl name='vars_ops' type-id='type-id-1' visibility='default' filepath='src/lib.h' line='50' column='1'/>
   </abi-instr>
   <abi-instr version='1.0' address-size='64' path='&lt;artificial&gt;' comp-dir-path='src' language='LANG_C99'>
-    <function-decl name='efi_variables_supported' mangled-name='efi_variables_supported' filepath='src/dp-acpi.c' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variables_supported@@libefivar.so.0'>
+    <function-decl name='efi_variables_supported' mangled-name='efi_variables_supported' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_variables_supported@@libefivar.so.0'>
       <return type-id='type-id-15'/>
     </function-decl>
-    <function-decl name='efi_chmod_variable' mangled-name='efi_chmod_variable' filepath='src/dp-acpi.c' line='205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_chmod_variable@@libefivar.so.0'>
-      <parameter type-id='type-id-17' name='guid' filepath='src/dp-acpi.c' line='205' column='1'/>
-      <parameter type-id='type-id-31' name='name' filepath='src/dp-acpi.c' line='205' column='1'/>
-      <parameter type-id='type-id-35' name='mode' filepath='src/dp-acpi.c' line='205' column='1'/>
-      <parameter type-id='type-id-17' name='guid' filepath='src/dp-acpi.c' line='205' column='1'/>
-      <parameter type-id='type-id-31' name='name' filepath='src/dp-acpi.c' line='205' column='1'/>
-      <parameter type-id='type-id-35' name='mode' filepath='src/dp-acpi.c' line='205' column='1'/>
+    <function-decl name='efi_chmod_variable' mangled-name='efi_chmod_variable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_chmod_variable@@libefivar.so.0'>
+      <parameter type-id='type-id-17' name='guid'/>
+      <parameter type-id='type-id-31' name='name'/>
+      <parameter type-id='type-id-35' name='mode'/>
+      <parameter type-id='type-id-17' name='guid'/>
+      <parameter type-id='type-id-31' name='name'/>
+      <parameter type-id='type-id-35' name='mode'/>
       <return type-id='type-id-15'/>
     </function-decl>
-    <function-decl name='efi_get_next_variable_name' mangled-name='efi_get_next_variable_name' filepath='src/dp-acpi.c' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_next_variable_name@@libefivar.so.0'>
-      <parameter type-id='type-id-45' name='guid' filepath='src/dp-acpi.c' line='188' column='1'/>
-      <parameter type-id='type-id-47' name='name' filepath='src/dp-acpi.c' line='188' column='1'/>
-      <parameter type-id='type-id-45' name='guid' filepath='src/dp-acpi.c' line='188' column='1'/>
-      <parameter type-id='type-id-47' name='name' filepath='src/dp-acpi.c' line='188' column='1'/>
+    <function-decl name='efi_get_next_variable_name' mangled-name='efi_get_next_variable_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_next_variable_name@@libefivar.so.0'>
+      <parameter type-id='type-id-45' name='guid'/>
+      <parameter type-id='type-id-47' name='name'/>
+      <parameter type-id='type-id-45' name='guid'/>
+      <parameter type-id='type-id-47' name='name'/>
       <return type-id='type-id-15'/>
     </function-decl>
-    <function-decl name='efi_get_variable_size' mangled-name='efi_get_variable_size' filepath='src/dp-acpi.c' line='171' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_size@@libefivar.so.0'>
-      <parameter type-id='type-id-17' name='guid' filepath='src/dp-acpi.c' line='171' column='1'/>
-      <parameter type-id='type-id-31' name='name' filepath='src/dp-acpi.c' line='171' column='1'/>
-      <parameter type-id='type-id-39' name='size' filepath='src/dp-acpi.c' line='171' column='1'/>
-      <parameter type-id='type-id-17' name='guid' filepath='src/dp-acpi.c' line='171' column='1'/>
-      <parameter type-id='type-id-31' name='name' filepath='src/dp-acpi.c' line='171' column='1'/>
-      <parameter type-id='type-id-39' name='size' filepath='src/dp-acpi.c' line='171' column='1'/>
+    <function-decl name='efi_get_variable_size' mangled-name='efi_get_variable_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_size@@libefivar.so.0'>
+      <parameter type-id='type-id-17' name='guid'/>
+      <parameter type-id='type-id-31' name='name'/>
+      <parameter type-id='type-id-39' name='size'/>
+      <parameter type-id='type-id-17' name='guid'/>
+      <parameter type-id='type-id-31' name='name'/>
+      <parameter type-id='type-id-39' name='size'/>
       <return type-id='type-id-15'/>
     </function-decl>
-    <function-decl name='efi_get_variable_exists' mangled-name='efi_get_variable_exists' filepath='src/dp-acpi.c' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_exists@@LIBEFIVAR_1.35'>
-      <parameter type-id='type-id-17' name='guid' filepath='src/dp-acpi.c' line='164' column='1'/>
-      <parameter type-id='type-id-31' name='name' filepath='src/dp-acpi.c' line='164' column='1'/>
+    <function-decl name='efi_get_variable_exists' mangled-name='efi_get_variable_exists' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_exists@@LIBEFIVAR_1.35'>
+      <parameter type-id='type-id-17' name='guid'/>
+      <parameter type-id='type-id-31' name='name'/>
       <return type-id='type-id-15'/>
     </function-decl>
-    <function-decl name='efi_get_variable_attributes' mangled-name='efi_get_variable_attributes' filepath='src/dp-acpi.c' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_attributes@@libefivar.so.0'>
-      <parameter type-id='type-id-17' name='guid' filepath='src/dp-acpi.c' line='146' column='1'/>
-      <parameter type-id='type-id-31' name='name' filepath='src/dp-acpi.c' line='146' column='1'/>
-      <parameter type-id='type-id-40' name='attributes' filepath='src/dp-acpi.c' line='147' column='1'/>
-      <parameter type-id='type-id-17' name='guid' filepath='src/dp-acpi.c' line='146' column='1'/>
-      <parameter type-id='type-id-31' name='name' filepath='src/dp-acpi.c' line='146' column='1'/>
-      <parameter type-id='type-id-40' name='attributes' filepath='src/dp-acpi.c' line='147' column='1'/>
+    <function-decl name='efi_get_variable_attributes' mangled-name='efi_get_variable_attributes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable_attributes@@libefivar.so.0'>
+      <parameter type-id='type-id-17' name='guid'/>
+      <parameter type-id='type-id-31' name='name'/>
+      <parameter type-id='type-id-40' name='attributes'/>
+      <parameter type-id='type-id-17' name='guid'/>
+      <parameter type-id='type-id-31' name='name'/>
+      <parameter type-id='type-id-40' name='attributes'/>
       <return type-id='type-id-15'/>
     </function-decl>
-    <function-decl name='efi_get_variable' mangled-name='efi_get_variable' filepath='src/dp-acpi.c' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable@@libefivar.so.0'>
-      <parameter type-id='type-id-17' name='guid' filepath='src/dp-acpi.c' line='128' column='1'/>
-      <parameter type-id='type-id-31' name='name' filepath='src/dp-acpi.c' line='128' column='1'/>
-      <parameter type-id='type-id-38' name='data' filepath='src/dp-acpi.c' line='128' column='1'/>
-      <parameter type-id='type-id-39' name='data_size' filepath='src/dp-acpi.c' line='129' column='1'/>
-      <parameter type-id='type-id-40' name='attributes' filepath='src/dp-acpi.c' line='129' column='1'/>
-      <parameter type-id='type-id-17' name='guid' filepath='src/dp-acpi.c' line='128' column='1'/>
-      <parameter type-id='type-id-31' name='name' filepath='src/dp-acpi.c' line='128' column='1'/>
-      <parameter type-id='type-id-38' name='data' filepath='src/dp-acpi.c' line='128' column='1'/>
-      <parameter type-id='type-id-39' name='data_size' filepath='src/dp-acpi.c' line='129' column='1'/>
-      <parameter type-id='type-id-40' name='attributes' filepath='src/dp-acpi.c' line='129' column='1'/>
+    <function-decl name='efi_get_variable' mangled-name='efi_get_variable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_variable@@libefivar.so.0'>
+      <parameter type-id='type-id-17' name='guid'/>
+      <parameter type-id='type-id-31' name='name'/>
+      <parameter type-id='type-id-38' name='data'/>
+      <parameter type-id='type-id-39' name='data_size'/>
+      <parameter type-id='type-id-40' name='attributes'/>
+      <parameter type-id='type-id-17' name='guid'/>
+      <parameter type-id='type-id-31' name='name'/>
+      <parameter type-id='type-id-38' name='data'/>
+      <parameter type-id='type-id-39' name='data_size'/>
+      <parameter type-id='type-id-40' name='attributes'/>
       <return type-id='type-id-15'/>
     </function-decl>
-    <function-decl name='efi_del_variable' mangled-name='efi_del_variable' filepath='src/dp-acpi.c' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_del_variable@@libefivar.so.0'>
-      <parameter type-id='type-id-17' name='guid' filepath='src/dp-acpi.c' line='111' column='1'/>
-      <parameter type-id='type-id-31' name='name' filepath='src/dp-acpi.c' line='111' column='1'/>
-      <parameter type-id='type-id-17' name='guid' filepath='src/dp-acpi.c' line='111' column='1'/>
-      <parameter type-id='type-id-31' name='name' filepath='src/dp-acpi.c' line='111' column='1'/>
+    <function-decl name='efi_del_variable' mangled-name='efi_del_variable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_del_variable@@libefivar.so.0'>
+      <parameter type-id='type-id-17' name='guid'/>
+      <parameter type-id='type-id-31' name='name'/>
+      <parameter type-id='type-id-17' name='guid'/>
+      <parameter type-id='type-id-31' name='name'/>
       <return type-id='type-id-15'/>
     </function-decl>
-    <function-decl name='efi_append_variable' mangled-name='efi_append_variable' filepath='src/dp-acpi.c' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_append_variable@@libefivar.so.0'>
-      <parameter type-id='type-id-17' name='guid' filepath='src/dp-acpi.c' line='89' column='1'/>
-      <parameter type-id='type-id-31' name='name' filepath='src/dp-acpi.c' line='89' column='1'/>
-      <parameter type-id='type-id-32' name='data' filepath='src/dp-acpi.c' line='89' column='1'/>
-      <parameter type-id='type-id-33' name='data_size' filepath='src/dp-acpi.c' line='90' column='1'/>
-      <parameter type-id='type-id-19' name='attributes' filepath='src/dp-acpi.c' line='90' column='1'/>
+    <function-decl name='efi_append_variable' mangled-name='efi_append_variable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_append_variable@@libefivar.so.0'>
+      <parameter type-id='type-id-17' name='guid'/>
+      <parameter type-id='type-id-31' name='name'/>
+      <parameter type-id='type-id-32' name='data'/>
+      <parameter type-id='type-id-33' name='data_size'/>
+      <parameter type-id='type-id-19' name='attributes'/>
       <return type-id='type-id-15'/>
     </function-decl>
-    <function-decl name='_efi_set_variable_mode' mangled-name='efi_set_variable' filepath='src/dp-acpi.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_variable@@LIBEFIVAR_0.24'>
-      <parameter type-id='type-id-17' name='guid' filepath='src/dp-acpi.c' line='70' column='1'/>
-      <parameter type-id='type-id-31' name='name' filepath='src/dp-acpi.c' line='70' column='1'/>
-      <parameter type-id='type-id-32' name='data' filepath='src/dp-acpi.c' line='70' column='1'/>
-      <parameter type-id='type-id-33' name='data_size' filepath='src/dp-acpi.c' line='71' column='1'/>
-      <parameter type-id='type-id-19' name='attributes' filepath='src/dp-acpi.c' line='71' column='1'/>
-      <parameter type-id='type-id-35' name='mode' filepath='src/dp-acpi.c' line='71' column='1'/>
-      <parameter type-id='type-id-17' name='guid' filepath='src/dp-acpi.c' line='70' column='1'/>
-      <parameter type-id='type-id-31' name='name' filepath='src/dp-acpi.c' line='70' column='1'/>
-      <parameter type-id='type-id-32' name='data' filepath='src/dp-acpi.c' line='70' column='1'/>
-      <parameter type-id='type-id-33' name='data_size' filepath='src/dp-acpi.c' line='71' column='1'/>
-      <parameter type-id='type-id-19' name='attributes' filepath='src/dp-acpi.c' line='71' column='1'/>
-      <parameter type-id='type-id-35' name='mode' filepath='src/dp-acpi.c' line='71' column='1'/>
+    <function-decl name='_efi_set_variable_mode' mangled-name='efi_set_variable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_variable@@LIBEFIVAR_0.24'>
+      <parameter type-id='type-id-17' name='guid'/>
+      <parameter type-id='type-id-31' name='name'/>
+      <parameter type-id='type-id-32' name='data'/>
+      <parameter type-id='type-id-33' name='data_size'/>
+      <parameter type-id='type-id-19' name='attributes'/>
+      <parameter type-id='type-id-35' name='mode'/>
+      <parameter type-id='type-id-17' name='guid'/>
+      <parameter type-id='type-id-31' name='name'/>
+      <parameter type-id='type-id-32' name='data'/>
+      <parameter type-id='type-id-33' name='data_size'/>
+      <parameter type-id='type-id-19' name='attributes'/>
+      <parameter type-id='type-id-35' name='mode'/>
       <return type-id='type-id-15'/>
     </function-decl>
-    <function-decl name='_efi_set_variable_variadic' mangled-name='_efi_set_variable_variadic' filepath='src/dp-acpi.c' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_efi_set_variable_variadic@@libefivar.so.0'>
-      <parameter type-id='type-id-17' name='guid' filepath='src/dp-acpi.c' line='58' column='1'/>
-      <parameter type-id='type-id-31' name='name' filepath='src/dp-acpi.c' line='58' column='1'/>
-      <parameter type-id='type-id-32' name='data' filepath='src/dp-acpi.c' line='58' column='1'/>
-      <parameter type-id='type-id-33' name='data_size' filepath='src/dp-acpi.c' line='59' column='1'/>
-      <parameter type-id='type-id-19' name='attributes' filepath='src/dp-acpi.c' line='59' column='1'/>
-      <parameter type-id='type-id-17' name='guid' filepath='src/dp-acpi.c' line='58' column='1'/>
-      <parameter type-id='type-id-31' name='name' filepath='src/dp-acpi.c' line='58' column='1'/>
-      <parameter type-id='type-id-32' name='data' filepath='src/dp-acpi.c' line='58' column='1'/>
-      <parameter type-id='type-id-33' name='data_size' filepath='src/dp-acpi.c' line='59' column='1'/>
-      <parameter type-id='type-id-19' name='attributes' filepath='src/dp-acpi.c' line='59' column='1'/>
+    <function-decl name='_efi_set_variable_variadic' mangled-name='_efi_set_variable_variadic' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_efi_set_variable_variadic@@libefivar.so.0'>
+      <parameter type-id='type-id-17' name='guid'/>
+      <parameter type-id='type-id-31' name='name'/>
+      <parameter type-id='type-id-32' name='data'/>
+      <parameter type-id='type-id-33' name='data_size'/>
+      <parameter type-id='type-id-19' name='attributes'/>
+      <parameter type-id='type-id-17' name='guid'/>
+      <parameter type-id='type-id-31' name='name'/>
+      <parameter type-id='type-id-32' name='data'/>
+      <parameter type-id='type-id-33' name='data_size'/>
+      <parameter type-id='type-id-19' name='attributes'/>
       <return type-id='type-id-15'/>
     </function-decl>
-    <function-decl name='_efi_set_variable' mangled-name='_efi_set_variable' filepath='src/dp-acpi.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_efi_set_variable@libefivar.so.0'>
-      <parameter type-id='type-id-17' name='guid' filepath='src/dp-acpi.c' line='58' column='1'/>
-      <parameter type-id='type-id-31' name='name' filepath='src/dp-acpi.c' line='58' column='1'/>
-      <parameter type-id='type-id-32' name='data' filepath='src/dp-acpi.c' line='58' column='1'/>
-      <parameter type-id='type-id-33' name='data_size' filepath='src/dp-acpi.c' line='59' column='1'/>
-      <parameter type-id='type-id-19' name='attributes' filepath='src/dp-acpi.c' line='59' column='1'/>
-      <parameter type-id='type-id-17' name='guid' filepath='src/dp-acpi.c' line='58' column='1'/>
-      <parameter type-id='type-id-31' name='name' filepath='src/dp-acpi.c' line='58' column='1'/>
-      <parameter type-id='type-id-32' name='data' filepath='src/dp-acpi.c' line='58' column='1'/>
-      <parameter type-id='type-id-33' name='data_size' filepath='src/dp-acpi.c' line='59' column='1'/>
-      <parameter type-id='type-id-19' name='attributes' filepath='src/dp-acpi.c' line='59' column='1'/>
+    <function-decl name='_efi_set_variable' mangled-name='_efi_set_variable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_efi_set_variable@libefivar.so.0'>
+      <parameter type-id='type-id-17' name='guid'/>
+      <parameter type-id='type-id-31' name='name'/>
+      <parameter type-id='type-id-32' name='data'/>
+      <parameter type-id='type-id-33' name='data_size'/>
+      <parameter type-id='type-id-19' name='attributes'/>
+      <parameter type-id='type-id-17' name='guid'/>
+      <parameter type-id='type-id-31' name='name'/>
+      <parameter type-id='type-id-32' name='data'/>
+      <parameter type-id='type-id-33' name='data_size'/>
+      <parameter type-id='type-id-19' name='attributes'/>
       <return type-id='type-id-15'/>
     </function-decl>
     <function-decl name='efi_name_to_guid' mangled-name='efi_name_to_guid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_name_to_guid@@libefivar.so.0'>
@@ -810,261 +810,294 @@
       <parameter type-id='type-id-61' name='mac_addr_size'/>
       <return type-id='type-id-61'/>
     </function-decl>
-    <function-decl name='efidp_make_hd' mangled-name='efidp_make_hd' filepath='src/&lt;built-in&gt;' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_hd@@libefivar.so.0'>
-      <parameter type-id='type-id-32' name='buf' filepath='src/&lt;built-in&gt;' line='178' column='1'/>
-      <parameter type-id='type-id-61' name='size' filepath='src/&lt;built-in&gt;' line='178' column='1'/>
-      <parameter type-id='type-id-19' name='num' filepath='src/&lt;built-in&gt;' line='178' column='1'/>
-      <parameter type-id='type-id-54' name='part_start' filepath='src/&lt;built-in&gt;' line='178' column='1'/>
-      <parameter type-id='type-id-54' name='part_size' filepath='src/&lt;built-in&gt;' line='179' column='1'/>
-      <parameter type-id='type-id-32' name='signature' filepath='src/&lt;built-in&gt;' line='179' column='1'/>
-      <parameter type-id='type-id-28' name='format' filepath='src/&lt;built-in&gt;' line='179' column='1'/>
-      <parameter type-id='type-id-28' name='signature_type' filepath='src/&lt;built-in&gt;' line='180' column='1'/>
-      <parameter type-id='type-id-32' name='buf' filepath='src/&lt;built-in&gt;' line='178' column='1'/>
-      <parameter type-id='type-id-61' name='size' filepath='src/&lt;built-in&gt;' line='178' column='1'/>
-      <parameter type-id='type-id-19' name='num' filepath='src/&lt;built-in&gt;' line='178' column='1'/>
-      <parameter type-id='type-id-54' name='part_start' filepath='src/&lt;built-in&gt;' line='178' column='1'/>
-      <parameter type-id='type-id-54' name='part_size' filepath='src/&lt;built-in&gt;' line='179' column='1'/>
-      <parameter type-id='type-id-32' name='signature' filepath='src/&lt;built-in&gt;' line='179' column='1'/>
-      <parameter type-id='type-id-28' name='format' filepath='src/&lt;built-in&gt;' line='179' column='1'/>
-      <parameter type-id='type-id-28' name='signature_type' filepath='src/&lt;built-in&gt;' line='180' column='1'/>
+    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-86'/>
+    <var-decl name='ops' type-id='type-id-86' visibility='default' filepath='src/lib.c' line='43' column='1'/>
+    <var-decl name='default_ops' type-id='type-id-1' visibility='default' filepath='src/lib.c' line='38' column='1'/>
+    <class-decl name='guidname' size-in-bits='4224' is-struct='yes' visibility='default' filepath='src/guid.h' line='181' column='1' id='type-id-87'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <var-decl name='guid' type-id='type-id-17' visibility='default' filepath='src/guid.h' line='182' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='128'>
+        <var-decl name='symbol' type-id='type-id-88' visibility='default' filepath='src/guid.h' line='183' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='2176'>
+        <var-decl name='name' type-id='type-id-88' visibility='default' filepath='src/guid.h' line='184' column='1'/>
+      </data-member>
+    </class-decl>
+
+    <array-type-def dimensions='1' type-id='type-id-12' size-in-bits='2048' id='type-id-88'>
+      <subrange length='256' type-id='type-id-13' id='type-id-89'/>
+
+    </array-type-def>
+    <var-decl name='efi_well_known_names_end' type-id='type-id-87' visibility='default' filepath='src/guid.c' line='100' column='1'/>
+    <var-decl name='efi_well_known_names' type-id='type-id-87' visibility='default' filepath='src/guid.c' line='98' column='1'/>
+    <var-decl name='efi_well_known_guids_end' type-id='type-id-87' visibility='default' filepath='src/guid.c' line='99' column='1'/>
+    <var-decl name='efi_well_known_guids' type-id='type-id-87' visibility='default' filepath='src/guid.c' line='97' column='1'/>
+    <var-decl name='stderr' type-id='type-id-66' visibility='default' filepath='/usr/include/stdio.h' line='137' column='1'/>
+    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-62'/>
+    </function-decl>
+    <function-decl name='__builtin_calloc' mangled-name='calloc' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-62'/>
+    </function-decl>
+    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64'>
+      <return type-id='type-id-62'/>
+    </function-decl>
+    <function-decl name='efidp_make_hd' mangled-name='efidp_make_hd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_hd@@libefivar.so.0'>
+      <parameter type-id='type-id-32' name='buf'/>
+      <parameter type-id='type-id-61' name='size'/>
+      <parameter type-id='type-id-19' name='num'/>
+      <parameter type-id='type-id-54' name='part_start'/>
+      <parameter type-id='type-id-54' name='part_size'/>
+      <parameter type-id='type-id-32' name='signature'/>
+      <parameter type-id='type-id-28' name='format'/>
+      <parameter type-id='type-id-28' name='signature_type'/>
+      <parameter type-id='type-id-32' name='buf'/>
+      <parameter type-id='type-id-61' name='size'/>
+      <parameter type-id='type-id-19' name='num'/>
+      <parameter type-id='type-id-54' name='part_start'/>
+      <parameter type-id='type-id-54' name='part_size'/>
+      <parameter type-id='type-id-32' name='signature'/>
+      <parameter type-id='type-id-28' name='format'/>
+      <parameter type-id='type-id-28' name='signature_type'/>
       <return type-id='type-id-61'/>
     </function-decl>
-    <function-decl name='efidp_make_file' mangled-name='efidp_make_file' filepath='src/&lt;built-in&gt;' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_file@@libefivar.so.0'>
-      <parameter type-id='type-id-32' name='buf' filepath='src/&lt;built-in&gt;' line='157' column='1'/>
-      <parameter type-id='type-id-61' name='size' filepath='src/&lt;built-in&gt;' line='157' column='1'/>
-      <parameter type-id='type-id-46' name='filepath' filepath='src/&lt;built-in&gt;' line='157' column='1'/>
-      <parameter type-id='type-id-32' name='buf' filepath='src/&lt;built-in&gt;' line='157' column='1'/>
-      <parameter type-id='type-id-61' name='size' filepath='src/&lt;built-in&gt;' line='157' column='1'/>
-      <parameter type-id='type-id-46' name='filepath' filepath='src/&lt;built-in&gt;' line='157' column='1'/>
+    <function-decl name='efidp_make_file' mangled-name='efidp_make_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_file@@libefivar.so.0'>
+      <parameter type-id='type-id-32' name='buf'/>
+      <parameter type-id='type-id-61' name='size'/>
+      <parameter type-id='type-id-46' name='filepath'/>
+      <parameter type-id='type-id-32' name='buf'/>
+      <parameter type-id='type-id-61' name='size'/>
+      <parameter type-id='type-id-46' name='filepath'/>
       <return type-id='type-id-61'/>
     </function-decl>
-    <function-decl name='efidp_make_edd10' mangled-name='efidp_make_edd10' filepath='src/&lt;built-in&gt;' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_edd10@@libefivar.so.0'>
-      <parameter type-id='type-id-32' name='buf' filepath='src/&lt;built-in&gt;' line='105' column='1'/>
-      <parameter type-id='type-id-61' name='size' filepath='src/&lt;built-in&gt;' line='105' column='1'/>
-      <parameter type-id='type-id-19' name='hardware_device' filepath='src/&lt;built-in&gt;' line='105' column='1'/>
-      <parameter type-id='type-id-32' name='buf' filepath='src/&lt;built-in&gt;' line='105' column='1'/>
-      <parameter type-id='type-id-61' name='size' filepath='src/&lt;built-in&gt;' line='105' column='1'/>
-      <parameter type-id='type-id-19' name='hardware_device' filepath='src/&lt;built-in&gt;' line='105' column='1'/>
+    <function-decl name='efidp_make_edd10' mangled-name='efidp_make_edd10' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_edd10@@libefivar.so.0'>
+      <parameter type-id='type-id-32' name='buf'/>
+      <parameter type-id='type-id-61' name='size'/>
+      <parameter type-id='type-id-19' name='hardware_device'/>
+      <parameter type-id='type-id-32' name='buf'/>
+      <parameter type-id='type-id-61' name='size'/>
+      <parameter type-id='type-id-19' name='hardware_device'/>
       <return type-id='type-id-61'/>
     </function-decl>
-    <function-decl name='efidp_make_pci' mangled-name='efidp_make_pci' filepath='src/&lt;built-in&gt;' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_pci@@libefivar.so.0'>
-      <parameter type-id='type-id-32' name='buf' filepath='src/&lt;built-in&gt;' line='86' column='1'/>
-      <parameter type-id='type-id-61' name='size' filepath='src/&lt;built-in&gt;' line='86' column='1'/>
-      <parameter type-id='type-id-28' name='device' filepath='src/&lt;built-in&gt;' line='86' column='1'/>
-      <parameter type-id='type-id-28' name='function' filepath='src/&lt;built-in&gt;' line='86' column='1'/>
-      <parameter type-id='type-id-32' name='buf' filepath='src/&lt;built-in&gt;' line='86' column='1'/>
-      <parameter type-id='type-id-61' name='size' filepath='src/&lt;built-in&gt;' line='86' column='1'/>
-      <parameter type-id='type-id-28' name='device' filepath='src/&lt;built-in&gt;' line='86' column='1'/>
-      <parameter type-id='type-id-28' name='function' filepath='src/&lt;built-in&gt;' line='86' column='1'/>
+    <function-decl name='efidp_make_pci' mangled-name='efidp_make_pci' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_pci@@libefivar.so.0'>
+      <parameter type-id='type-id-32' name='buf'/>
+      <parameter type-id='type-id-61' name='size'/>
+      <parameter type-id='type-id-28' name='device'/>
+      <parameter type-id='type-id-28' name='function'/>
+      <parameter type-id='type-id-32' name='buf'/>
+      <parameter type-id='type-id-61' name='size'/>
+      <parameter type-id='type-id-28' name='device'/>
+      <parameter type-id='type-id-28' name='function'/>
       <return type-id='type-id-61'/>
     </function-decl>
-    <function-decl name='efidp_make_acpi_hid_ex' mangled-name='efidp_make_acpi_hid_ex' filepath='src/&lt;built-in&gt;' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid_ex@@libefivar.so.0'>
-      <parameter type-id='type-id-32' name='buf' filepath='src/&lt;built-in&gt;' line='263' column='1'/>
-      <parameter type-id='type-id-61' name='size' filepath='src/&lt;built-in&gt;' line='263' column='1'/>
-      <parameter type-id='type-id-19' name='hid' filepath='src/&lt;built-in&gt;' line='264' column='1'/>
-      <parameter type-id='type-id-19' name='uid' filepath='src/&lt;built-in&gt;' line='264' column='1'/>
-      <parameter type-id='type-id-19' name='cid' filepath='src/&lt;built-in&gt;' line='264' column='1'/>
-      <parameter type-id='type-id-31' name='hidstr' filepath='src/&lt;built-in&gt;' line='265' column='1'/>
-      <parameter type-id='type-id-31' name='uidstr' filepath='src/&lt;built-in&gt;' line='265' column='1'/>
-      <parameter type-id='type-id-31' name='cidstr' filepath='src/&lt;built-in&gt;' line='266' column='1'/>
+    <function-decl name='efidp_make_acpi_hid_ex' mangled-name='efidp_make_acpi_hid_ex' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid_ex@@libefivar.so.0'>
+      <parameter type-id='type-id-32' name='buf'/>
+      <parameter type-id='type-id-61' name='size'/>
+      <parameter type-id='type-id-19' name='hid'/>
+      <parameter type-id='type-id-19' name='uid'/>
+      <parameter type-id='type-id-19' name='cid'/>
+      <parameter type-id='type-id-31' name='hidstr'/>
+      <parameter type-id='type-id-31' name='uidstr'/>
+      <parameter type-id='type-id-31' name='cidstr'/>
       <return type-id='type-id-61'/>
     </function-decl>
-    <function-decl name='efidp_make_acpi_hid' mangled-name='efidp_make_acpi_hid' filepath='src/&lt;built-in&gt;' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid@@libefivar.so.0'>
-      <parameter type-id='type-id-32' name='buf' filepath='src/&lt;built-in&gt;' line='243' column='1'/>
-      <parameter type-id='type-id-61' name='size' filepath='src/&lt;built-in&gt;' line='243' column='1'/>
-      <parameter type-id='type-id-19' name='hid' filepath='src/&lt;built-in&gt;' line='243' column='1'/>
-      <parameter type-id='type-id-19' name='uid' filepath='src/&lt;built-in&gt;' line='243' column='1'/>
-      <parameter type-id='type-id-32' name='buf' filepath='src/&lt;built-in&gt;' line='243' column='1'/>
-      <parameter type-id='type-id-61' name='size' filepath='src/&lt;built-in&gt;' line='243' column='1'/>
-      <parameter type-id='type-id-19' name='hid' filepath='src/&lt;built-in&gt;' line='243' column='1'/>
-      <parameter type-id='type-id-19' name='uid' filepath='src/&lt;built-in&gt;' line='243' column='1'/>
+    <function-decl name='efidp_make_acpi_hid' mangled-name='efidp_make_acpi_hid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_acpi_hid@@libefivar.so.0'>
+      <parameter type-id='type-id-32' name='buf'/>
+      <parameter type-id='type-id-61' name='size'/>
+      <parameter type-id='type-id-19' name='hid'/>
+      <parameter type-id='type-id-19' name='uid'/>
+      <parameter type-id='type-id-32' name='buf'/>
+      <parameter type-id='type-id-61' name='size'/>
+      <parameter type-id='type-id-19' name='hid'/>
+      <parameter type-id='type-id-19' name='uid'/>
       <return type-id='type-id-61'/>
     </function-decl>
-    <function-decl name='efidp_make_generic' mangled-name='efidp_make_generic' filepath='src/dp-acpi.c' line='439' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_generic@@libefivar.so.0'>
-      <parameter type-id='type-id-32' name='buf' filepath='src/dp-acpi.c' line='439' column='1'/>
-      <parameter type-id='type-id-61' name='size' filepath='src/dp-acpi.c' line='439' column='1'/>
-      <parameter type-id='type-id-28' name='type' filepath='src/dp-acpi.c' line='439' column='1'/>
-      <parameter type-id='type-id-28' name='subtype' filepath='src/dp-acpi.c' line='439' column='1'/>
-      <parameter type-id='type-id-61' name='total_size' filepath='src/dp-acpi.c' line='440' column='1'/>
-      <parameter type-id='type-id-32' name='buf' filepath='src/dp-acpi.c' line='439' column='1'/>
-      <parameter type-id='type-id-61' name='size' filepath='src/dp-acpi.c' line='439' column='1'/>
-      <parameter type-id='type-id-28' name='type' filepath='src/dp-acpi.c' line='439' column='1'/>
-      <parameter type-id='type-id-28' name='subtype' filepath='src/dp-acpi.c' line='439' column='1'/>
-      <parameter type-id='type-id-61' name='total_size' filepath='src/dp-acpi.c' line='440' column='1'/>
+    <function-decl name='efidp_make_generic' mangled-name='efidp_make_generic' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_generic@@libefivar.so.0'>
+      <parameter type-id='type-id-32' name='buf'/>
+      <parameter type-id='type-id-61' name='size'/>
+      <parameter type-id='type-id-28' name='type'/>
+      <parameter type-id='type-id-28' name='subtype'/>
+      <parameter type-id='type-id-61' name='total_size'/>
+      <parameter type-id='type-id-32' name='buf'/>
+      <parameter type-id='type-id-61' name='size'/>
+      <parameter type-id='type-id-28' name='type'/>
+      <parameter type-id='type-id-28' name='subtype'/>
+      <parameter type-id='type-id-61' name='total_size'/>
       <return type-id='type-id-61'/>
     </function-decl>
-    <function-decl name='efidp_make_vendor' mangled-name='efidp_make_vendor' filepath='src/dp-acpi.c' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_vendor@@libefivar.so.0'>
-      <parameter type-id='type-id-32' name='buf' filepath='src/dp-acpi.c' line='423' column='1'/>
-      <parameter type-id='type-id-61' name='size' filepath='src/dp-acpi.c' line='423' column='1'/>
-      <parameter type-id='type-id-28' name='type' filepath='src/dp-acpi.c' line='423' column='1'/>
-      <parameter type-id='type-id-28' name='subtype' filepath='src/dp-acpi.c' line='423' column='1'/>
-      <parameter type-id='type-id-17' name='vendor_guid' filepath='src/dp-acpi.c' line='424' column='1'/>
-      <parameter type-id='type-id-71' name='data' filepath='src/dp-acpi.c' line='424' column='1'/>
-      <parameter type-id='type-id-33' name='data_size' filepath='src/dp-acpi.c' line='424' column='1'/>
+    <function-decl name='efidp_make_vendor' mangled-name='efidp_make_vendor' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_vendor@@libefivar.so.0'>
+      <parameter type-id='type-id-32' name='buf'/>
+      <parameter type-id='type-id-61' name='size'/>
+      <parameter type-id='type-id-28' name='type'/>
+      <parameter type-id='type-id-28' name='subtype'/>
+      <parameter type-id='type-id-17' name='vendor_guid'/>
+      <parameter type-id='type-id-71' name='data'/>
+      <parameter type-id='type-id-33' name='data_size'/>
       <return type-id='type-id-61'/>
     </function-decl>
-    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='833' column='1' id='type-id-86'>
+    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='833' column='1' id='type-id-90'>
       <data-member access='private'>
-        <var-decl name='' type-id='type-id-87' visibility='default'/>
+        <var-decl name='' type-id='type-id-91' visibility='default'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='839' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='839' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='pci' type-id='type-id-89' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='840' column='1'/>
+        <var-decl name='pci' type-id='type-id-93' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='840' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='pccard' type-id='type-id-90' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='841' column='1'/>
+        <var-decl name='pccard' type-id='type-id-94' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='841' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='mmio' type-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='842' column='1'/>
+        <var-decl name='mmio' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='842' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='hw_vendor' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='843' column='1'/>
+        <var-decl name='hw_vendor' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='843' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='controller' type-id='type-id-93' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='844' column='1'/>
+        <var-decl name='controller' type-id='type-id-97' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='844' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='bmc' type-id='type-id-94' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='845' column='1'/>
+        <var-decl name='bmc' type-id='type-id-98' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='845' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='acpi_hid' type-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='846' column='1'/>
+        <var-decl name='acpi_hid' type-id='type-id-99' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='846' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='acpi_hid_ex' type-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='847' column='1'/>
+        <var-decl name='acpi_hid_ex' type-id='type-id-100' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='847' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='acpi_adr' type-id='type-id-97' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='848' column='1'/>
+        <var-decl name='acpi_adr' type-id='type-id-101' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='848' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='atapi' type-id='type-id-98' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='849' column='1'/>
+        <var-decl name='atapi' type-id='type-id-102' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='849' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='scsi' type-id='type-id-99' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='850' column='1'/>
+        <var-decl name='scsi' type-id='type-id-103' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='850' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='fc' type-id='type-id-100' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='851' column='1'/>
+        <var-decl name='fc' type-id='type-id-104' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='851' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='fcex' type-id='type-id-101' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='852' column='1'/>
+        <var-decl name='fcex' type-id='type-id-105' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='852' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='firewire' type-id='type-id-102' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='853' column='1'/>
+        <var-decl name='firewire' type-id='type-id-106' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='853' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='usb' type-id='type-id-103' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='854' column='1'/>
+        <var-decl name='usb' type-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='854' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='usb_class' type-id='type-id-104' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='855' column='1'/>
+        <var-decl name='usb_class' type-id='type-id-108' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='855' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='usb_wwid' type-id='type-id-105' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='856' column='1'/>
+        <var-decl name='usb_wwid' type-id='type-id-109' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='856' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='lun' type-id='type-id-106' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='857' column='1'/>
+        <var-decl name='lun' type-id='type-id-110' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='857' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='sata' type-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='858' column='1'/>
+        <var-decl name='sata' type-id='type-id-111' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='858' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='i2o' type-id='type-id-108' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='859' column='1'/>
+        <var-decl name='i2o' type-id='type-id-112' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='859' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='mac_addr' type-id='type-id-109' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='860' column='1'/>
+        <var-decl name='mac_addr' type-id='type-id-113' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='860' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='ipv4_addr' type-id='type-id-110' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='861' column='1'/>
+        <var-decl name='ipv4_addr' type-id='type-id-114' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='861' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='ipv6_addr' type-id='type-id-111' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='862' column='1'/>
+        <var-decl name='ipv6_addr' type-id='type-id-115' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='862' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='vlan' type-id='type-id-112' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='863' column='1'/>
+        <var-decl name='vlan' type-id='type-id-116' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='863' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='infiniband' type-id='type-id-113' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='864' column='1'/>
+        <var-decl name='infiniband' type-id='type-id-117' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='864' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='uart' type-id='type-id-114' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='865' column='1'/>
+        <var-decl name='uart' type-id='type-id-118' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='865' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='msg_vendor' type-id='type-id-115' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='866' column='1'/>
+        <var-decl name='msg_vendor' type-id='type-id-119' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='866' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='uart_flow_control' type-id='type-id-116' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='867' column='1'/>
+        <var-decl name='uart_flow_control' type-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='867' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='sas' type-id='type-id-117' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='868' column='1'/>
+        <var-decl name='sas' type-id='type-id-121' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='868' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='sas_ex' type-id='type-id-118' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='869' column='1'/>
+        <var-decl name='sas_ex' type-id='type-id-122' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='869' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='iscsi' type-id='type-id-119' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='870' column='1'/>
+        <var-decl name='iscsi' type-id='type-id-123' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='870' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='nvme' type-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='871' column='1'/>
+        <var-decl name='nvme' type-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='871' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='uri' type-id='type-id-121' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='872' column='1'/>
+        <var-decl name='uri' type-id='type-id-125' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='872' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='ufs' type-id='type-id-122' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='873' column='1'/>
+        <var-decl name='ufs' type-id='type-id-126' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='873' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='sd' type-id='type-id-123' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='874' column='1'/>
+        <var-decl name='sd' type-id='type-id-127' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='874' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='bt' type-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='875' column='1'/>
+        <var-decl name='bt' type-id='type-id-128' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='875' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='wifi' type-id='type-id-125' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='876' column='1'/>
+        <var-decl name='wifi' type-id='type-id-129' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='876' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='emmc' type-id='type-id-126' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='877' column='1'/>
+        <var-decl name='emmc' type-id='type-id-130' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='877' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='btle' type-id='type-id-127' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='878' column='1'/>
+        <var-decl name='btle' type-id='type-id-131' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='878' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='dns' type-id='type-id-128' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='879' column='1'/>
+        <var-decl name='dns' type-id='type-id-132' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='879' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='nvdimm' type-id='type-id-129' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='880' column='1'/>
+        <var-decl name='nvdimm' type-id='type-id-133' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='880' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='hd' type-id='type-id-130' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='881' column='1'/>
+        <var-decl name='hd' type-id='type-id-134' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='881' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='cdrom' type-id='type-id-131' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='882' column='1'/>
+        <var-decl name='cdrom' type-id='type-id-135' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='882' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='media_vendor' type-id='type-id-132' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='883' column='1'/>
+        <var-decl name='media_vendor' type-id='type-id-136' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='883' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='file' type-id='type-id-133' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='884' column='1'/>
+        <var-decl name='file' type-id='type-id-137' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='884' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='protocol' type-id='type-id-134' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='885' column='1'/>
+        <var-decl name='protocol' type-id='type-id-138' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='885' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='firmware_file' type-id='type-id-135' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='886' column='1'/>
+        <var-decl name='firmware_file' type-id='type-id-139' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='886' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='firmware_volume' type-id='type-id-136' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='887' column='1'/>
+        <var-decl name='firmware_volume' type-id='type-id-140' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='887' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='relative_offset' type-id='type-id-137' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='888' column='1'/>
+        <var-decl name='relative_offset' type-id='type-id-141' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='888' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='ramdisk' type-id='type-id-138' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='889' column='1'/>
+        <var-decl name='ramdisk' type-id='type-id-142' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='889' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='bios_boot' type-id='type-id-139' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='890' column='1'/>
+        <var-decl name='bios_boot' type-id='type-id-143' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='890' column='1'/>
       </data-member>
     </union-decl>
-    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='834' column='1' id='type-id-87'>
+    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='834' column='1' id='type-id-91'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='type' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='835' column='1'/>
       </data-member>
@@ -1075,7 +1108,7 @@
         <var-decl name='length' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='837' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='36' column='1' id='type-id-140'>
+    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='36' column='1' id='type-id-144'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='type' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='37' column='1'/>
       </data-member>
@@ -1086,10 +1119,10 @@
         <var-decl name='length' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='39' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_header' type-id='type-id-140' filepath='src/include/efivar/efivar-dp.h' line='40' column='1' id='type-id-88'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-89' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='55' column='1' id='type-id-141'>
+    <typedef-decl name='efidp_header' type-id='type-id-144' filepath='src/include/efivar/efivar-dp.h' line='40' column='1' id='type-id-92'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-93' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='55' column='1' id='type-id-145'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='56' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='56' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='function' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='57' column='1'/>
@@ -1098,19 +1131,19 @@
         <var-decl name='device' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='58' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_pci' type-id='type-id-141' filepath='src/include/efivar/efivar-dp.h' line='59' column='1' id='type-id-89'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-90' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='64' column='1' id='type-id-142'>
+    <typedef-decl name='efidp_pci' type-id='type-id-145' filepath='src/include/efivar/efivar-dp.h' line='59' column='1' id='type-id-93'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-94' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='64' column='1' id='type-id-146'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='65' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='65' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='function' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='66' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_pccard' type-id='type-id-142' filepath='src/include/efivar/efivar-dp.h' line='67' column='1' id='type-id-90'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='70' column='1' id='type-id-143'>
+    <typedef-decl name='efidp_pccard' type-id='type-id-146' filepath='src/include/efivar/efivar-dp.h' line='67' column='1' id='type-id-94'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='70' column='1' id='type-id-147'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='71' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='71' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='memory_type' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='72' column='1'/>
@@ -1122,36 +1155,36 @@
         <var-decl name='ending_address' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='74' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_mmio' type-id='type-id-143' filepath='src/include/efivar/efivar-dp.h' line='75' column='1' id='type-id-91'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='78' column='1' id='type-id-144'>
+    <typedef-decl name='efidp_mmio' type-id='type-id-147' filepath='src/include/efivar/efivar-dp.h' line='75' column='1' id='type-id-95'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='78' column='1' id='type-id-148'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='79' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='79' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='vendor_guid' type-id='type-id-17' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='80' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='vendor_data' type-id='type-id-145' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='81' column='1'/>
+        <var-decl name='vendor_data' type-id='type-id-149' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='81' column='1'/>
       </data-member>
     </class-decl>
 
-    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='8' id='type-id-145'>
+    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='8' id='type-id-149'>
       <subrange length='1' type-id='type-id-13' id='type-id-74'/>
 
     </array-type-def>
-    <typedef-decl name='efidp_hw_vendor' type-id='type-id-144' filepath='src/include/efivar/efivar-dp.h' line='82' column='1' id='type-id-92'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-93' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='99' column='1' id='type-id-146'>
+    <typedef-decl name='efidp_hw_vendor' type-id='type-id-148' filepath='src/include/efivar/efivar-dp.h' line='82' column='1' id='type-id-96'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-97' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='99' column='1' id='type-id-150'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='100' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='100' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='controller' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='101' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_controller' type-id='type-id-146' filepath='src/include/efivar/efivar-dp.h' line='102' column='1' id='type-id-93'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='104' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-94' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='105' column='1' id='type-id-147'>
+    <typedef-decl name='efidp_controller' type-id='type-id-150' filepath='src/include/efivar/efivar-dp.h' line='102' column='1' id='type-id-97'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='104' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-98' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='105' column='1' id='type-id-151'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='106' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='106' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='interface_type' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='107' column='1'/>
@@ -1160,10 +1193,10 @@
         <var-decl name='base_addr' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='108' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_bmc' type-id='type-id-147' filepath='src/include/efivar/efivar-dp.h' line='109' column='1' id='type-id-94'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='119' column='1' id='type-id-148'>
+    <typedef-decl name='efidp_bmc' type-id='type-id-151' filepath='src/include/efivar/efivar-dp.h' line='109' column='1' id='type-id-98'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='96' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-99' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='119' column='1' id='type-id-152'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='120' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='120' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='hid' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='121' column='1'/>
@@ -1172,10 +1205,10 @@
         <var-decl name='uid' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='122' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_acpi_hid' type-id='type-id-148' filepath='src/include/efivar/efivar-dp.h' line='123' column='1' id='type-id-95'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='128' column='1' id='type-id-149'>
+    <typedef-decl name='efidp_acpi_hid' type-id='type-id-152' filepath='src/include/efivar/efivar-dp.h' line='123' column='1' id='type-id-99'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-100' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='128' column='1' id='type-id-153'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='129' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='129' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='hid' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='130' column='1'/>
@@ -1190,24 +1223,24 @@
         <var-decl name='hidstr' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='134' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-149' filepath='src/include/efivar/efivar-dp.h' line='135' column='1' id='type-id-96'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-97' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='166' column='1' id='type-id-150'>
+    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-153' filepath='src/include/efivar/efivar-dp.h' line='135' column='1' id='type-id-100'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-101' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='166' column='1' id='type-id-154'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='167' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='167' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='adr' type-id='type-id-151' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='168' column='1'/>
+        <var-decl name='adr' type-id='type-id-155' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='168' column='1'/>
       </data-member>
     </class-decl>
 
-    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='32' id='type-id-151'>
+    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='32' id='type-id-155'>
       <subrange length='1' type-id='type-id-13' id='type-id-74'/>
 
     </array-type-def>
-    <typedef-decl name='efidp_acpi_adr' type-id='type-id-150' filepath='src/include/efivar/efivar-dp.h' line='169' column='1' id='type-id-97'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-98' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='327' column='1' id='type-id-152'>
+    <typedef-decl name='efidp_acpi_adr' type-id='type-id-154' filepath='src/include/efivar/efivar-dp.h' line='169' column='1' id='type-id-101'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-102' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='327' column='1' id='type-id-156'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='328' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='328' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='primary' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='329' column='1'/>
@@ -1219,10 +1252,10 @@
         <var-decl name='lun' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='331' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_atapi' type-id='type-id-152' filepath='src/include/efivar/efivar-dp.h' line='332' column='1' id='type-id-98'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-99' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='337' column='1' id='type-id-153'>
+    <typedef-decl name='efidp_atapi' type-id='type-id-156' filepath='src/include/efivar/efivar-dp.h' line='332' column='1' id='type-id-102'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-103' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='337' column='1' id='type-id-157'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='338' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='338' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='target' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='339' column='1'/>
@@ -1231,10 +1264,10 @@
         <var-decl name='lun' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='340' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_scsi' type-id='type-id-153' filepath='src/include/efivar/efivar-dp.h' line='341' column='1' id='type-id-99'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-100' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='346' column='1' id='type-id-154'>
+    <typedef-decl name='efidp_scsi' type-id='type-id-157' filepath='src/include/efivar/efivar-dp.h' line='341' column='1' id='type-id-103'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-104' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='346' column='1' id='type-id-158'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='347' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='347' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='reserved' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='348' column='1'/>
@@ -1246,30 +1279,30 @@
         <var-decl name='lun' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='350' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_fc' type-id='type-id-154' filepath='src/include/efivar/efivar-dp.h' line='351' column='1' id='type-id-100'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-101' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='354' column='1' id='type-id-155'>
+    <typedef-decl name='efidp_fc' type-id='type-id-158' filepath='src/include/efivar/efivar-dp.h' line='351' column='1' id='type-id-104'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-105' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='354' column='1' id='type-id-159'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='355' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='355' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='reserved' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='356' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='wwn' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='357' column='1'/>
+        <var-decl name='wwn' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='357' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='lun' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='358' column='1'/>
+        <var-decl name='lun' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='358' column='1'/>
       </data-member>
     </class-decl>
 
-    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='64' id='type-id-156'>
-      <subrange length='8' type-id='type-id-13' id='type-id-157'/>
+    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='64' id='type-id-160'>
+      <subrange length='8' type-id='type-id-13' id='type-id-161'/>
 
     </array-type-def>
-    <typedef-decl name='efidp_fcex' type-id='type-id-155' filepath='src/include/efivar/efivar-dp.h' line='359' column='1' id='type-id-101'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-102' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='362' column='1' id='type-id-158'>
+    <typedef-decl name='efidp_fcex' type-id='type-id-159' filepath='src/include/efivar/efivar-dp.h' line='359' column='1' id='type-id-105'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-106' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='362' column='1' id='type-id-162'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='363' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='363' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='reserved' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='364' column='1'/>
@@ -1278,10 +1311,10 @@
         <var-decl name='guid' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='365' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_1394' type-id='type-id-158' filepath='src/include/efivar/efivar-dp.h' line='366' column='1' id='type-id-102'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-103' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='369' column='1' id='type-id-159'>
+    <typedef-decl name='efidp_1394' type-id='type-id-162' filepath='src/include/efivar/efivar-dp.h' line='366' column='1' id='type-id-106'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='369' column='1' id='type-id-163'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='370' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='370' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='parent_port' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='371' column='1'/>
@@ -1290,10 +1323,10 @@
         <var-decl name='interface' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='372' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_usb' type-id='type-id-159' filepath='src/include/efivar/efivar-dp.h' line='373' column='1' id='type-id-103'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='88' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-104' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='376' column='1' id='type-id-160'>
+    <typedef-decl name='efidp_usb' type-id='type-id-163' filepath='src/include/efivar/efivar-dp.h' line='373' column='1' id='type-id-107'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='88' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-108' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='376' column='1' id='type-id-164'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='377' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='377' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='vendor_id' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='378' column='1'/>
@@ -1311,10 +1344,10 @@
         <var-decl name='device_protocol' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='382' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_usb_class' type-id='type-id-160' filepath='src/include/efivar/efivar-dp.h' line='383' column='1' id='type-id-104'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-105' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='403' column='1' id='type-id-161'>
+    <typedef-decl name='efidp_usb_class' type-id='type-id-164' filepath='src/include/efivar/efivar-dp.h' line='383' column='1' id='type-id-108'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-109' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='403' column='1' id='type-id-165'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='404' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='404' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='interface' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='405' column='1'/>
@@ -1326,27 +1359,27 @@
         <var-decl name='product_id' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='407' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='80'>
-        <var-decl name='serial_number' type-id='type-id-162' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='408' column='1'/>
+        <var-decl name='serial_number' type-id='type-id-166' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='408' column='1'/>
       </data-member>
     </class-decl>
 
-    <array-type-def dimensions='1' type-id='type-id-20' size-in-bits='16' id='type-id-162'>
+    <array-type-def dimensions='1' type-id='type-id-20' size-in-bits='16' id='type-id-166'>
       <subrange length='1' type-id='type-id-13' id='type-id-74'/>
 
     </array-type-def>
-    <typedef-decl name='efidp_usb_wwid' type-id='type-id-161' filepath='src/include/efivar/efivar-dp.h' line='409' column='1' id='type-id-105'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-106' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='412' column='1' id='type-id-163'>
+    <typedef-decl name='efidp_usb_wwid' type-id='type-id-165' filepath='src/include/efivar/efivar-dp.h' line='409' column='1' id='type-id-109'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-110' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='412' column='1' id='type-id-167'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='413' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='413' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='lun' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='414' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_lun' type-id='type-id-163' filepath='src/include/efivar/efivar-dp.h' line='415' column='1' id='type-id-106'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='418' column='1' id='type-id-164'>
+    <typedef-decl name='efidp_lun' type-id='type-id-167' filepath='src/include/efivar/efivar-dp.h' line='415' column='1' id='type-id-110'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-111' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='418' column='1' id='type-id-168'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='419' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='419' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='hba_port' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='420' column='1'/>
@@ -1358,42 +1391,42 @@
         <var-decl name='lun' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='422' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_sata' type-id='type-id-164' filepath='src/include/efivar/efivar-dp.h' line='423' column='1' id='type-id-107'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-108' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='429' column='1' id='type-id-165'>
+    <typedef-decl name='efidp_sata' type-id='type-id-168' filepath='src/include/efivar/efivar-dp.h' line='423' column='1' id='type-id-111'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-112' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='429' column='1' id='type-id-169'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='430' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='430' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='target' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='431' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_i2o' type-id='type-id-165' filepath='src/include/efivar/efivar-dp.h' line='432' column='1' id='type-id-108'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='296' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-109' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='435' column='1' id='type-id-166'>
+    <typedef-decl name='efidp_i2o' type-id='type-id-169' filepath='src/include/efivar/efivar-dp.h' line='432' column='1' id='type-id-112'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='296' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-113' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='435' column='1' id='type-id-170'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='436' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='436' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='mac_addr' type-id='type-id-167' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='437' column='1'/>
+        <var-decl name='mac_addr' type-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='437' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='288'>
         <var-decl name='if_type' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='438' column='1'/>
       </data-member>
     </class-decl>
 
-    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='256' id='type-id-167'>
-      <subrange length='32' type-id='type-id-13' id='type-id-168'/>
+    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='256' id='type-id-171'>
+      <subrange length='32' type-id='type-id-13' id='type-id-172'/>
 
     </array-type-def>
-    <typedef-decl name='efidp_mac_addr' type-id='type-id-166' filepath='src/include/efivar/efivar-dp.h' line='439' column='1' id='type-id-109'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='216' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-110' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='447' column='1' id='type-id-169'>
+    <typedef-decl name='efidp_mac_addr' type-id='type-id-170' filepath='src/include/efivar/efivar-dp.h' line='439' column='1' id='type-id-113'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='216' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-114' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='447' column='1' id='type-id-173'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='448' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='448' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='local_ipv4_addr' type-id='type-id-170' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='449' column='1'/>
+        <var-decl name='local_ipv4_addr' type-id='type-id-174' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='449' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='remote_ipv4_addr' type-id='type-id-170' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='450' column='1'/>
+        <var-decl name='remote_ipv4_addr' type-id='type-id-174' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='450' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
         <var-decl name='local_port' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='451' column='1'/>
@@ -1405,31 +1438,31 @@
         <var-decl name='protocol' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='453' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='144'>
-        <var-decl name='static_ip_addr' type-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='454' column='1'/>
+        <var-decl name='static_ip_addr' type-id='type-id-175' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='454' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='152'>
-        <var-decl name='gateway' type-id='type-id-170' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='455' column='1'/>
+        <var-decl name='gateway' type-id='type-id-174' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='455' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='184'>
-        <var-decl name='netmask' type-id='type-id-170' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='456' column='1'/>
+        <var-decl name='netmask' type-id='type-id-174' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='456' column='1'/>
       </data-member>
     </class-decl>
 
-    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='32' id='type-id-170'>
-      <subrange length='4' type-id='type-id-13' id='type-id-172'/>
+    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='32' id='type-id-174'>
+      <subrange length='4' type-id='type-id-13' id='type-id-176'/>
 
     </array-type-def>
-    <typedef-decl name='efidp_boolean' type-id='type-id-28' filepath='src/include/efivar/efivar-dp.h' line='43' column='1' id='type-id-171'/>
-    <typedef-decl name='efidp_ipv4_addr' type-id='type-id-169' filepath='src/include/efivar/efivar-dp.h' line='457' column='1' id='type-id-110'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='360' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-111' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='469' column='1' id='type-id-173'>
+    <typedef-decl name='efidp_boolean' type-id='type-id-28' filepath='src/include/efivar/efivar-dp.h' line='43' column='1' id='type-id-175'/>
+    <typedef-decl name='efidp_ipv4_addr' type-id='type-id-173' filepath='src/include/efivar/efivar-dp.h' line='457' column='1' id='type-id-114'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='360' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-115' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='469' column='1' id='type-id-177'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='470' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='470' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='local_ipv6_addr' type-id='type-id-174' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='471' column='1'/>
+        <var-decl name='local_ipv6_addr' type-id='type-id-178' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='471' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='remote_ipv6_addr' type-id='type-id-174' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='472' column='1'/>
+        <var-decl name='remote_ipv6_addr' type-id='type-id-178' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='472' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='288'>
         <var-decl name='local_port' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='473' column='1'/>
@@ -1451,32 +1484,32 @@
       </data-member>
     </class-decl>
 
-    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='128' id='type-id-174'>
-      <subrange length='16' type-id='type-id-13' id='type-id-175'/>
+    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='128' id='type-id-178'>
+      <subrange length='16' type-id='type-id-13' id='type-id-179'/>
 
     </array-type-def>
-    <typedef-decl name='efidp_ipv6_addr' type-id='type-id-173' filepath='src/include/efivar/efivar-dp.h' line='479' column='1' id='type-id-111'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-112' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='486' column='1' id='type-id-176'>
+    <typedef-decl name='efidp_ipv6_addr' type-id='type-id-177' filepath='src/include/efivar/efivar-dp.h' line='479' column='1' id='type-id-115'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-116' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='486' column='1' id='type-id-180'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='487' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='487' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='vlan_id' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='488' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_vlan' type-id='type-id-176' filepath='src/include/efivar/efivar-dp.h' line='489' column='1' id='type-id-112'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='384' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-113' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='492' column='1' id='type-id-177'>
+    <typedef-decl name='efidp_vlan' type-id='type-id-180' filepath='src/include/efivar/efivar-dp.h' line='489' column='1' id='type-id-116'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='384' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-117' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='492' column='1' id='type-id-181'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='493' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='493' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='resource_flags' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='494' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='port_gid' type-id='type-id-178' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='495' column='1'/>
+        <var-decl name='port_gid' type-id='type-id-182' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='495' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='' type-id='type-id-179' visibility='default'/>
+        <var-decl name='' type-id='type-id-183' visibility='default'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
         <var-decl name='target_port_id' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='500' column='1'/>
@@ -1486,11 +1519,11 @@
       </data-member>
     </class-decl>
 
-    <array-type-def dimensions='1' type-id='type-id-54' size-in-bits='128' id='type-id-178'>
-      <subrange length='2' type-id='type-id-13' id='type-id-180'/>
+    <array-type-def dimensions='1' type-id='type-id-54' size-in-bits='128' id='type-id-182'>
+      <subrange length='2' type-id='type-id-13' id='type-id-184'/>
 
     </array-type-def>
-    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='496' column='1' id='type-id-179'>
+    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='496' column='1' id='type-id-183'>
       <data-member access='private'>
         <var-decl name='ioc_guid' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='497' column='1'/>
       </data-member>
@@ -1498,10 +1531,10 @@
         <var-decl name='service_id' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='498' column='1'/>
       </data-member>
     </union-decl>
-    <typedef-decl name='efidp_infiniband' type-id='type-id-177' filepath='src/include/efivar/efivar-dp.h' line='502' column='1' id='type-id-113'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='152' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-114' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='511' column='1' id='type-id-181'>
+    <typedef-decl name='efidp_infiniband' type-id='type-id-181' filepath='src/include/efivar/efivar-dp.h' line='502' column='1' id='type-id-117'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='152' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-118' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='511' column='1' id='type-id-185'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='512' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='512' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='reserved' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='513' column='1'/>
@@ -1519,22 +1552,22 @@
         <var-decl name='stop_bits' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='517' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_uart' type-id='type-id-181' filepath='src/include/efivar/efivar-dp.h' line='518' column='1' id='type-id-114'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-115' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='542' column='1' id='type-id-182'>
+    <typedef-decl name='efidp_uart' type-id='type-id-185' filepath='src/include/efivar/efivar-dp.h' line='518' column='1' id='type-id-118'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-119' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='542' column='1' id='type-id-186'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='543' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='543' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='vendor_guid' type-id='type-id-17' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='544' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='vendor_data' type-id='type-id-145' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='545' column='1'/>
+        <var-decl name='vendor_data' type-id='type-id-149' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='545' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_msg_vendor' type-id='type-id-182' filepath='src/include/efivar/efivar-dp.h' line='546' column='1' id='type-id-115'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-116' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='555' column='1' id='type-id-183'>
+    <typedef-decl name='efidp_msg_vendor' type-id='type-id-186' filepath='src/include/efivar/efivar-dp.h' line='546' column='1' id='type-id-119'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='555' column='1' id='type-id-187'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='556' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='556' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='vendor_guid' type-id='type-id-17' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='557' column='1'/>
@@ -1543,10 +1576,10 @@
         <var-decl name='flow_control_map' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='558' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_uart_flow_control' type-id='type-id-183' filepath='src/include/efivar/efivar-dp.h' line='559' column='1' id='type-id-116'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='352' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-117' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='566' column='1' id='type-id-184'>
+    <typedef-decl name='efidp_uart_flow_control' type-id='type-id-187' filepath='src/include/efivar/efivar-dp.h' line='559' column='1' id='type-id-120'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='352' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-121' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='566' column='1' id='type-id-188'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='567' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='567' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='vendor_guid' type-id='type-id-17' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='568' column='1'/>
@@ -1570,16 +1603,16 @@
         <var-decl name='rtp' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='574' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_sas' type-id='type-id-184' filepath='src/include/efivar/efivar-dp.h' line='575' column='1' id='type-id-117'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-118' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='599' column='1' id='type-id-185'>
+    <typedef-decl name='efidp_sas' type-id='type-id-188' filepath='src/include/efivar/efivar-dp.h' line='575' column='1' id='type-id-121'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-122' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='599' column='1' id='type-id-189'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='600' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='600' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='sas_address' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='601' column='1'/>
+        <var-decl name='sas_address' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='601' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='lun' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='602' column='1'/>
+        <var-decl name='lun' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='602' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
         <var-decl name='device_topology_info' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='603' column='1'/>
@@ -1591,10 +1624,10 @@
         <var-decl name='rtp' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='605' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_sas_ex' type-id='type-id-185' filepath='src/include/efivar/efivar-dp.h' line='606' column='1' id='type-id-118'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='144' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-119' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='612' column='1' id='type-id-186'>
+    <typedef-decl name='efidp_sas_ex' type-id='type-id-189' filepath='src/include/efivar/efivar-dp.h' line='606' column='1' id='type-id-122'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='144' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-123' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='612' column='1' id='type-id-190'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='613' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='613' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='protocol' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='614' column='1'/>
@@ -1603,40 +1636,40 @@
         <var-decl name='options' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='615' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='lun' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='616' column='1'/>
+        <var-decl name='lun' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='616' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
         <var-decl name='tpgt' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='617' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='144'>
-        <var-decl name='target_name' type-id='type-id-145' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='618' column='1'/>
+        <var-decl name='target_name' type-id='type-id-149' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='618' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_iscsi' type-id='type-id-186' filepath='src/include/efivar/efivar-dp.h' line='619' column='1' id='type-id-119'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='647' column='1' id='type-id-187'>
+    <typedef-decl name='efidp_iscsi' type-id='type-id-190' filepath='src/include/efivar/efivar-dp.h' line='619' column='1' id='type-id-123'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='647' column='1' id='type-id-191'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='648' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='648' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='namespace_id' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='649' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='ieee_eui_64' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='650' column='1'/>
+        <var-decl name='ieee_eui_64' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='650' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_nvme' type-id='type-id-187' filepath='src/include/efivar/efivar-dp.h' line='651' column='1' id='type-id-120'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-121' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='656' column='1' id='type-id-188'>
+    <typedef-decl name='efidp_nvme' type-id='type-id-191' filepath='src/include/efivar/efivar-dp.h' line='651' column='1' id='type-id-124'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-125' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='656' column='1' id='type-id-192'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='657' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='657' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='uri' type-id='type-id-145' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='658' column='1'/>
+        <var-decl name='uri' type-id='type-id-149' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='658' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_uri' type-id='type-id-188' filepath='src/include/efivar/efivar-dp.h' line='659' column='1' id='type-id-121'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-122' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='662' column='1' id='type-id-189'>
+    <typedef-decl name='efidp_uri' type-id='type-id-192' filepath='src/include/efivar/efivar-dp.h' line='659' column='1' id='type-id-125'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='48' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-126' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='662' column='1' id='type-id-193'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='663' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='663' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='target_id' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='664' column='1'/>
@@ -1645,46 +1678,46 @@
         <var-decl name='lun' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='665' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_ufs' type-id='type-id-189' filepath='src/include/efivar/efivar-dp.h' line='666' column='1' id='type-id-122'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-123' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='669' column='1' id='type-id-190'>
+    <typedef-decl name='efidp_ufs' type-id='type-id-193' filepath='src/include/efivar/efivar-dp.h' line='666' column='1' id='type-id-126'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-127' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='669' column='1' id='type-id-194'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='670' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='670' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='slot_number' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='671' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_sd' type-id='type-id-190' filepath='src/include/efivar/efivar-dp.h' line='672' column='1' id='type-id-123'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='675' column='1' id='type-id-191'>
+    <typedef-decl name='efidp_sd' type-id='type-id-194' filepath='src/include/efivar/efivar-dp.h' line='672' column='1' id='type-id-127'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='80' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-128' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='675' column='1' id='type-id-195'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='676' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='676' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='addr' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='677' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_bt' type-id='type-id-191' filepath='src/include/efivar/efivar-dp.h' line='678' column='1' id='type-id-124'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='288' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-125' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='681' column='1' id='type-id-192'>
+    <typedef-decl name='efidp_bt' type-id='type-id-195' filepath='src/include/efivar/efivar-dp.h' line='678' column='1' id='type-id-128'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='288' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-129' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='681' column='1' id='type-id-196'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='682' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='682' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='ssid' type-id='type-id-167' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='683' column='1'/>
+        <var-decl name='ssid' type-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='683' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_wifi' type-id='type-id-192' filepath='src/include/efivar/efivar-dp.h' line='684' column='1' id='type-id-125'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-126' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='687' column='1' id='type-id-193'>
+    <typedef-decl name='efidp_wifi' type-id='type-id-196' filepath='src/include/efivar/efivar-dp.h' line='684' column='1' id='type-id-129'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-130' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='687' column='1' id='type-id-197'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='688' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='688' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='slot' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='689' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_emmc' type-id='type-id-193' filepath='src/include/efivar/efivar-dp.h' line='690' column='1' id='type-id-126'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='88' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-127' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='693' column='1' id='type-id-194'>
+    <typedef-decl name='efidp_emmc' type-id='type-id-197' filepath='src/include/efivar/efivar-dp.h' line='690' column='1' id='type-id-130'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='88' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-131' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='693' column='1' id='type-id-198'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='694' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='694' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='addr' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='695' column='1'/>
@@ -1693,65 +1726,65 @@
         <var-decl name='addr_type' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='696' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_btle' type-id='type-id-194' filepath='src/include/efivar/efivar-dp.h' line='697' column='1' id='type-id-127'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-128' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='703' column='1' id='type-id-195'>
+    <typedef-decl name='efidp_btle' type-id='type-id-198' filepath='src/include/efivar/efivar-dp.h' line='697' column='1' id='type-id-131'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='40' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-132' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='703' column='1' id='type-id-199'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='704' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='704' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='is_ipv6' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='705' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='addrs' type-id='type-id-196' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='706' column='1'/>
+        <var-decl name='addrs' type-id='type-id-200' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='706' column='1'/>
       </data-member>
     </class-decl>
-    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar.h' line='49' column='1' id='type-id-197'>
+    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar.h' line='49' column='1' id='type-id-201'>
       <data-member access='private'>
-        <var-decl name='addr' type-id='type-id-198' visibility='default' filepath='src/include/efivar/efivar.h' line='50' column='1'/>
+        <var-decl name='addr' type-id='type-id-202' visibility='default' filepath='src/include/efivar/efivar.h' line='50' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='v4' type-id='type-id-199' visibility='default' filepath='src/include/efivar/efivar.h' line='51' column='1'/>
+        <var-decl name='v4' type-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar.h' line='51' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='v6' type-id='type-id-200' visibility='default' filepath='src/include/efivar/efivar.h' line='52' column='1'/>
+        <var-decl name='v6' type-id='type-id-204' visibility='default' filepath='src/include/efivar/efivar.h' line='52' column='1'/>
       </data-member>
     </union-decl>
 
-    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='128' id='type-id-198'>
-      <subrange length='4' type-id='type-id-13' id='type-id-172'/>
+    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='128' id='type-id-202'>
+      <subrange length='4' type-id='type-id-13' id='type-id-176'/>
 
     </array-type-def>
-    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-199' visibility='default' filepath='src/include/efivar/efivar.h' line='41' column='1' id='type-id-201'>
+    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar.h' line='41' column='1' id='type-id-205'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='addr' type-id='type-id-170' visibility='default' filepath='src/include/efivar/efivar.h' line='42' column='1'/>
+        <var-decl name='addr' type-id='type-id-174' visibility='default' filepath='src/include/efivar/efivar.h' line='42' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efi_ipv4_addr_t' type-id='type-id-201' filepath='src/include/efivar/efivar.h' line='43' column='1' id='type-id-199'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-200' visibility='default' filepath='src/include/efivar/efivar.h' line='45' column='1' id='type-id-202'>
+    <typedef-decl name='efi_ipv4_addr_t' type-id='type-id-205' filepath='src/include/efivar/efivar.h' line='43' column='1' id='type-id-203'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-204' visibility='default' filepath='src/include/efivar/efivar.h' line='45' column='1' id='type-id-206'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='addr' type-id='type-id-174' visibility='default' filepath='src/include/efivar/efivar.h' line='46' column='1'/>
+        <var-decl name='addr' type-id='type-id-178' visibility='default' filepath='src/include/efivar/efivar.h' line='46' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efi_ipv6_addr_t' type-id='type-id-202' filepath='src/include/efivar/efivar.h' line='47' column='1' id='type-id-200'/>
-    <typedef-decl name='efi_ip_addr_t' type-id='type-id-197' filepath='src/include/efivar/efivar.h' line='53' column='1' id='type-id-203'/>
+    <typedef-decl name='efi_ipv6_addr_t' type-id='type-id-206' filepath='src/include/efivar/efivar.h' line='47' column='1' id='type-id-204'/>
+    <typedef-decl name='efi_ip_addr_t' type-id='type-id-201' filepath='src/include/efivar/efivar.h' line='53' column='1' id='type-id-207'/>
 
-    <array-type-def dimensions='1' type-id='type-id-203' size-in-bits='128' id='type-id-196'>
+    <array-type-def dimensions='1' type-id='type-id-207' size-in-bits='128' id='type-id-200'>
       <subrange length='1' type-id='type-id-13' id='type-id-74'/>
 
     </array-type-def>
-    <typedef-decl name='efidp_dns' type-id='type-id-195' filepath='src/include/efivar/efivar-dp.h' line='707' column='1' id='type-id-128'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-129' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='710' column='1' id='type-id-204'>
+    <typedef-decl name='efidp_dns' type-id='type-id-199' filepath='src/include/efivar/efivar-dp.h' line='707' column='1' id='type-id-132'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-133' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='710' column='1' id='type-id-208'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='711' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='711' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='uuid' type-id='type-id-17' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='712' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_nvdimm' type-id='type-id-204' filepath='src/include/efivar/efivar-dp.h' line='713' column='1' id='type-id-129'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='336' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-130' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='718' column='1' id='type-id-205'>
+    <typedef-decl name='efidp_nvdimm' type-id='type-id-208' filepath='src/include/efivar/efivar-dp.h' line='713' column='1' id='type-id-133'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='336' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-134' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='718' column='1' id='type-id-209'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='719' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='719' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='partition_number' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='720' column='1'/>
@@ -1763,7 +1796,7 @@
         <var-decl name='size' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='722' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='signature' type-id='type-id-174' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='723' column='1'/>
+        <var-decl name='signature' type-id='type-id-178' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='723' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
         <var-decl name='format' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='724' column='1'/>
@@ -1772,10 +1805,10 @@
         <var-decl name='signature_type' type-id='type-id-28' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='725' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_hd' type-id='type-id-205' filepath='src/include/efivar/efivar-dp.h' line='729' column='1' id='type-id-130'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-131' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='743' column='1' id='type-id-206'>
+    <typedef-decl name='efidp_hd' type-id='type-id-209' filepath='src/include/efivar/efivar-dp.h' line='729' column='1' id='type-id-134'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-135' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='743' column='1' id='type-id-210'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='744' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='744' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='boot_catalog_entry' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='745' column='1'/>
@@ -1787,58 +1820,58 @@
         <var-decl name='sectors' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='747' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_cdrom' type-id='type-id-206' filepath='src/include/efivar/efivar-dp.h' line='748' column='1' id='type-id-131'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-132' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='751' column='1' id='type-id-207'>
+    <typedef-decl name='efidp_cdrom' type-id='type-id-210' filepath='src/include/efivar/efivar-dp.h' line='748' column='1' id='type-id-135'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-136' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='751' column='1' id='type-id-211'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='752' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='752' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='vendor_guid' type-id='type-id-17' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='753' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='vendor_data' type-id='type-id-145' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='754' column='1'/>
+        <var-decl name='vendor_data' type-id='type-id-149' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='754' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_media_vendor' type-id='type-id-207' filepath='src/include/efivar/efivar-dp.h' line='755' column='1' id='type-id-132'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-133' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='762' column='1' id='type-id-208'>
+    <typedef-decl name='efidp_media_vendor' type-id='type-id-211' filepath='src/include/efivar/efivar-dp.h' line='755' column='1' id='type-id-136'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-137' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='762' column='1' id='type-id-212'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='763' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='763' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='name' type-id='type-id-162' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='764' column='1'/>
+        <var-decl name='name' type-id='type-id-166' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='764' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_file' type-id='type-id-208' filepath='src/include/efivar/efivar-dp.h' line='765' column='1' id='type-id-133'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-134' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='769' column='1' id='type-id-209'>
+    <typedef-decl name='efidp_file' type-id='type-id-212' filepath='src/include/efivar/efivar-dp.h' line='765' column='1' id='type-id-137'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='160' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-138' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='769' column='1' id='type-id-213'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='770' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='770' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='protocol_guid' type-id='type-id-17' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='771' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_protocol' type-id='type-id-209' filepath='src/include/efivar/efivar-dp.h' line='772' column='1' id='type-id-134'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-135' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='775' column='1' id='type-id-210'>
+    <typedef-decl name='efidp_protocol' type-id='type-id-213' filepath='src/include/efivar/efivar-dp.h' line='772' column='1' id='type-id-138'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-139' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='775' column='1' id='type-id-214'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='776' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='776' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='pi_info' type-id='type-id-145' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='777' column='1'/>
+        <var-decl name='pi_info' type-id='type-id-149' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='777' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_firmware_file' type-id='type-id-210' filepath='src/include/efivar/efivar-dp.h' line='778' column='1' id='type-id-135'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-136' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='781' column='1' id='type-id-211'>
+    <typedef-decl name='efidp_firmware_file' type-id='type-id-214' filepath='src/include/efivar/efivar-dp.h' line='778' column='1' id='type-id-139'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-140' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='781' column='1' id='type-id-215'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='782' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='782' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='pi_info' type-id='type-id-145' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='783' column='1'/>
+        <var-decl name='pi_info' type-id='type-id-149' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='783' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_firmware_volume' type-id='type-id-211' filepath='src/include/efivar/efivar-dp.h' line='784' column='1' id='type-id-136'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-137' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='787' column='1' id='type-id-212'>
+    <typedef-decl name='efidp_firmware_volume' type-id='type-id-215' filepath='src/include/efivar/efivar-dp.h' line='784' column='1' id='type-id-140'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-141' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='787' column='1' id='type-id-216'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='788' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='788' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='reserved' type-id='type-id-19' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='789' column='1'/>
@@ -1850,10 +1883,10 @@
         <var-decl name='last_byte' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='791' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_relative_offset' type-id='type-id-212' filepath='src/include/efivar/efivar-dp.h' line='792' column='1' id='type-id-137'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='304' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-138' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='795' column='1' id='type-id-213'>
+    <typedef-decl name='efidp_relative_offset' type-id='type-id-216' filepath='src/include/efivar/efivar-dp.h' line='792' column='1' id='type-id-141'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='304' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-142' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='795' column='1' id='type-id-217'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='796' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='796' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='start_addr' type-id='type-id-54' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='797' column='1'/>
@@ -1868,10 +1901,10 @@
         <var-decl name='instance_number' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='800' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_ramdisk' type-id='type-id-213' filepath='src/include/efivar/efivar-dp.h' line='801' column='1' id='type-id-138'/>
-    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-139' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='814' column='1' id='type-id-214'>
+    <typedef-decl name='efidp_ramdisk' type-id='type-id-217' filepath='src/include/efivar/efivar-dp.h' line='801' column='1' id='type-id-142'/>
+    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-143' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='814' column='1' id='type-id-218'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='815' column='1'/>
+        <var-decl name='header' type-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='815' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='device_type' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='816' column='1'/>
@@ -1880,105 +1913,72 @@
         <var-decl name='status' type-id='type-id-20' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='817' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='description' type-id='type-id-145' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='818' column='1'/>
+        <var-decl name='description' type-id='type-id-149' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='818' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_bios_boot' type-id='type-id-214' filepath='src/include/efivar/efivar-dp.h' line='819' column='1' id='type-id-139'/>
-    <typedef-decl name='efidp_data' type-id='type-id-86' filepath='src/include/efivar/efivar-dp.h' line='891' column='1' id='type-id-215'/>
-    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-216'/>
-    <typedef-decl name='efidp' type-id='type-id-216' filepath='src/include/efivar/efivar-dp.h' line='892' column='1' id='type-id-217'/>
-    <function-decl name='efidp_parse_device_path' mangled-name='efidp_parse_device_path' filepath='src/dp-acpi.c' line='414' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_parse_device_path@@libefivar.so.0'>
-      <parameter type-id='type-id-46' name='path' filepath='src/dp-acpi.c' line='414' column='1'/>
-      <parameter type-id='type-id-217' name='out' filepath='src/dp-acpi.c' line='414' column='1'/>
-      <parameter type-id='type-id-33' name='size' filepath='src/dp-acpi.c' line='415' column='1'/>
+    <typedef-decl name='efidp_bios_boot' type-id='type-id-218' filepath='src/include/efivar/efivar-dp.h' line='819' column='1' id='type-id-143'/>
+    <typedef-decl name='efidp_data' type-id='type-id-90' filepath='src/include/efivar/efivar-dp.h' line='891' column='1' id='type-id-219'/>
+    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-220'/>
+    <typedef-decl name='efidp' type-id='type-id-220' filepath='src/include/efivar/efivar-dp.h' line='892' column='1' id='type-id-221'/>
+    <function-decl name='efidp_parse_device_path' mangled-name='efidp_parse_device_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_parse_device_path@@libefivar.so.0'>
+      <parameter type-id='type-id-46' name='path'/>
+      <parameter type-id='type-id-221' name='out'/>
+      <parameter type-id='type-id-33' name='size'/>
       <return type-id='type-id-61'/>
     </function-decl>
-    <function-decl name='efidp_parse_device_node' mangled-name='efidp_parse_device_node' filepath='src/dp-acpi.c' line='405' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_parse_device_node@@libefivar.so.0'>
-      <parameter type-id='type-id-46' name='path' filepath='src/dp-acpi.c' line='414' column='1'/>
-      <parameter type-id='type-id-217' name='out' filepath='src/dp-acpi.c' line='414' column='1'/>
-      <parameter type-id='type-id-33' name='size' filepath='src/dp-acpi.c' line='415' column='1'/>
+    <function-decl name='efidp_parse_device_node' mangled-name='efidp_parse_device_node' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_parse_device_node@@libefivar.so.0'>
+      <parameter type-id='type-id-46' name='path'/>
+      <parameter type-id='type-id-221' name='out'/>
+      <parameter type-id='type-id-33' name='size'/>
       <return type-id='type-id-61'/>
     </function-decl>
-    <qualified-type-def type-id='type-id-215' const='yes' id='type-id-218'/>
-    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-219'/>
-    <typedef-decl name='const_efidp' type-id='type-id-219' filepath='src/include/efivar/efivar-dp.h' line='893' column='1' id='type-id-220'/>
-    <function-decl name='efidp_format_device_path' mangled-name='efidp_format_device_path' filepath='src/dp-acpi.c' line='301' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_format_device_path@@libefivar.so.0'>
-      <parameter type-id='type-id-46' name='buf' filepath='src/dp-acpi.c' line='301' column='1'/>
-      <parameter type-id='type-id-33' name='size' filepath='src/dp-acpi.c' line='301' column='1'/>
-      <parameter type-id='type-id-220' name='dp' filepath='src/dp-acpi.c' line='301' column='1'/>
-      <parameter type-id='type-id-61' name='limit' filepath='src/dp-acpi.c' line='301' column='1'/>
+    <qualified-type-def type-id='type-id-219' const='yes' id='type-id-222'/>
+    <pointer-type-def type-id='type-id-222' size-in-bits='64' id='type-id-223'/>
+    <typedef-decl name='const_efidp' type-id='type-id-223' filepath='src/include/efivar/efivar-dp.h' line='893' column='1' id='type-id-224'/>
+    <function-decl name='efidp_format_device_path' mangled-name='efidp_format_device_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_format_device_path@@libefivar.so.0'>
+      <parameter type-id='type-id-46' name='buf'/>
+      <parameter type-id='type-id-33' name='size'/>
+      <parameter type-id='type-id-224' name='dp'/>
+      <parameter type-id='type-id-61' name='limit'/>
       <return type-id='type-id-61'/>
     </function-decl>
-    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-221'/>
-    <function-decl name='efidp_append_instance' mangled-name='efidp_append_instance' filepath='src/dp-acpi.c' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_append_instance@@libefivar.so.0'>
-      <parameter type-id='type-id-220' name='dp' filepath='src/dp-acpi.c' line='254' column='1'/>
-      <parameter type-id='type-id-220' name='dpi' filepath='src/dp-acpi.c' line='254' column='1'/>
-      <parameter type-id='type-id-221' name='out' filepath='src/dp-acpi.c' line='254' column='1'/>
-      <parameter type-id='type-id-220' name='dp' filepath='src/dp-acpi.c' line='254' column='1'/>
-      <parameter type-id='type-id-220' name='dpi' filepath='src/dp-acpi.c' line='254' column='1'/>
-      <parameter type-id='type-id-221' name='out' filepath='src/dp-acpi.c' line='254' column='1'/>
+    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-225'/>
+    <function-decl name='efidp_append_instance' mangled-name='efidp_append_instance' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_append_instance@@libefivar.so.0'>
+      <parameter type-id='type-id-224' name='dp'/>
+      <parameter type-id='type-id-224' name='dpi'/>
+      <parameter type-id='type-id-225' name='out'/>
+      <parameter type-id='type-id-224' name='dp'/>
+      <parameter type-id='type-id-224' name='dpi'/>
+      <parameter type-id='type-id-225' name='out'/>
       <return type-id='type-id-15'/>
     </function-decl>
-    <function-decl name='efidp_append_node' mangled-name='efidp_append_node' filepath='src/dp-acpi.c' line='193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_append_node@@libefivar.so.0'>
-      <parameter type-id='type-id-220' name='dp' filepath='src/dp-acpi.c' line='193' column='1'/>
-      <parameter type-id='type-id-220' name='dn' filepath='src/dp-acpi.c' line='193' column='1'/>
-      <parameter type-id='type-id-221' name='out' filepath='src/dp-acpi.c' line='193' column='1'/>
+    <function-decl name='efidp_append_node' mangled-name='efidp_append_node' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_append_node@@libefivar.so.0'>
+      <parameter type-id='type-id-224' name='dp'/>
+      <parameter type-id='type-id-224' name='dn'/>
+      <parameter type-id='type-id-225' name='out'/>
       <return type-id='type-id-15'/>
     </function-decl>
-    <function-decl name='efidp_append_path' mangled-name='efidp_append_path' filepath='src/dp-acpi.c' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_append_path@@libefivar.so.0'>
-      <parameter type-id='type-id-220' name='dp0' filepath='src/dp-acpi.c' line='111' column='1'/>
-      <parameter type-id='type-id-220' name='dp1' filepath='src/dp-acpi.c' line='111' column='1'/>
-      <parameter type-id='type-id-221' name='out' filepath='src/dp-acpi.c' line='111' column='1'/>
+    <function-decl name='efidp_append_path' mangled-name='efidp_append_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_append_path@@libefivar.so.0'>
+      <parameter type-id='type-id-224' name='dp0'/>
+      <parameter type-id='type-id-224' name='dp1'/>
+      <parameter type-id='type-id-225' name='out'/>
       <return type-id='type-id-15'/>
     </function-decl>
-    <function-decl name='efidp_duplicate_path' mangled-name='efidp_duplicate_path' filepath='src/dp-acpi.c' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_duplicate_path@@libefivar.so.0'>
-      <parameter type-id='type-id-220' name='dp' filepath='src/dp-acpi.c' line='101' column='1'/>
-      <parameter type-id='type-id-221' name='out' filepath='src/dp-acpi.c' line='101' column='1'/>
-      <parameter type-id='type-id-220' name='dp' filepath='src/dp-acpi.c' line='101' column='1'/>
-      <parameter type-id='type-id-221' name='out' filepath='src/dp-acpi.c' line='101' column='1'/>
+    <function-decl name='efidp_duplicate_path' mangled-name='efidp_duplicate_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_duplicate_path@@libefivar.so.0'>
+      <parameter type-id='type-id-224' name='dp'/>
+      <parameter type-id='type-id-225' name='out'/>
+      <parameter type-id='type-id-224' name='dp'/>
+      <parameter type-id='type-id-225' name='out'/>
       <return type-id='type-id-15'/>
     </function-decl>
-    <function-decl name='efidp_set_node_data' mangled-name='efidp_set_node_data' filepath='src/dp-acpi.c' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_set_node_data@@libefivar.so.0'>
-      <parameter type-id='type-id-220' name='dn' filepath='src/dp-acpi.c' line='47' column='1'/>
-      <parameter type-id='type-id-71' name='buf' filepath='src/dp-acpi.c' line='47' column='1'/>
-      <parameter type-id='type-id-33' name='bufsize' filepath='src/dp-acpi.c' line='47' column='1'/>
-      <parameter type-id='type-id-220' name='dn' filepath='src/dp-acpi.c' line='47' column='1'/>
-      <parameter type-id='type-id-71' name='buf' filepath='src/dp-acpi.c' line='47' column='1'/>
-      <parameter type-id='type-id-33' name='bufsize' filepath='src/dp-acpi.c' line='47' column='1'/>
+    <function-decl name='efidp_set_node_data' mangled-name='efidp_set_node_data' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_set_node_data@@libefivar.so.0'>
+      <parameter type-id='type-id-224' name='dn'/>
+      <parameter type-id='type-id-71' name='buf'/>
+      <parameter type-id='type-id-33' name='bufsize'/>
+      <parameter type-id='type-id-224' name='dn'/>
+      <parameter type-id='type-id-71' name='buf'/>
+      <parameter type-id='type-id-33' name='bufsize'/>
       <return type-id='type-id-15'/>
     </function-decl>
-    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-222'/>
-    <var-decl name='ops' type-id='type-id-222' visibility='default' filepath='src/lib.c' line='43' column='1'/>
-    <var-decl name='default_ops' type-id='type-id-1' visibility='default' filepath='src/lib.c' line='38' column='1'/>
-    <class-decl name='guidname' size-in-bits='4224' is-struct='yes' visibility='default' filepath='src/guid.h' line='181' column='1' id='type-id-223'>
-      <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='guid' type-id='type-id-17' visibility='default' filepath='src/guid.h' line='182' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='symbol' type-id='type-id-224' visibility='default' filepath='src/guid.h' line='183' column='1'/>
-      </data-member>
-      <data-member access='public' layout-offset-in-bits='2176'>
-        <var-decl name='name' type-id='type-id-224' visibility='default' filepath='src/guid.h' line='184' column='1'/>
-      </data-member>
-    </class-decl>
-
-    <array-type-def dimensions='1' type-id='type-id-12' size-in-bits='2048' id='type-id-224'>
-      <subrange length='256' type-id='type-id-13' id='type-id-225'/>
-
-    </array-type-def>
-    <var-decl name='efi_well_known_names_end' type-id='type-id-223' visibility='default' filepath='src/guid.c' line='100' column='1'/>
-    <var-decl name='efi_well_known_names' type-id='type-id-223' visibility='default' filepath='src/guid.c' line='98' column='1'/>
-    <var-decl name='efi_well_known_guids_end' type-id='type-id-223' visibility='default' filepath='src/guid.c' line='99' column='1'/>
-    <var-decl name='efi_well_known_guids' type-id='type-id-223' visibility='default' filepath='src/guid.c' line='97' column='1'/>
-    <var-decl name='stderr' type-id='type-id-66' visibility='default' filepath='/usr/include/stdio.h' line='137' column='1'/>
-    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
-      <return type-id='type-id-62'/>
-    </function-decl>
-    <function-decl name='__builtin_calloc' mangled-name='calloc' visibility='default' binding='global' size-in-bits='64'>
-      <return type-id='type-id-62'/>
-    </function-decl>
-    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64'>
-      <return type-id='type-id-62'/>
-    </function-decl>
   </abi-instr>
 </abi-corpus>
-- 
2.17.1

